#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x140 (0x578 - 0x438)
// WidgetBlueprintGeneratedClass AthenaGameOverWidget.AthenaGameOverWidget_C
class UAthenaGameOverWidget_C : public UAthenaGameOverDisplay
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x438(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaBattleMapClickHandler_C*        AthenaBattleMapClickHandler;                       // 0x440(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaBattleMapNodeTooltip_C*         AthenaBattleMapNodeTooltip;                        // 0x448(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaBattleMapTimelineWidget_C*      AthenaBattleMapTimelineWidget;                     // 0x450(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEliminatedOverlay_C*                  EliminatedOverlay;                                 // 0x458(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       GameOverSwitcher;                                  // 0x460(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                     OpenShadowPlayHighlights;                          // 0x468(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                             SafeZone_0;                                        // 0x470(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                               Spacer_0;                                          // 0x478(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpectatedPlayerSwitcher_C*            SpectatedPlayerSwitcher;                           // 0x480(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                   Input_ReturnToLobby;                               // 0x488(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   Input_NextTeammate;                                // 0x498(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   Input_PreviousTeammate;                            // 0x4A8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   Input_ReportPlayer;                                // 0x4B8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                         ForceSpectatorSetupForReportingPlayer;             // 0x4C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4E2B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  KillersName;                                       // 0x4D0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         DeadAndSpectating;                                 // 0x4E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4E2C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   Input_Matchmake;                                   // 0x4F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   Input_CancelMatchmaking;                           // 0x500(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                         MatchmakingComplete;                               // 0x510(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4E2D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   Input_FollowSpecialActor;                          // 0x518(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                         WinnerAnnounced;                                   // 0x528(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4E2E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   Input_ToggleBattleMap;                             // 0x530(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   Input_ForceStartPostGame;                          // 0x540(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TSoftClassPtr<class UUserWidget>             PlayerReportClass;                                 // 0x550(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UAthenaGameOverWidget_C* GetDefaultObj();

	void Handle_ForceStartPostGame(bool* Pass_Thru, class UAthenaHUDContext* CallFunc_GetContext_ReturnValue);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* NewSpectatorPawn, bool Temp_bool_Variable, bool CallFunc_IsValid_ReturnValue, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, enum class ESlateVisibility K2Node_Select_Default);
	void GetBattleMapPawn(class ABattleMapPawnLive** BattleMapPawnLive, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AAthena_PlayerController_C* K2Node_DynamicCast_AsAthena_Player_Controller, bool K2Node_DynamicCast_bSuccess, class ASpectatorPawn* CallFunc_GetSpectatorPawn_ReturnValue, class ABattleMapPawnLive* K2Node_DynamicCast_AsBattle_Map_Pawn_Live, bool K2Node_DynamicCast_bSuccess_1);
	void Handle_ToggleBattleMapButton(bool* PassThrough, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AAthena_PlayerController_C* K2Node_DynamicCast_AsAthena_Player_Controller, bool K2Node_DynamicCast_bSuccess);
	void ShouldDisableMatchStatsDisplay(bool* ShouldDisableMatchStatsDisplay, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class AFortPlayerControllerZone* K2Node_DynamicCast_AsFort_Player_Controller_Zone, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_ShouldDisableMatchStatsDisplay_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1);
	void Get_Special_Actor_Input_Action_Data_Row(struct FDataTableRowHandle* Data_Row_Handle, bool* Is_Valid, const struct FDataTableRowHandle& CallFunc_GetSpecialActorInputActionDataTableRow_ReturnValue, bool CallFunc_DoesDataTableRowExist_ReturnValue);
	void Handle_SpectateSpecialActor(bool* PassThrough, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AAthena_PlayerController_C* K2Node_DynamicCast_AsAthena_Player_Controller, bool K2Node_DynamicCast_bSuccess);
	bool CanFollowSpecialActor(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_CanFollowSpecialActor_ReturnValue);
	void FocusPlayerSwitcher(bool CallFunc_IsVisible_ReturnValue);
	void OnPlayerLost(enum class EEndOfMatchReason LostReason);
	void OnWinningScoreDetermined(int32 Score);
	void Handle_CancelMatchmaking(bool* PassThrough);
	void Handle_Matchmake(bool* PassThrough);
	void InGameMatchmakingComplete(bool Success);
	bool CanFollowNextOrPreviousTeammate(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess, class AFortPlayerControllerGameplay* K2Node_DynamicCast_AsFort_Player_Controller_Gameplay, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsPlayerRebootingNow_ReturnValue, bool CallFunc_CanFollowTeammate_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void SetKillersName(struct FFortPlayerDeathReport& FortPlayerDeathReport, bool Temp_bool_Variable, class FText Temp_text_Variable, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_GetPlayerName_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class FText K2Node_Select_Default);
	void OnPlayerOrTeamWon();
	void Handle_ViewMatchStats(bool* PassThrough, class UUserWidget* CallFunc_GetCachedWidget_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess);
	void Handle_ReportPlayer(bool* PassThrough, class AFortPlayerControllerAthena* OwningAthenaPC);
	void InputSetup(UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FDataTableRowHandle& CallFunc_Get_Special_Actor_Input_Action_Data_Row_Data_Row_Handle, bool CallFunc_Get_Special_Actor_Input_Action_Data_Row_Is_Valid, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8);
	void Handle_FollowPreviousTeammate(bool* PassThrough, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerControllerGameplay* K2Node_DynamicCast_AsFort_Player_Controller_Gameplay, bool K2Node_DynamicCast_bSuccess);
	void Handle_FollowNextTeammate(bool* PassThrough, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerControllerGameplay* K2Node_DynamicCast_AsFort_Player_Controller_Gameplay, bool K2Node_DynamicCast_bSuccess);
	void InputRefresh(bool IsCreativeMode, enum class EInputActionState Temp_byte_Variable, enum class EInputActionState Temp_byte_Variable_1, bool Temp_bool_Variable, enum class EInputActionState Temp_byte_Variable_2, enum class EInputActionState Temp_byte_Variable_3, bool Temp_bool_Variable_1, enum class EInputActionState Temp_byte_Variable_4, enum class EInputActionState Temp_byte_Variable_5, class UFortHUDContext* CallFunc_GetContext_ReturnValue, bool Temp_bool_Variable_2, bool CallFunc_GetLocalPlayerHasPlacement_ReturnValue, enum class EInputActionState Temp_byte_Variable_6, enum class EInputActionState Temp_byte_Variable_7, const struct FDataTableRowHandle& CallFunc_Get_Special_Actor_Input_Action_Data_Row_Data_Row_Handle, bool CallFunc_Get_Special_Actor_Input_Action_Data_Row_Is_Valid, bool Temp_bool_Variable_3, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsCreativeModePlaylist_ReturnValue, enum class EInputActionState Temp_byte_Variable_8, enum class EInputActionState Temp_byte_Variable_9, bool CallFunc_CanFollowSpecialActor_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, enum class EInputActionState K2Node_Select_Default, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AAthena_PlayerController_C* K2Node_DynamicCast_AsAthena_Player_Controller, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_CanEnableBattleMapSpectator_ReturnValue, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, enum class EInputActionState K2Node_Select_Default_1, bool Temp_bool_Variable_4, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue_1, bool CallFunc_CanFollowNextOrPreviousTeammate_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, enum class EInputActionState K2Node_Select_Default_2, enum class EInputActionState K2Node_Select_Default_3, enum class EInputActionState K2Node_Select_Default_4);
	void Handle_ReturnToLobby(bool* PassThrough, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerController* K2Node_DynamicCast_AsFort_Player_Controller, bool K2Node_DynamicCast_bSuccess);
	void HighlightCountChanged(int32 HighlightCount, bool Temp_bool_Variable, bool CallFunc_Greater_IntInt_ReturnValue, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, enum class ESlateVisibility K2Node_Select_Default);
	void OnWinnerAnnounced(const class FString& Winner);
	void HideExtraStuffForSpectating();
	void OnViewTargetChanged();
	void OnPlaceChanged();
	void OnPawnDied(struct FFortPlayerDeathReport& DeathReport, class AFortPlayerStateAthena* K2Node_DynamicCast_AsFort_Player_State_Athena, bool K2Node_DynamicCast_bSuccess, class UFortHUDContext* CallFunc_GetContext_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess_1);
	void OnComplete_0A37AB8748FD9BD960E8F2A250F25616(class UUserWidget* UserWidget);
	void Construct();
	void On_Kill_Feed_Updated();
	void BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_188_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_OnDeactivated();
	void Destruct();
	void BP_OnActivated();
	void OnToggleFullscreenMap_Bind(bool bFullscreenMapVisible);
	void SpectatorStreamingChanged(bool bSpectatorStreaming);
	void OnResurrectingNowDelegate_Event_0(bool bResurrectingNow);
	void AttemptOpenPlayerReportingUI();
	void ExecuteUbergraph_AthenaGameOverWidget(int32 EntryPoint, class UFortHUDContext* CallFunc_GetContext_ReturnValue, class UFortHUDContext* CallFunc_GetContext_ReturnValue_1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UUserWidget* K2Node_CustomEvent_UserWidget, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class UUserWidget* Temp_object_Variable, class UFortHUDContext* CallFunc_GetContext_ReturnValue_2, class UCommonActivatablePanel* K2Node_DynamicCast_AsCommon_Activatable_Panel, bool K2Node_DynamicCast_bSuccess, class UCommonUISubsystem* CallFunc_GetContext_ReturnValue_3, class UCommonInputManager* CallFunc_GetInputManager_ReturnValue, class UAthenaHUDContext* CallFunc_GetContext_ReturnValue_4, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class UCommonButton* K2Node_ComponentBoundEvent_Button, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena, bool K2Node_DynamicCast_bSuccess_1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class UAthenaHUDContext* CallFunc_GetContext_ReturnValue_5, enum class EInputActionState Temp_byte_Variable, enum class EInputActionState Temp_byte_Variable_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena_1, bool K2Node_DynamicCast_bSuccess_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_2, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena_2, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_ShouldBeVisible_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_3, bool Temp_bool_Variable, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena_3, bool K2Node_DynamicCast_bSuccess_4, int32 CallFunc_GetCachedHighlightCount_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue_1, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess_5, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena_1, bool K2Node_DynamicCast_bSuccess_6, class UFortHUDContext* CallFunc_GetContext_ReturnValue_6, class AGameStateBase* CallFunc_GetGameState_ReturnValue_2, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena_2, bool K2Node_DynamicCast_bSuccess_7, class AGameStateBase* CallFunc_GetGameState_ReturnValue_3, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena_3, bool K2Node_DynamicCast_bSuccess_8, enum class ESlateVisibility Temp_byte_Variable_2, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, enum class ESlateVisibility Temp_byte_Variable_3, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, bool K2Node_CustomEvent_bFullscreenMapVisible, enum class EInputActionState K2Node_Select_Default, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_11, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_4, class AFortPlayerControllerAthena* K2Node_DynamicCast_AsFort_Player_Controller_Athena_4, bool K2Node_DynamicCast_bSuccess_9, bool K2Node_CustomEvent_bSpectatorStreaming, bool Temp_bool_Variable_1, bool K2Node_CustomEvent_bResurrectingNow, enum class ESlateVisibility K2Node_Select_Default_1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_12, class UFortHUDContext* CallFunc_GetContext_ReturnValue_7, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_5, class UFortAsyncAction_CreateWidgetAsync* CallFunc_CreateWidgetAsync_ReturnValue, class UFortHUDContext* CallFunc_GetContext_ReturnValue_8, bool CallFunc_IsValid_ReturnValue, class UFortHUDContext* CallFunc_GetContext_ReturnValue_9, class UFortHUDContext* CallFunc_GetContext_ReturnValue_10);
};

}


