#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x214 (0x4AC - 0x298)
// WidgetBlueprintGeneratedClass AthenaScoreAlert.AthenaScoreAlert_C
class UAthenaScoreAlert_C : public UAthenaWinConditionMsgBase
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x298(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      Exclamation;                                       // 0x2A0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Outro;                                             // 0x2A8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Intro;                                             // 0x2B0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                          Content;                                           // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            ExclamationTextBlock;                              // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                        MessageTextBlock;                                  // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                        TestMessageType;                                   // 0x2D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ContentOffset;                                     // 0x2D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHUDMessageData>               QueuedMessages;                                    // 0x2D8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                        DefaultShowTime;                                   // 0x2E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        IntroShowTime;                                     // 0x2EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHUDMessageData                       PreviousMessage;                                   // 0x2F0(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         TextStyleDataAsset;                                // 0x348(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6BA9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHUDMessageData                       CurrentMessage;                                    // 0x350(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                          ShowTimeTimerHandle;                               // 0x3A8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHUDMessageData                       NextMessage;                                       // 0x3B0(0x58)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                          OutroTimerHandle;                                  // 0x408(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHUDMessageOverlaySlotPlacementData   BottomCenterOverlaySlotData;                       // 0x410(0x14)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FHUDMessageOverlaySlotPlacementData   TopCenterOverlaySlotData;                          // 0x424(0x14)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FHUDMessageOverlaySlotPlacementData   CenterRightOverlaySlotData;                        // 0x438(0x14)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FHUDMessageCanvasSlotPlacementData    BottomCenterCanvasSlotData;                        // 0x44C(0x20)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FHUDMessageCanvasSlotPlacementData    TopCenterCanvasSlotData;                           // 0x46C(0x20)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FHUDMessageCanvasSlotPlacementData    CenterRightCanvasSlotData;                         // 0x48C(0x20)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

	static class UClass* StaticClass();
	static class UAthenaScoreAlert_C* GetDefaultObj();

	void DoesViewTargetsTeamMatchTriggeringPlayersTeam(class APlayerState* TriggeringPlayer, bool* bDoesMatch, bool bReturnDoesMatch, bool CallFunc_IsValid_ReturnValue, uint8 CallFunc_GetActorTeam_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AActor* CallFunc_GetViewTarget_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, uint8 CallFunc_GetActorTeam_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void DoesViewTargetMatchTriggeringPlayer(class APlayerState* TriggeringPlayer, bool* bDoesMatch, bool bReturnDoesMatch, bool CallFunc_IsValid_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AActor* CallFunc_GetViewTarget_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class APawn* K2Node_DynamicCast_AsPawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsValid_ReturnValue_2);
	void DoesTeamMatchViewTargetsTeam(int32 Team, bool* bDoesMatchViewTargetsTeam, uint8 CallFunc_Conv_IntToByte_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class AActor* CallFunc_GetViewTarget_ReturnValue, bool CallFunc_IsValid_ReturnValue, uint8 CallFunc_GetActorTeam_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void HUDMessageToText(const struct FHUDMessageData& HUDMessage, class FText* Text, class FText MsgSoundText, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, class FText CallFunc_Conv_BoolToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_4, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_5, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_6, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_7, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);
	void ConvertToHUDMessage(enum class EHUDMessagePlacement Placement, struct FAthenaGameMessageData& AthenaGameMessageData, struct FHUDMessageData* HUDMessageData, const struct FHUDMessageData& K2Node_MakeStruct_HUDMessageData);
	void SetPlacement(class UCanvasPanelSlot* CanvasSlot, class UOverlaySlot* OverlaySlot, enum class EHUDMessagePlacement Temp_byte_Variable, bool CallFunc_IsValid_ReturnValue, const struct FHUDMessageCanvasSlotPlacementData& K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue_1, enum class EHUDMessagePlacement Temp_byte_Variable_1, const struct FHUDMessageOverlaySlotPlacementData& K2Node_Select_Default_1, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue);
	void FillInitialPositionData(class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue, const struct FVector2D& CallFunc_GetAlignment_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FHUDMessageOverlaySlotPlacementData& K2Node_MakeStruct_HUDMessageOverlaySlotPlacementData, const struct FAnchors& CallFunc_GetAnchors_ReturnValue, const struct FVector2D& CallFunc_GetPosition_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FHUDMessageCanvasSlotPlacementData& K2Node_MakeStruct_HUDMessageCanvasSlotPlacementData);
	void TryToDisplayMessage(const struct FHUDMessageData& CurrentMessage, bool CallFunc_HandleMessageQueuing_bMessageWasQueued, bool CallFunc_IsMessageValidForWidget_bIsValid);
	void HandleMessageQueuing(bool* bMessageWasQueued, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void DisplayMessage(bool CallFunc_ShouldPlayIntroAnimations_bShouldPlay, bool CallFunc_NotEqual_ByteByte_ReturnValue);
	void ShouldColorizeExclamationTextBlock(bool* bShouldColorize, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue);
	void ShouldShowExclamation(bool* bShouldShow, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void UpdateExclamationTextBlockColors(class FText& Message, class FName CallFunc_GetRichTextStyleFromMessage_Style, const struct FRichTextStyleRow& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, const struct FSlateFontInfo& K2Node_MakeStruct_SlateFontInfo, const struct FSlateColor& CallFunc_GetTextFillColor_ReturnValue);
	void GetRichTextStyleFromMessage(class FText& Message, class FName* Style, const class FString& CallFunc_Conv_TextToString_ReturnValue, int32 CallFunc_FindSubstring_ReturnValue, int32 CallFunc_FindSubstring_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const class FString& CallFunc_GetSubstring_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue);
	void IsMessageValidForWidget(const struct FHUDMessageData& Message, bool* bIsValid, bool CallFunc_IsMessageValidForViewTarget_bIsValid, bool CallFunc_DoesWidgetHandleThisEnum_bIsValid);
	void IsMessageValidForViewTarget(const struct FHUDMessageData& Message, bool* bIsValid, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_DoesViewTargetsTeamMatchTriggeringPlayersTeam_bDoesMatch, bool Temp_bool_Variable, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, bool K2Node_Select_Default, bool CallFunc_EqualEqual_ByteByte_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_5, bool CallFunc_DoesViewTargetMatchTriggeringPlayer_bDoesMatch, bool CallFunc_DoesTeamMatchViewTargetsTeam_bDoesMatchViewTargetsTeam);
	void GetShowTimeInterval(struct FHUDMessageData& MessageData, float* ShowTimeInterval, float Temp_float_Variable, bool CallFunc_NearlyEqual_FloatFloat_ReturnValue, float Temp_float_Variable_1, float Temp_float_Variable_2, float Temp_float_Variable_3, float Temp_float_Variable_4, float Temp_float_Variable_5, float Temp_float_Variable_6, float Temp_float_Variable_7, float Temp_float_Variable_8, float Temp_float_Variable_9, float Temp_float_Variable_10, enum class EAthenaGameMsgType Temp_byte_Variable, float K2Node_Select_Default);
	void OnShowTimeExpired();
	void PlayIntroAnimations(bool CallFunc_ShouldColorizeExclamationTextBlock_bShouldColorize, bool CallFunc_ShouldShowExclamation_bShouldShow, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1);
	void ShouldPlayIntroAnimations(bool* bShouldPlay, bool ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue);
	void StartHideTimer(class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, float CallFunc_GetShowTimeInterval_ShowTimeInterval, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue);
	void DoesWidgetHandleThisEnum(enum class EAthenaGameMsgType MessageType, bool* bIsValid, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, bool CallFunc_EqualEqual_ByteByte_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3);
	void OnOutroAnimationFinished(const struct FAthenaGameMessageData& NextMessage2, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void OnGameModeMessageRequest(const struct FAthenaGameMessageData& MessageData, const struct FHUDMessageData& CallFunc_ConvertToHUDMessage_HUDMessageData);
	void OnHideGameModeMessageRequest(enum class EAthenaGameMsgType MessageType, bool bInstantHide, bool bClearQueue, float CallFunc_GetEndTime_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_DoesWidgetHandleThisEnum_bIsValid, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void BindToGameStateEvents(class AFortGameState* GameState, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1);
	void UpdateContentTranslation(bool bShiftContentDown, bool Temp_bool_Variable, const struct FVector2D& Temp_struct_Variable, float CallFunc_Conv_IntToFloat_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FVector2D& K2Node_Select_Default);
	void PlaySoundFromType(const struct FHUDMessageData& MessageData, class USoundCue* SoundCue, class USoundCue* Temp_object_Variable, class USoundCue* Temp_object_Variable_1, class USoundCue* Temp_object_Variable_2, class USoundCue* Temp_object_Variable_3, class USoundCue* Temp_object_Variable_4, class USoundCue* Temp_object_Variable_5, class USoundCue* Temp_object_Variable_6, class USoundCue* Temp_object_Variable_7, class USoundCue* Temp_object_Variable_8, class USoundCue* Temp_object_Variable_9, class USoundCue* Temp_object_Variable_10, class USoundCue* Temp_object_Variable_11, class USoundCue* Temp_object_Variable_12, class USoundCue* Temp_object_Variable_13, class USoundCue* Temp_object_Variable_14, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, enum class EAthenaGameMsgType Temp_byte_Variable, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue, bool CallFunc_IsValid_ReturnValue, class USoundCue* K2Node_Select_Default);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BP_OnMinigameEnded();
	void BP_OnGameStateInitialized(class AFortGameState* GameState);
	void BP_OnShowHUDMessage(const struct FHUDMessageData& MessageData);
	void ExecuteUbergraph_AthenaScoreAlert(int32 EntryPoint, class FText Temp_text_Variable, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, class FText Temp_text_Variable_4, bool K2Node_Event_IsDesignTime, bool CallFunc_NotEqual_IntInt_ReturnValue, int32 Temp_int_Variable, class FText K2Node_Select_Default, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, class AFortGameState* K2Node_Event_GameState, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue, const struct FHUDMessageData& K2Node_Event_MessageData, bool CallFunc_RemoveGameplayTag_ReturnValue);
};

}


