#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xC0 (0x600 - 0x540)
// WidgetBlueprintGeneratedClass AthenaInventoryPanel.AthenaInventoryPanel_C
class UAthenaInventoryPanel_C : public UAthenaInventoryPanelBase
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x540(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      FadeMessage;                                       // 0x548(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAlterationsWidget_C*                  AlterationsWidget;                                 // 0x550(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                       BackgroundBlur_Header;                             // 0x558(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                CloseIcon;                                         // 0x560(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                         CommonBorderMajorTab;                              // 0x568(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInspectionMainItemDetailsHostPanel_C* ItemDetails;                                       // 0x570(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                        MobileCloseButton;                                 // 0x578(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              OverlayCloseButton;                                // 0x580(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                             SafeZone_0;                                        // 0x588(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuantitySelector_C*                   MulchQuantitySelector;                             // 0x590(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuantitySelector_C*                   QuantitySelectorWidget;                            // 0x598(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                   Input_AthenaMoveItem;                              // 0x5A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   Input_AthenaDropHalf;                              // 0x5B0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTimerHandle                          HackTimer;                                         // 0x5C0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bOpenedFromVendingMachine;                         // 0x5C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bCreateMode;                                       // 0x5C9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_640A[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CreativeItemTossDistance;                          // 0x5CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                           Playset_Inventory_Widget_Ref;                      // 0x5D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  SelectedTabID;                                     // 0x5D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  CreativeTabID;                                     // 0x5E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  PlayTabID;                                         // 0x5E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                           MyIslandInventoryWidgetRef;                        // 0x5F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  MyIslandTabID;                                     // 0x5F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UAthenaInventoryPanel_C* GetDefaultObj();

	void HandleDirectCloseFromPlaceNow(bool* PassThrough, class UFortUINavigationManager* CallFunc_GetUINavigationManager_ReturnValue, class UFortHUDContext* CallFunc_GetContext_ReturnValue);
	void UpdateStyle(class FName TabId, bool K2Node_SwitchName_CmpSuccess);
	void UpdateSlotVisibility(int32 SlotsToHide, int32 InventoryCapacity);
	void SelectTab(bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool CallFunc_NotEqual_NameName_ReturnValue, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess, class FName K2Node_Select_Default, bool CallFunc_IsPlayingMinigame_ReturnValue, class FName K2Node_Select_Default_1, bool CallFunc_SelectTabByID_ReturnValue);
	void DropItemWithDialog(class UFortWorldItem* Item, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 CallFunc_GetNumInStack_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	struct FEventReply OnTouchStarted(const struct FGeometry& MyGeometry, struct FPointerEvent& InTouchEvent, bool CallFunc_HandleClose_PassThrough, bool CallFunc_IsDragOverDropArea_bOverDropArea, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void IsDragItemDroppable(class UObject* DragDropObject, bool* bIsDroppable, class UAthenaInventoryDragDrop_C* K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop, bool K2Node_DynamicCast_bSuccess, class UFortWorldItem* K2Node_DynamicCast_AsFort_World_Item, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_CanBeDropped_ReturnValue);
	void IsDragOverDropArea(struct FPointerEvent& PointerEvent, bool* bOverDropArea, int32 Temp_int_Variable, const struct FVector2D& CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue, const struct FGeometry& CallFunc_GetCachedGeometry_ReturnValue, const struct FGeometry& CallFunc_GetCachedGeometry_ReturnValue_1, bool CallFunc_IsUnderLocation_ReturnValue, bool CallFunc_IsUnderLocation_ReturnValue_1, int32 CallFunc_GetActiveWidgetIndex_ReturnValue, bool K2Node_Select_Default, bool CallFunc_Not_PreBool_ReturnValue);
	void HandleDropHalf(bool* PassThrough, class UAthenaInventoryContext* CallFunc_GetContext_ReturnValue, class UFortItem* CallFunc_GetSelectedInventoryItem_ReturnValue, class UFortWorldItem* K2Node_DynamicCast_AsFort_World_Item, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_GetNumInStack_ReturnValue, int32 CallFunc_Divide_IntInt_ReturnValue, int32 CallFunc_Max_ReturnValue);
	void RegisterDropHalf(enum class EInputActionState Temp_byte_Variable, enum class EInputActionState Temp_byte_Variable_1, class UWidget* CallFunc_GetActiveWidget_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Variable, class UAthenaInventoryContext* CallFunc_GetContext_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UFortItem* CallFunc_GetSelectedInventoryItem_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_CanBeDropped_ReturnValue, enum class EInputActionState K2Node_Select_Default);
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation, enum class EAthenaDragDropAction Temp_byte_Variable, bool CallFunc_IsDragItemDroppable_bIsDroppable, class UAthenaInventoryDragDrop_C* K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop, bool K2Node_DynamicCast_bSuccess, class UAthenaInventoryDragDrop_C* K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsDragOverDropArea_bOverDropArea, enum class EAthenaDragDropAction Temp_byte_Variable_1, bool Temp_bool_Variable, enum class EAthenaDragDropAction K2Node_Select_Default);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation, bool CallFunc_IsUsingTouch_ReturnValue, bool CallFunc_IsDragItemDroppable_bIsDroppable, class UAthenaInventoryDragDrop_C* K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop, bool K2Node_DynamicCast_bSuccess, class UFortWorldItem* K2Node_DynamicCast_AsFort_World_Item, bool K2Node_DynamicCast_bSuccess_1, const struct FInputEvent& CallFunc_GetInputEventFromPointerEvent_ReturnValue, bool CallFunc_InputEvent_IsShiftDown_ReturnValue, int32 CallFunc_GetNumInStack_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, int32 CallFunc_Divide_IntInt_ReturnValue, int32 CallFunc_GetNumInStack_ReturnValue_1, int32 CallFunc_Max_ReturnValue, bool CallFunc_IsDragOverDropArea_bOverDropArea, class UFortInventoryContext* CallFunc_GetContext_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool Temp_bool_Variable, class UAthenaHUDContext* CallFunc_GetContext_ReturnValue_1, int32 K2Node_Select_Default);
	void RefreshItemDetails(class UFortItem* ItemToDetail, bool CallFunc_IsValid_ReturnValue);
	class UWidget* NavAmmo(enum class EUINavigation Navigation, bool Temp_bool_Variable, enum class EUINavigation Temp_byte_Variable, class UWidget* Temp_object_Variable, class UWidget* Temp_object_Variable_1, class UWidget* Temp_object_Variable_2, class UWidget* Temp_object_Variable_3, class UWidget* Temp_object_Variable_4, class UWidget* CallFunc_GetFirstEquipSlotButton_ReturnValue, int32 CallFunc_GetNumItems_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class UWidget* K2Node_Select_Default, class UWidget* K2Node_Select_Default_1);
	class UWidget* NavResources(enum class EUINavigation Navigation, bool Temp_bool_Variable, enum class EUINavigation Temp_byte_Variable, class UWidget* Temp_object_Variable, class UWidget* Temp_object_Variable_1, class UWidget* Temp_object_Variable_2, class UWidget* Temp_object_Variable_3, class UWidget* Temp_object_Variable_4, class UWidget* CallFunc_GetFirstEquipSlotButton_ReturnValue, int32 CallFunc_GetNumItems_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class UWidget* K2Node_Select_Default, class UWidget* K2Node_Select_Default_1);
	class UWidget* NavEquipment(enum class EUINavigation Navigation, bool Temp_bool_Variable, class UFortItemTileView* Temp_object_Variable, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, class UFortItemTileView* Temp_object_Variable_1, enum class EUINavigation Temp_byte_Variable, class UWidget* Temp_object_Variable_2, class UWidget* Temp_object_Variable_3, class UWidget* Temp_object_Variable_4, class UWidget* Temp_object_Variable_5, class UWidget* Temp_object_Variable_6, bool Temp_bool_Variable_3, class UAthenaInventoryContext* CallFunc_GetContext_ReturnValue, bool CallFunc_IsSwapping_ReturnValue, int32 CallFunc_GetNumItems_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_GetNumItems_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue_1, int32 CallFunc_GetNumItems_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue_2, class UFortItemTileView* K2Node_Select_Default, class UFortItemTileView* K2Node_Select_Default_1, class UFortItemTileView* K2Node_Select_Default_2, int32 CallFunc_GetNumItems_ReturnValue_3, bool CallFunc_Greater_IntInt_ReturnValue_3, class UWidget* K2Node_Select_Default_3, class UWidget* K2Node_Select_Default_4);
	void HandleDropItemConfirmationCallback(int32 ChosenQuantity, class UFortItem* Item, class UFortWorldItem* K2Node_DynamicCast_AsFort_World_Item, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Greater_IntInt_ReturnValue);
	void DestroyQuantitySelectorWidget(bool CallFunc_IsValid_ReturnValue);
	void CreateQuantitySelectorWidget(class UFortWorldItem* Item, class FText ConfirmationText, int32 CallFunc_GetNumInStack_ReturnValue, int32 CallFunc_Divide_IntInt_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UQuantitySelector_C* CallFunc_Create_ReturnValue);
	void DropItem(class UFortWorldItem* Item, int32 Quantity, class UFortInventoryContext* CallFunc_GetContext_ReturnValue, class UFortItemTileView* CallFunc_GetTileViewForItem_ReturnValue, class UFortItemTileView* CallFunc_GetTileViewForItem_ReturnValue_1, int32 CallFunc_GetNumInStack_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	void HandleDrop(bool* PassThrough, class UAthenaInventoryContext* CallFunc_GetContext_ReturnValue, class UFortItem* CallFunc_GetSelectedInventoryItem_ReturnValue, class UFortWorldItem* K2Node_DynamicCast_AsFort_World_Item, bool K2Node_DynamicCast_bSuccess);
	void RegisterDrop(enum class EInputActionState Temp_byte_Variable, enum class EInputActionState Temp_byte_Variable_1, class UWidget* CallFunc_GetActiveWidget_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Variable, class UAthenaInventoryContext* CallFunc_GetContext_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UFortItem* CallFunc_GetSelectedInventoryItem_ReturnValue, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_CanBeDropped_ReturnValue, enum class EInputActionState K2Node_Select_Default);
	void TrySetupInputHandling();
	void RegisterBack(class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess, class UFortGlobalUIContext* CallFunc_GetLocalPlayerSubsystem_ReturnValue, bool CallFunc_IsMobileGame_ReturnValue, bool CallFunc_IsUsingGamepad_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_Not_PreBool_ReturnValue, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle, bool CallFunc_BooleanAND_ReturnValue);
	void HandleClose(bool* PassThrough, class UAthenaInventoryContext* CallFunc_GetContext_ReturnValue, class UUserWidget* CallFunc_GetCreativeInventoryWidget_ReturnValue, class UFortHUDContext* CallFunc_GetContext_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, class UFortCreativeItemListMenu* K2Node_DynamicCast_AsFort_Creative_Item_List_Menu, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsSubTabOpened_ReturnValue, class UFortUINavigationManager* CallFunc_GetUINavigationManager_ReturnValue, class UAthenaInventoryContext* CallFunc_GetContext_ReturnValue_2, bool CallFunc_IsSwapping_ReturnValue);
	void BP_OnActivated();
	void Construct();
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void BP_OnDeactivated();
	void RequestEquip(class UFortItem* Item);
	void PostActivate();
	void BndEvt__TabsMajor_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature(class FName TabId);
	void BndEvt__TabsMajor_K2Node_ComponentBoundEvent_1_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void Refresh_Input_for_Current_Major_Tab();
	void BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnQuickbarContentsChanged(enum class EFortQuickBars QuickbarIndex, TArray<int32>& ChangedSlots);
	void OnClientEnterVolume(class APlayerState* Client, class AFortVolume* Volume);
	void OnClientExitVolume(class APlayerState* Client, class AFortVolume* Volume);
	void HandleCloseFromContentBrowser();
	void OnOpenInventoryTab(int32 TabIndex);
	void ExecuteUbergraph_AthenaInventoryPanel(int32 EntryPoint, class UFortItem* K2Node_Event_Item, const struct FPointerEvent& K2Node_Event_PointerEvent, class UDragDropOperation* K2Node_Event_Operation, enum class EFortItemType CallFunc_GetType_ReturnValue, class UAthenaInventoryDragDrop_C* K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_HandleClose_PassThrough, class FName K2Node_ComponentBoundEvent_TabId_1, class FName K2Node_ComponentBoundEvent_TabId, class UCommonButton* K2Node_ComponentBoundEvent_TabButton, class UTopBarTabButton_C* K2Node_DynamicCast_AsTop_Bar_Tab_Button, bool K2Node_DynamicCast_bSuccess_1, class UFortUINavigationManager* CallFunc_GetUINavigationManager_ReturnValue, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue, class UFortInventoryContext* CallFunc_GetContext_ReturnValue, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_IsPlayingMinigame_ReturnValue, bool CallFunc_HandleClose_PassThrough_1, class UCommonButton* K2Node_ComponentBoundEvent_Button, enum class EFortQuickBars K2Node_CustomEvent_QuickbarIndex, TArray<int32>& K2Node_CustomEvent_ChangedSlots, int32 Temp_int_Variable, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, int32 Temp_int_Variable_1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class AFortVolumeManager* CallFunc_GetVolumeManager_OutVolumeManager, enum class EVolumeValidityResult CallFunc_GetVolumeManager_OutIsValid, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_IsValid_ReturnValue, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, class APlayerState* K2Node_CustomEvent_Client_1, class AFortVolume* K2Node_CustomEvent_Volume_1, class AFortMinigame* CallFunc_GetMinigameForVolume_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class APlayerState* K2Node_CustomEvent_Client, class AFortVolume* K2Node_CustomEvent_Volume, class AFortMinigame* CallFunc_GetMinigameForVolume_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool Temp_bool_Variable, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, bool CallFunc_IsValid_ReturnValue_5, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, class AFortVolume* CallFunc_GetVolumeForPlayerState_ReturnValue, bool CallFunc_IsValid_ReturnValue_6, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, class UAthenaInventoryContext* CallFunc_GetContext_ReturnValue_1, class UAthenaInventoryContext* CallFunc_GetContext_ReturnValue_2, bool CallFunc_HandleDirectCloseFromPlaceNow_PassThrough, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class UWidget* CallFunc_GetActiveWidget_ReturnValue, class AFortGameStateAthena* K2Node_DynamicCast_AsFort_Game_State_Athena, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsBattleLabModePlaylist_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsCreativeOrPlaygroundModePlaylist_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_IsValid_ReturnValue_7, enum class ESlateVisibility K2Node_Select_Default, class UUserWidget* CallFunc_GetMyIslandWidget_ReturnValue, TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface, bool K2Node_DynamicCast_bSuccess_4, TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_1, bool K2Node_DynamicCast_bSuccess_5, class UUserWidget* CallFunc_GetMyIslandWidget_ReturnValue_1, class UUserWidget* CallFunc_GetMyIslandWidget_ReturnValue_2, TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_2, bool K2Node_DynamicCast_bSuccess_6, TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_3, bool K2Node_DynamicCast_bSuccess_7, class UUserWidget* CallFunc_GetCreativeInventoryWidget_ReturnValue, class UUserWidget* CallFunc_GetCreativeInventoryWidget_ReturnValue_1, TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_4, bool K2Node_DynamicCast_bSuccess_8, TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_5, bool K2Node_DynamicCast_bSuccess_9, TScriptInterface<class ICreativeInventoryInterface_C> K2Node_DynamicCast_AsCreative_Inventory_Interface_6, bool K2Node_DynamicCast_bSuccess_10, class UFortInventoryContext* CallFunc_GetContext_ReturnValue_3, int32 K2Node_Event_TabIndex, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, class UWidget* K2Node_Select_Default_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_2, class FName K2Node_Select_Default_2, bool CallFunc_SelectTabByID_ReturnValue);
};

}


