#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x18 (0x428 - 0x410)
// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
class UAthenaLoadingScreenPreviewPanelBase : public UAthenaLoadingScreenPreviewPanel
{
public:
	class UNativeWidgetHost*                     LoadingScreenSlot;                                 // 0x410(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_63[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButton*                         Button_Close;                                      // 0x420(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaLoadingScreenPreviewPanelBase* GetDefaultObj();

};

// 0x8 (0x430 - 0x428)
// Class FortniteUI.ApolloIntroLoadingPanel
class UApolloIntroLoadingPanel : public UAthenaLoadingScreenPreviewPanelBase
{
public:
	class UFortPlaylistAthena*                   ApolloIntroPlaylist;                               // 0x428(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UApolloIntroLoadingPanel* GetDefaultObj();

};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.ApolloIntroShimBase
class UApolloIntroShimBase : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UApolloIntroShimBase* GetDefaultObj();

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x40 (0x298 - 0x258)
// Class FortniteUI.FortHUDElementWidget
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_64[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          ElementTag;                                        // 0x260(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 HUDElementTag;                                     // 0x268(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class ESlateVisibility                  HiddenVisibility;                                  // 0x288(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_65[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UTutorialHighlight*                    TutorialHighlight;                                 // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortHUDElementWidget* GetDefaultObj();

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility);
	void HandleOnHUDResetToDefaults();
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags);
};

// 0x50 (0x2E8 - 0x298)
// Class FortniteUI.LTMWidgetBase
class ULTMWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_66[0x40];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AFortGameplayMutator>      MutatorClassToWaitFor;                             // 0x2D8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_67[0x1];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x2E1(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_68[0x5];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ULTMWidgetBase* GetDefaultObj();

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	void OnGamePhaseChanged(enum class EAthenaGamePhase NewPhase);
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
	bool K2_HasActiveContent();
	uint8 GetViewingTeam();
};

// 0x18 (0x300 - 0x2E8)
// Class FortniteUI.AshtonWidgetBase
class UAshtonWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Ashton*             AshtonMutatorRef;                                  // 0x2E8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_69[0x10];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAshtonWidgetBase* GetDefaultObj();

	void UpdateAllUI(bool bFirstUpdate);
	void OnVillainRespawnsRemainingChanged();
	void OnVillainRespawnCountChanged(int32 NumRespawnsLeft, float RespawnPercentLeft);
	void OnStoneListChanged();
	void OnStoneChanged(enum class EAshtonStoneType StoneType, enum class EAshtonStoneStateType StoneState);
	void OnOpenWidget();
	void OnCloseWidget();
};

// 0x20 (0x50 - 0x30)
// Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys
class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys : public UBlueprintAsyncActionBase
{
public:
	UMulticastInlineDelegateProperty_            Finished;                                          // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortPlayerSurveyDispatcher*           Dispatcher;                                        // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6B[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* GetDefaultObj();

	void OnAllSurveysFinishedDelegate__DelegateSignature();
	void HandleAllSurveysFinished(class UObject* Source);
	class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* DisplaySurveys(class UFortPlayerSurveyDispatcher* Dispatcher, int32 SurveyCount);
};

// 0x20 (0x48 - 0x28)
// Class FortniteUI.AthenaAccoladeWrapper
class UAthenaAccoladeWrapper : public UObject
{
public:
	struct FAthenaAccolades                      AccoladeData;                                      // 0x28(0x20)(NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaAccoladeWrapper* GetDefaultObj();

};

// 0x8 (0x260 - 0x258)
// Class FortniteUI.AthenaAccoladeListEntryWidget
class UAthenaAccoladeListEntryWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_6C[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAccoladeListEntryWidget* GetDefaultObj();

	void SetTitle(class FText& TitleText);
	void SetSource(class FText& SourceText);
	void SetIcon(class UFortAccoladeItemDefinition* ItemDef);
	void SetCount(int32 Count);
};

// 0x0 (0x368 - 0x368)
// Class FortniteUI.AthenaAccoladeListWidget
class UAthenaAccoladeListWidget : public UCommonListView
{
public:

	static class UClass* StaticClass();
	static class UAthenaAccoladeListWidget* GetDefaultObj();

	void PopulateWidget();
};

// 0x80 (0x318 - 0x298)
// Class FortniteUI.AthenaAccoladesWidget
class UAthenaAccoladesWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_6E[0x40];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FXPUIEvent>                    XPEvents;                                          // 0x2D8(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FXPUIEvent                            CurrentEvent;                                      // 0x2E8(0x28)(Protected, NativeAccessSpecifierProtected)
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x310(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F[0x6];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAccoladesWidget* GetDefaultObj();

	void OpenWidget(class UFortAccoladeItemDefinition* AccoladeDef, int32& XpValue, class FText& DisplayName);
	void OnXPEvent(struct FXPUIEvent& XPEvent);
	void OnStompedByOtherWidget();
	bool HasMoreXPEvents();
	void ForwardEvent();
	void EventAdded();
	void CloseWidget();
};

// 0x0 (0x30 - 0x30)
// Class FortniteUI.AthenaAccountContext
class UAthenaAccountContext : public UBlueprintContextBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaAccountContext* GetDefaultObj();

	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);
	bool ShouldReplaceBattleStarsWithAlternateReward();
	bool IsAtMaxBattlePassTier();
	class FText GetCurrentSeasonNumberAsText(bool bFullText);
	int32 GetCurrentSeasonNumber();
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	class FText GetCurrentChapterNumberAsText(bool bFullText);
	class FText GetCurrentChapterAndSeasonText();
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.AthenaChatModalWrapper
class UAthenaChatModalWrapper : public UCommonActivatableWidget
{
public:
	class UFortChatContainer*                    ChatContainer_Chat;                                // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaChatModalWrapper* GetDefaultObj();

};

// 0x20 (0x2F0 - 0x2D0)
// Class FortniteUI.AthenaActivatableChatWidget
class UAthenaActivatableChatWidget : public UCommonActivatableWidget
{
public:
	class UAthenaChatModalWrapper*               Activatable_ModalBindings;                         // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_HoldToOpen;                                 // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                            InputActionDataTable;                              // 0x2E0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_73[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaActivatableChatWidget* GetDefaultObj();

};

// 0x18 (0x2B0 - 0x298)
// Class FortniteUI.AthenaAIKillsBase
class UAthenaAIKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x2A0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x2A8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_74[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAIKillsBase* GetDefaultObj();

	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};

// 0x8 (0x238 - 0x230)
// Class FortniteUI.AthenaAwardAlertBase
class UAthenaAwardAlertBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x230(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaAwardAlertBase* GetDefaultObj();

	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
};

// 0x8 (0x238 - 0x230)
// Class FortniteUI.AthenaBattleMapClickHandler
class UAthenaBattleMapClickHandler : public UUserWidget
{
public:
	uint8                                        Pad_75[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapClickHandler* GetDefaultObj();

	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
};

// 0x40 (0x298 - 0x258)
// Class FortniteUI.AthenaBattleMapNodeTooltip
class UAthenaBattleMapNodeTooltip : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      TextBlock_NodeTitle;                               // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_NodeDescription;                         // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_NodeTime;                                // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Selection;                                  // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Scrubbing;                                  // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_ScrubbingGamepad;                           // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_79[0x10];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapNodeTooltip* GetDefaultObj();

	void OnReplayLevelStreamingChanged(bool bStreaming);
	void HandleUnhoveredNode(class ABattleMapNode* Node, enum class EBattleMapHoveredReason Reason);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
	void HandleTimelineModeChanged(bool bEnabled);
	void HandleInputMethodChanged(enum class ECommonInputType NewInputType);
	void HandleHoveredNode(class ABattleMapNode* Node, enum class EBattleMapHoveredReason Reason);
	void HandleCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
};

// 0x30 (0x438 - 0x408)
// Class FortniteUI.FortActivatablePanel
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                         bIsPushedOnToContentPanelStack;                    // 0x408(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAlreadyOnContentPanelStack;                     // 0x409(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInputPriority                    InputPriority;                                     // 0x40A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsClosableByPlayerInput;                          // 0x40B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7B[0x2C];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActivatablePanel* GetDefaultObj();

	void RestoreScrollWidget(class UWidget* FallbackWidget);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void AsyncPlaySound2D(class UObject* WorldContextObject, TSoftObjectPtr<class USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime);
};

// 0xC0 (0x4F8 - 0x438)
// Class FortniteUI.AthenaBattleMapTimelineWidget
class UAthenaBattleMapTimelineWidget : public UFortActivatablePanel
{
public:
	class UCommonButton*                         Button_Forward;                                    // 0x438(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Backward;                                   // 0x440(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ForwardButtonPositionAlpha;                        // 0x448(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BackwardButtonPositionAlpha;                       // 0x44C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ForwardDataTableRow;                               // 0x450(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   BackwardDataTableRow;                              // 0x460(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   StopDataTableRow;                                  // 0x470(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ScrubToDataTableRow;                               // 0x480(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ExitBattleMapDataTableRow;                         // 0x490(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ZoomInDataTableRow;                                // 0x4A0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ZoomOutDataTableRow;                               // 0x4B0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_7D[0x38];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapTimelineWidget* GetDefaultObj();

	void OnReplayLevelStreamingChanged(bool bStreaming);
	void HandleZoomOutPressed(bool* bPassThrough);
	void HandleZoomOutHeld(float HeldPercent);
	void HandleZoomInPressed(bool* bPassThrough);
	void HandleZoomInHeld(float HeldPercent);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
	void HandleTimelineStopPressed(bool* bPassThrough);
	void HandleTimelineScrubToPressed(bool* bPassThrough);
	void HandleTimelineModeChanged(bool bEnabled);
	void HandleTimelineForwardPressed(bool* bPassThrough);
	void HandleTimelineBackwardPressed(bool* bPassThrough);
	void HandleSelectedNode(class ABattleMapNode* InSelectedNode);
	void HandleExitBattleMapPressed(bool* bPassThrough);
	void HandleCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
};

// 0x10 (0x268 - 0x258)
// Class FortniteUI.AthenaBattlePassItemTracker
class UAthenaBattlePassItemTracker : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_Category;                                     // 0x258(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonNumericTextBlock*               Text_Counter;                                      // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBattlePassItemTracker* GetDefaultObj();

	void OnInterpStarted();
	void OnInterpEnded(class UCommonNumericTextBlock* NumericTextBlock, bool HadCompleted);
};

// 0x88 (0x2E0 - 0x258)
// Class FortniteUI.AthenaBattlePassTracker
class UAthenaBattlePassTracker : public UCommonUserWidget
{
public:
	uint8                                        Pad_7F[0x20];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonRichTextBlock*                  RichText_PaidItemsCollected;                       // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_01;                          // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_02;                          // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_03;                          // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_04;                          // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassScreenPurchaseButton*       Button_PurchaseBattlePass;                         // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortStoreFrontOfferDetailsWidgetBase> BattlePassOfferDetailsClass;                       // 0x2A8(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_80[0x10];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattlePassTracker* GetDefaultObj();

	void HandleBattlePassPurchaseComplete(bool bSuccess);
};

// 0x28 (0x2C0 - 0x298)
// Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase
class UAthenaBroadcastFollowedPlayerInfoBase : public UFortHUDElementWidget
{
public:
	class UAthenaSpectatorPlayerWidgetBase*      PlayerWidget;                                      // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*       HitPointBar_Health;                                // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*       HitPointBar_Shield;                                // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*       HitPointBar_Vehicle;                               // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_85[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastFollowedPlayerInfoBase* GetDefaultObj();

	void OnVehicleStateChanged(class AActor* NewVehicle, class AActor* OldVehicle);
	void OnPipModeChanged(bool bPipModeEnabled);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* FollowedPlayerState);
	void OnEliminatedStateChanged(class UAthenaRemotePlayerViewData* PlayerData, bool bIsEliminated);
};

// 0x20 (0x2B8 - 0x298)
// Class FortniteUI.AthenaGamePhaseWidgetBase
class UAthenaGamePhaseWidgetBase : public UFortHUDElementWidget
{
public:
	class UMaterialInterface*                    StormComingFontMaterial;                           // 0x298(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StormComingWarningTime;                            // 0x2A0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_89[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UTextBlock*                            TimeText;                                          // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8A[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGamePhaseWidgetBase* GetDefaultObj();

	void OnGameStateSet(class AFortGameState* InGameState);
	void OnGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleGamePhaseStepChanged(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
};

// 0x8 (0x2C0 - 0x2B8)
// Class FortniteUI.AthenaBroadcastGamePhaseWidget
class UAthenaBroadcastGamePhaseWidget : public UAthenaGamePhaseWidgetBase
{
public:
	class AFortMinigame*                         MinigameOverride;                                  // 0x2B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastGamePhaseWidget* GetDefaultObj();

	void SetMinigameOverride(class AFortMinigame* Minigame);
};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.FortUIStateWidgetBase
class UFortUIStateWidgetBase : public UCommonActivatableWidget
{
public:
	class UCommonActivatableWidgetStack*         WidgetStack_PrimaryContent;                        // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortUIStateWidgetBase* GetDefaultObj();

};

// 0xD8 (0x3B0 - 0x2D8)
// Class FortniteUI.AthenaHUDBase
class UAthenaHUDBase : public UFortUIStateWidgetBase
{
public:
	TArray<class UUserWidget*>                   MinigameWidgets;                                   // 0x2D8(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_9E[0x20];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UOverlay*                              ScalableOverlay;                                   // 0x308(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaMapPanel*                       MapPanel;                                          // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaHUDMenu*                        AthenaHUDMenu;                                     // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaPlayerTeamKillsBase*            AthenaTeamKillsWidget;                             // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSquadListBase*                  TeamInfo;                                          // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaPlayerHitPointInfo*             LocalPlayerHitPointInfo;                           // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaEquippedItemBase*               AthenaEquippedItemWidget;                          // 0x338(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSkydivingInformation*           SkydivingInfoWidget;                               // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAthenaVehicleFuelWidget*          VehicleFuelWidget;                                 // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaIndicatorLayerBase*             AthenaIndicatorLayer;                              // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>               KairosHUDLayerClass;                               // 0x358(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMutatorAddedWidgets>          MutatorAddedWidgets;                               // 0x360(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_A1[0x20];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FPlaylistUIExtension>          TournamentUIExtensions;                            // 0x390(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FPlaylistUIExtension>          ArenaTournamentUIExtensions;                       // 0x3A0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaHUDBase* GetDefaultObj();

	void UpdateUIExtensions(class AFortPlayerState* ClientState, class AFortMinigame* Minigame);
	void SetZoneCompleted(bool bValue);
	void SetQuickBarNative(bool bShouldDoQuickBarNative);
	void SetFullscreenMapVisibilityNative(bool bIsVisible);
	void PrepareToShowEndGameUI();
	void OnPlaylistExtensionWidgetCreated(enum class EPlaylistUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnMinigameHideHUD(bool bLoading);
	void OnHUDScaleChanged(float HUDScale);
	void OnDisplayGameOver();
	void HandleVolumeUnloaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeStateChanged(enum class EVolumeState NewState, class AFortVolume* Volume);
	void HandleVolumeLoaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleUpdateMinigameUIExtensions(class AFortMinigame* Minigame);
	void HandleOnMutatorRemoved(class AFortGameplayMutator* NewMutator);
	void HandleOnMutatorAdded(class AFortGameplayMutator* NewMutator);
	void HandleNewPanelFromMutator(TSubclassOf<class UUserWidget> PanelClass);
	void HandleExitVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleEnteredVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleCursorModeChanging(bool bCursorModeEnabled);
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CustomWidget);
	bool GetZoneCompleted();
	void ClearUIExtensions();
	void BindVolumeEvents();
};

// 0x170 (0x520 - 0x3B0)
// Class FortniteUI.AthenaBroadcastHUDBase
class UAthenaBroadcastHUDBase : public UAthenaHUDBase
{
public:
	struct FDataTableRowHandle                   ToggleMatchStatusActionRowHandle;                  // 0x3B0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleSquadStatusActionRowHandle;                  // 0x3C0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleRemainingPlayersActionRowHandle;             // 0x3D0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleActiveGridScreenActionRowHandle;             // 0x3E0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleEliminatedGridScreenActionRowHandle;         // 0x3F0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleMatchStatusScreenActionRowHandle;            // 0x400(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleScoreboardScreenActionRowHandle;             // 0x410(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleKillFeedActionRowHandle;                     // 0x420(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleActionFeedScreenActionRowHandle;             // 0x430(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleGotoTimeRowHandle;                           // 0x440(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   TogglePipModeActionRowHandle;                      // 0x450(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleFollowedPlayerInfoActionRowHandle;           // 0x460(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleFullscreenMapActionRowHandle;                // 0x470(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TMap<TSoftClassPtr<class UUserWidget>, struct FPlaylistUIExtension> ExtensionWidgetOverrides;                          // 0x480(0x50)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHUDControlsBase*       BroadcastHUDControls;                              // 0x4D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorNameplateLayerBase*    NameplateLayer;                                    // 0x4D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBroadcastMapPanelBase*          AthenaBroadcastMapPanel;                           // 0x4E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 EventMatchInfoSwitcher;                            // 0x4E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 Switcher_TopLeft;                                  // 0x4F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpacer*                               TopLeft_Empty;                                     // 0x4F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBroadcastViewSettings*            TopLeft_ViewSettings;                              // 0x500(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaReplayActionFeedScreenBase*     TopLeft_ActionFeed;                                // 0x508(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortReplayGoToTimeDialogue*           TopLeft_GoToTime;                                  // 0x510(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortReplayHighlightsWindow*           TopLeft_Highlights;                                // 0x518(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDBase* GetDefaultObj();

	void SetFullscreenMapVisibility(bool bIsVisible);
	void OnVolumeEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnVolumeBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnVolumeAdded(class AFortVolume* Volume);
	void OnUnableToPerformAction(const struct FGameplayTagContainer& FailedReason, class FText& FailureText);
	void OnToggleSquadStatusActionExecuted(bool* bPassThrough);
	void OnToggleScoreboardScreenActionExecuted(bool* bPassThrough);
	void OnToggleRemainingPlayersActionExecuted(bool* bPassThrough);
	void OnTogglePipModeActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusScreenActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusActionExecuted(bool* bPassThrough);
	void OnToggleKillFeedActionExecuted(bool* bPassThrough);
	void OnToggleFollowedPlayerInfoActionExecuted(bool* bPassThrough);
	void OnToggleEliminatedGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleActiveGridScreenActionExecuted(bool* bPassThrough);
	void OnPlaylistDataChanged(class UFortPlaylistAthena* PlaylistData);
	void OnPlayerTargetingChanged(bool bIsTargeting);
	void OnPipModeChanged(bool bEnabled);
	void OnMinigameChanged(class AFortMinigame* NewMinigame);
	void OnIndicatorModeChanged(bool bIndicatorsEnabled);
	void OnHudVisibilityChanged(enum class EHudVisibilityState NewVisibility);
	void OnGameStateSet_BP(class AFortGameStateAthena* GameStateAthena);
	void OnGameStateSet(class AFortGameState* NewGameState);
	void OnCurrentPlaylistChanged();
	void HandleToggleReplayViewSettings();
	void HandleToggleHighlightsList();
	void HandleToggleGoToTime();
	void HandleToggleActionFeedScreen();
	void HandleSpectatorViewTargetChanged();
	void HandleNameplatesEnabledChanged(bool bInNameplatesEnabled);
	void HandleHudVisibilityChanged(enum class EHudVisibilityState NewVisibility);
	void HandleFollowedPlayerRespawnTimeChanged(float RespawnTime);
};

// 0x38 (0x2D0 - 0x298)
// Class FortniteUI.FortActorIndicatorWidget
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_CC[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                IndicatedActor;                                    // 0x2A0(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                   IndicatedActorComponent;                           // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               RelativeLocation;                                  // 0x2B0(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxDistance;                                       // 0x2BC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bClampOnScreen;                                    // 0x2C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowClampToScreenArrow;                           // 0x2C1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseScreenSpacePosition;                           // 0x2C2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_CF[0x1];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             ScreenSpaceRelativeOffset;                         // 0x2C4(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ScreenPriority;                                    // 0x2CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortActorIndicatorWidget* GetDefaultObj();

	bool IsIndicatingActor(class AActor* OtherActor);
};

// 0x8 (0x2D8 - 0x2D0)
// Class FortniteUI.AthenaBroadcastHUDMenuStatusBase
class UAthenaBroadcastHUDMenuStatusBase : public UFortActorIndicatorWidget
{
public:
	float                                        ZOffset;                                           // 0x2D0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D2[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDMenuStatusBase* GetDefaultObj();

	void MapActivated();
	void InventoryActivated();
};

// 0x10 (0x2A8 - 0x298)
// Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase
class UAthenaBroadcastHUDMenuStatusLayerBase : public UFortHUDElementWidget
{
public:
	TSubclassOf<class UAthenaBroadcastHUDMenuStatusBase> HUDMenuStatusWidgetClass;                          // 0x298(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D6[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDMenuStatusLayerBase* GetDefaultObj();

	void RemoveHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
	void DeactivateHudMenuWidget();
	void AddHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
};

// 0x28 (0x2C0 - 0x298)
// Class FortniteUI.AthenaBroadcastKillFeedBase
class UAthenaBroadcastKillFeedBase : public UFortHUDElementWidget
{
public:
	class UFortDynamicEntryBox*                  KillFeedEntryBox;                                  // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeToShowEntry;                                   // 0x2A0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D8[0x1C];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastKillFeedBase* GetDefaultObj();

	void OnToggleShowKillFeed(bool bShowKillFeed);
	void OnTimelineScrubbed();
	void AddKillFeedEntry(struct FAthenaBroadcastKillFeedEntryInfo& KillFeedEntryInfo);
};

// 0xE8 (0x380 - 0x298)
// Class FortniteUI.AthenaBroadcastKillFeedItemBase
class UAthenaBroadcastKillFeedItemBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_D9[0x8];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UMaterialInterface>     EliminationIcon;                                   // 0x2A0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     StormIcon;                                         // 0x2C8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     FallDamageIcon;                                    // 0x2F0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     ExplosionIcon;                                     // 0x318(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     DbnoIcon;                                          // 0x340(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_InstigatorName;                               // 0x368(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_VictimName;                                   // 0x370(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_EntryIcon;                                   // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastKillFeedItemBase* GetDefaultObj();

};

// 0x40 (0x478 - 0x438)
// Class FortniteUI.AthenaBroadcastMapPanelBase
class UAthenaBroadcastMapPanelBase : public UFortActivatablePanel
{
public:
	class UAthenaSpectatorMapPlayerListBase*     PlayerList;                                        // 0x438(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaMapLayer*                       AthenaMapLayer;                                    // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 LhsSwitcher;                                       // 0x448(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_CycleSideBar;                               // 0x450(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CycleSideBarRowHandle;                             // 0x458(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBroadcasterMapSettings> MapSettingsClass;                                  // 0x468(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_DB[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastMapPanelBase* GetDefaultObj();

};

// 0x8 (0x2A0 - 0x298)
// Class FortniteUI.AthenaBroadcastMatchStatusWidget
class UAthenaBroadcastMatchStatusWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_DC[0x8];                                       // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastMatchStatusWidget* GetDefaultObj();

	void OnStormPhaseChanged(int32 StormPhase);
};

// 0x10 (0x2A8 - 0x298)
// Class FortniteUI.AthenaBroadcastPlayerEventScoreWidget
class UAthenaBroadcastPlayerEventScoreWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                      PlayerEventScoreText;                              // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                 PlayerEventScoreSwitcher;                          // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastPlayerEventScoreWidget* GetDefaultObj();

	void OnRemoteClientEventScoreChanged(int32 NewEventScore);
};

// 0x8 (0x2A0 - 0x298)
// Class FortniteUI.AthenaBroadcastPlayerLocationWidget
class UAthenaBroadcastPlayerLocationWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                      PlayerLocationText;                                // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastPlayerLocationWidget* GetDefaultObj();

	void OnRemoteClientPoiTagIDChanged(int16 RemoteClientPoiTagID);
};

// 0x8 (0x2A0 - 0x298)
// Class FortniteUI.AthenaBroadcastSessionId
class UAthenaBroadcastSessionId : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            Text_SessionId;                                    // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastSessionId* GetDefaultObj();

};

// 0x8 (0x2A0 - 0x298)
// Class FortniteUI.AthenaEventMatchSquadWidgetBase
class UAthenaEventMatchSquadWidgetBase : public UFortHUDElementWidget
{
public:
	TWeakObjectPtr<class UAthenaRemoteSquadViewData> SquadData;                                         // 0x298(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaEventMatchSquadWidgetBase* GetDefaultObj();

	void SetSquadIdVisible(bool bSquadIdVisible);
	void OnSquadPlaceChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadPlace);
	void OnSquadKillscoreChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadKills);
	void OnSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, uint8 InSquadId);
	void OnSquadColorChanged(class UAthenaRemoteSquadViewData* InSquadData, const struct FLinearColor& InSquadColor);
	void OnPlayerAdded(class UAthenaRemoteSquadViewData* InSquadData, class UAthenaRemotePlayerViewData* InPlayerData);
};

// 0x28 (0x2C8 - 0x2A0)
// Class FortniteUI.AthenaBroadcastSquadStatusWidget
class UAthenaBroadcastSquadStatusWidget : public UAthenaEventMatchSquadWidgetBase
{
public:
	struct FUniqueNetIdRepl                      FollowedPlayerUID;                                 // 0x2A0(0x28)(BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastSquadStatusWidget* GetDefaultObj();

	void OnPipModeChanged(bool bPipModeEnabled);
	void OnMinigameTeamIdChanged(class UFortMinigameTeamIdentification* MinigameTeamId);
	void OnFollowedPlayerChanged();
	void HandleSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, uint8 SquadId);
	void HandleFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorController, class AFortPlayerState* NewFollowedPlayer);
};

// 0x60 (0x468 - 0x408)
// Class FortniteUI.AthenaCareerScreen
class UAthenaCareerScreen : public UCommonActivatablePanel
{
public:
	TSubclassOf<class UAthenaStatsScreenBase>    ProfileScreenClass;                                // 0x408(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAthenaLeaderboardScreenBase> LeaderboardsScreenClass;                           // 0x410(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAthenaReplayBrowserScreenBase> ReplayBrowserScreenClass;                          // 0x418(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_AccountLevel;                                 // 0x420(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Leaderboards;                               // 0x428(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Replays;                                    // 0x430(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaFeatTimelineListView*           ListView_FeatTimeline;                             // 0x438(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChapterContext;                               // 0x440(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ProfileOld;                                 // 0x448(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_LeaderboardsOld;                            // 0x450(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ReplaysOld;                                 // 0x458(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_Buttons;                                     // 0x460(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCareerScreen* GetDefaultObj();

	void ShowFeats(bool bShowFeats, bool bHasCompletedFeats);
};

// 0xE8 (0x318 - 0x230)
// Class FortniteUI.AthenaChallengeCountdownDisplay
class UAthenaChallengeCountdownDisplay : public UUserWidget
{
public:
	uint8                                        Pad_EA[0x10];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             UnlockTime;                                        // 0x240(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ECountdownDisplay                 DisplayType;                                       // 0x248(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_EB[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerDisplayData                     DisplayData[0x3];                                  // 0x250(0xA8)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_EC[0x18];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_TimeRemaining;                                // 0x310(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeCountdownDisplay* GetDefaultObj();

	void OnChallengeSet(struct FTimerDisplayData& DisplayStyle);
};

// 0x10 (0x268 - 0x258)
// Class FortniteUI.AthenaChallengeDetailBase
class UAthenaChallengeDetailBase : public UCommonUserWidget
{
public:
	class UFortItemBaseWidget*                   ItemInfo_PreviewedItem;                            // 0x258(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SB_MainContent;                                    // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailBase* GetDefaultObj();

};

// 0xA0 (0x308 - 0x268)
// Class FortniteUI.AthenaChallengeDetailImageGrid
class UAthenaChallengeDetailImageGrid : public UAthenaChallengeDetailBase
{
public:
	uint8                                        Pad_ED[0x78];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UUniformGridPanel*                     Grid_Image;                                        // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>               EntryWidgetClass;                                  // 0x2E8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentFocusedSlot;                                // 0x2F0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_EE[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        QuestIds;                                          // 0x2F8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailImageGrid* GetDefaultObj();

	void OnOwnedToCompleteTransitions(int32 Count, float TimeOffset, float AdditionalTime);
	void OnLockedToOwnedTransitions(int32 Count, float TimeOffset, float AdditionalTime);
};

// 0x20 (0x288 - 0x268)
// Class FortniteUI.AthenaChallengeDetailList
class UAthenaChallengeDetailList : public UAthenaChallengeDetailBase
{
public:
	bool                                         bSkipItemDisplay;                                  // 0x268(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSuppressItemDisplay;                              // 0x269(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F0[0x16];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaChallengeSetListView*           ChallengeListView_SetContents;                     // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailList* GetDefaultObj();

};

// 0x38 (0x2A0 - 0x268)
// Class FortniteUI.AthenaChallengeDetailRewardTrack
class UAthenaChallengeDetailRewardTrack : public UAthenaChallengeDetailBase
{
public:
	uint8                                        Pad_F3[0x10];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumRewardsBeforeScrolling;                         // 0x278(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowWrapping;                                    // 0x27C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bScrollingRewards;                                 // 0x27D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_F4[0x2];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentBundleLevelBeingViewed;                     // 0x280(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentRewardBeingViewed;                          // 0x284(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 Switcher_RewardTrack;                              // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_RewardTrack_Small;                        // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_RewardTrack_Scroll;                       // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailRewardTrack* GetDefaultObj();

	void HandlePreviewItemChanged(int32 RewardIndexToView);
};

// 0x178 (0x1A8 - 0x30)
// Class FortniteUI.AthenaChallengeDisplayData
class UAthenaChallengeDisplayData : public UDataAsset
{
public:
	int32                                        SoonDisplayMinuteThreshold;                        // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          PartyAssistFontColor;                              // 0x34(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          DifficultChallengeFontColor;                       // 0x44(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F6[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            PartyAssistIcon;                                   // 0x58(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            ExternalPartyAssistIcon;                           // 0x60(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortChallengeSetStyle                DefaultChallengeStyle;                             // 0x68(0xA0)(Edit, NativeAccessSpecifierPublic)
	struct FFortChallengeSetStyle                DailyChallengeStyle;                               // 0x108(0xA0)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaChallengeDisplayData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaChallengeDisplayLibrary
class UAthenaChallengeDisplayLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeDisplayLibrary* GetDefaultObj();

	struct FLinearColor GetChallengeStyleLightAccentColor(struct FFortChallengeSetStyle& DisplayStyle);
	void ApplyChallengeSetStyleColorsToMaterial(struct FFortChallengeSetStyle& DisplayStyle, class UMaterialInstanceDynamic* StyleMaterial);
	void ApplyChallengeSetStyleColorsToImageMaterial(struct FFortChallengeSetStyle& DisplayStyle, class UImage* ImageWidget);
};

// 0x18 (0x40 - 0x28)
// Class FortniteUI.ImageGridObject
class UImageGridObject : public UObject
{
public:
	int32                                        GridLocation;                                      // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FA[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortChallengeBundleItemDefinition*    BundleData;                                        // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortQuestItem*                        QuestItem;                                         // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UImageGridObject* GetDefaultObj();

};

// 0x48 (0xBB8 - 0xB70)
// Class FortniteUI.AthenaChallengeImageGridEntry
class UAthenaChallengeImageGridEntry : public UCommonButton
{
public:
	uint8                                        Pad_FC[0x18];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonLazyImage*                      Image_Brush;                                       // 0xB88(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bSelected;                                         // 0xB90(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_FD[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GridLocation;                                      // 0xB94(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Column;                                            // 0xB98(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Row;                                               // 0xB9C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_FE[0x18];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeImageGridEntry* GetDefaultObj();

	void TransitionFromOwnedToCompletedState();
	void TransitionFromLockedToOwnedState();
	void SetupLockedToOwnState();
	void OnChallengeSet(bool bIsComplete, bool bIsLocked);
};

// 0x28 (0x280 - 0x258)
// Class FortniteUI.AthenaChallengeInfoPanelEntry
class UAthenaChallengeInfoPanelEntry : public UCommonUserWidget
{
public:
	uint8                                        Pad_100[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_AssistIcon;                                  // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_AssistTarget;                             // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ChallengeDesc;                            // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeInfoPanelEntry* GetDefaultObj();

	void OnLocalPlayerMissingAssistedChallenge();
	void OnChallengeInfoSet();
	void HandleQuestsUpdated();
};

// 0x58 (0x2B0 - 0x258)
// Class FortniteUI.AthenaChallengeInfoPanel
class UAthenaChallengeInfoPanel : public UCommonUserWidget
{
public:
	uint8                                        Pad_101[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EChallengeInfoPage                CurrentPage;                                       // 0x268(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_102[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   CyclePagesInputAction;                             // 0x270(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	int32                                        MaxSuggestedEntries;                               // 0x280(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_103[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UFortPartyMember>> PartyMembersWithAssistedChallenges;                // 0x288(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_104[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_DisplayedChallengeTypes;                      // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Challenges;                               // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeInfoPanel* GetDefaultObj();

	void HandleQuestsUpdatedInGame();
	void HandleCycleQuestsInputAction(bool* bPassThrough);
};

// 0x80 (0x2D8 - 0x258)
// Class FortniteUI.AthenaMissionInfoPanel
class UAthenaMissionInfoPanel : public UCommonUserWidget
{
public:
	TSubclassOf<class UAthenaChallengeInfoPanelEntry> FrontendChallengeInfoEntry;                        // 0x258(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxSuggestedEntries;                               // 0x260(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_106[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UFortPartyMember>> PartyMembersWithAssistedChallenges;                // 0x268(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_107[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  PrestigeShimmerParamName;                          // 0x280(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ContextColorParamName;                             // 0x288(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  MissionRewardParamName;                            // 0x290(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_DisplayedChallengeTypes;                      // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeTitle;                               // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeName;                                // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Challenges;                               // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ViewNextMission;                            // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplayEntry*    MissionReward;                                     // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_MissionIcon;                              // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                TimerImage;                                        // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMissionInfoPanel* GetDefaultObj();

	void SetMissionStyle(const struct FFortChallengeSetStyle& Style);
	void HandleCycleMissionClicked();
};

// 0x20 (0x278 - 0x258)
// Class FortniteUI.AthenaInGameChallengeInfoPanel
class UAthenaInGameChallengeInfoPanel : public UCommonUserWidget
{
public:
	int32                                        TotalMaxEntries;                                   // 0x258(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_108[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaChallengeInfoPanel*             ChallengeInfo_PartyAssist;                         // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeInfoPanel*             ChallengeInfo_Daily;                               // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeInfoPanel*             ChallengeInfo_Suggested;                           // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaInGameChallengeInfoPanel* GetDefaultObj();

};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.AthenaChallengeRewardDisplayEntry
class UAthenaChallengeRewardDisplayEntry : public UUserWidget
{
public:
	class UFortLazyImage*                        LazyImage_RewardIcon;                              // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonTextBlock*                      Text_RewardQuantity;                               // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardDisplayEntry* GetDefaultObj();

};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.AthenaChallengeRewardDisplay
class UAthenaChallengeRewardDisplay : public UUserWidget
{
public:
	class UDynamicEntryBox*                      EntryBox_Rewards;                                  // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_CompletionIcon;                              // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardDisplay* GetDefaultObj();

};

// 0x8 (0x260 - 0x258)
// Class FortniteUI.AthenaChallengeListEntryBase
class UAthenaChallengeListEntryBase : public UCommonUserWidget
{
public:
	uint8                                        Pad_109[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntryBase* GetDefaultObj();

	void StartHighlight();
	void EndHighlight();
};

// 0x20 (0x280 - 0x260)
// Class FortniteUI.AthenaChallengeTreeEntry_ChallengeSet
class UAthenaChallengeTreeEntry_ChallengeSet : public UAthenaChallengeListEntryBase
{
public:
	uint8                                        Pad_10B[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ChallengeSetName;                             // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeSetContext;                          // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeTreeEntry_ChallengeSet* GetDefaultObj();

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle);
};

// 0x28 (0x288 - 0x260)
// Class FortniteUI.AthenaChallengeListEntry_Challenge
class UAthenaChallengeListEntry_Challenge : public UAthenaChallengeListEntryBase
{
public:
	uint8                                        Pad_10F[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHideProgressBar;                                  // 0x270(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_110[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonRichTextBlock*                  RichText_ChallengeDesc;                            // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x280(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_Challenge* GetDefaultObj();

	void OnPartyAssistEnabledChanged(bool bIsPartyAssistEnabled);
	void OnChallengeInfoSet(bool bIsComplete, bool bIsLocked, bool bCompact, bool HideRewards);
	int32 GetChallengeWeight();
};

// 0x68 (0x2F0 - 0x288)
// Class FortniteUI.AthenaChallengeListEntry_DetailedChallenge
class UAthenaChallengeListEntry_DetailedChallenge : public UAthenaChallengeListEntry_Challenge
{
public:
	uint8                                        Pad_111[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasAnyOptionsAvailable;                           // 0x298(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsDisplayingChallengeActions;                     // 0x299(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_112[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   BackAction;                                        // 0x2A0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CloseChallengeOptionsAction;                       // 0x2B0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_ShowChallengeOptions;                    // 0x2C0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               SimpleButton_TopClickArea;                         // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplay*         Reward_QuestReward;                                // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_PartyAssist;                                // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ReplaceChallenge;                           // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ActionInfo;                               // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_DetailedChallenge* GetDefaultObj();

	void HandleUpperAreaClicked();
	void HandleCloseChallengeOptionsInputAction(bool* bPassThrough);
};

// 0x8 (0x268 - 0x260)
// Class FortniteUI.AthenaChallengeListEntry_Header
class UAthenaChallengeListEntry_Header : public UAthenaChallengeListEntryBase
{
public:
	class UCommonTextBlock*                      Text_SectionTitle;                                 // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_Header* GetDefaultObj();

	void OnSectionTypeSet(enum class EChallengeListSection SectionType);
};

// 0x18 (0x278 - 0x260)
// Class FortniteUI.AthenaChallengeListEntry_CompletionReward
class UAthenaChallengeListEntry_CompletionReward : public UAthenaChallengeListEntryBase
{
public:
	class UAthenaChallengeRewardDisplay*         Reward_CompletionReward;                           // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_CompletionReward* GetDefaultObj();

	void OnRewardInfoSet(bool bIsCompleted, struct FFortChallengeSetStyle& DisplayStyle);
};

// 0x48 (0x2A8 - 0x260)
// Class FortniteUI.AthenaChallengeListEntry_StoreOffer
class UAthenaChallengeListEntry_StoreOffer : public UAthenaChallengeListEntryBase
{
public:
	TSoftClassPtr<class UFortStoreFrontOfferDetailsWidgetBase> OfferDetailsWidgetClass;                           // 0x260(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortStoreFrontOfferInfo*              OfferInfo;                                         // 0x288(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               SimpleButton_ClickArea;                            // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        LazyImage_SpecialOffer;                            // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_StoreOffer* GetDefaultObj();

	void OnOfferSet();
	void HandleClicked();
};

// 0xE8 (0x300 - 0x218)
// Class FortniteUI.AthenaChallengeListViewBase
class UAthenaChallengeListViewBase : public UListViewBase
{
public:
	uint8                                        Pad_117[0xE0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EntrySpacing;                                      // 0x2F8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_118[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListViewBase* GetDefaultObj();

};

// 0x10 (0x240 - 0x230)
// Class FortniteUI.AthenaChallengeProgressBar
class UAthenaChallengeProgressBar : public UUserWidget
{
public:
	class UProgressBar*                          ProgressBar_StepsCompleted;                        // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Progress;                                 // 0x238(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeProgressBar* GetDefaultObj();

	void SetPercentValueForMaterialNumber(int32 PercentValue);
};

// 0x60 (0x2B8 - 0x258)
// Class FortniteUI.AthenaChallengeRecapEntry
class UAthenaChallengeRecapEntry : public UCommonUserWidget
{
public:
	uint8                                        Pad_11B[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_QuestObjective;                               // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CompletionCount;                              // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_Progression;                              // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeRecapEntry* GetDefaultObj();

	void UpdateProgressBar(float StartingPercent, float EndingPercent);
	void StartOutroAnim();
	void StartIntroAnim();
	void OutroFinished();
	void IntroFinished();
};

// 0x68 (0x2C0 - 0x258)
// Class FortniteUI.AthenaChallengeRewardTrackEntry
class UAthenaChallengeRewardTrackEntry : public UCommonUserWidget
{
public:
	class FName                                  MissionRewardParamName;                            // 0x258(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortItemDefinition>    RewardToRepresent;                                 // 0x260(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        BundleRewardIndex;                                 // 0x288(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_122[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_ConnectorLeft;                               // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ConnectorRight;                              // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplayEntry*    MissionReward;                                     // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_123[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardTrackEntry* GetDefaultObj();

	void StyleChange(bool bViewingPrestige);
	void SetToDefaultState();
	void SetLastNodeInTrack(bool bIsLast);
	void SetAsCurrentPreviewItem();
	void NextRewardToEarn(bool bNext);
	void CompletedNextNode(bool bAnimate);
	void CompletedCurrentNode(bool bAnimate, bool LastReward);
	void ClearPreviewSelection();
};

// 0x10 (0xB80 - 0xB70)
// Class FortniteUI.ChallengeScreenCategoryTab
class UChallengeScreenCategoryTab : public UCommonButton
{
public:
	class UCommonTextBlock*                      Text_TabName;                                      // 0xB70(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_126[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChallengeScreenCategoryTab* GetDefaultObj();

};

// 0xD8 (0x4E0 - 0x408)
// Class FortniteUI.AthenaChallengeScreen
class UAthenaChallengeScreen : public UCommonActivatablePanel
{
public:
	TSubclassOf<class UAthenaChallengeSetBaseDetails> DefaultDetailsWidgetClass;                         // 0x408(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FDetailClassEntry>             DetailWidgestClasses;                              // 0x410(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   NextCategoryInputAction;                           // 0x420(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PrevCategoryInputAction;                           // 0x430(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<class UAthenaChallengeSetBaseDetails*> CreatedDetailWidgets;                              // 0x440(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UAthenaChallengeSetBaseDetails*        ActiveDetailsWidget;                               // 0x450(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeScreenTileBase*        LastSelectedTile;                                  // 0x458(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12E[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButtonGroup*                    TabButtonGroup;                                    // 0x468(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12F[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDynamicEntryBox*                      EntryBox_SectionTabs;                              // 0x4A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_Sections;                                // 0x4A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_EventChallenges;                          // 0x4B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeScreenTile_Daily*      ChallengeTile_Dailies;                             // 0x4B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_WeeklyChallenges;                         // 0x4C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Row1_MissionChallenges;                   // 0x4C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Row2_MissionChallenges;                   // 0x4D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_StyleChallenges;                          // 0x4D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeScreen* GetDefaultObj();

	bool ShouldPlayHolidayVideo();
	void OnHandleReplayHolidayVideo();
	bool IsPartyAssistedChallengeSet();
	void HandleTabSelectionChanged(class UCommonButton* TabButton, int32 TabIdx);
	void HandleTabClicked(class UCommonButton* TabButton, int32 TabIdx);
};

// 0x128 (0x560 - 0x438)
// Class FortniteUI.FortActivatablePanelWithItemPreview
class UFortActivatablePanelWithItemPreview : public UFortActivatablePanel
{
public:
	uint8                                        Pad_141[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItemView*                         ItemViewObject;                                    // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedSupportsCameraControlInputAction;   // 0x448(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedZoomInputAction;                    // 0x458(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomOutInputAction;                        // 0x468(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomInInputAction;                         // 0x478(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewRotateInputAction;                         // 0x488(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_142[0x94];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         AllowItemRotation;                                 // 0x52C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         AllowItemZooming;                                  // 0x52D(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         AutomaticallyRegisterCameraView;                   // 0x52E(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         OverrideFixedCameras;                              // 0x52F(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                            ActionDataTable;                                   // 0x530(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      AnimationToHideItemInfo;                           // 0x538(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoShowDetails;                                  // 0x540(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bItemDetailsHidden;                                // 0x541(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_143[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HideItemInfoHeaderDurationSecs;                    // 0x544(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_144[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActivatablePanelWithItemPreview* GetDefaultObj();

	void ShowItemDetails();
	void OnVaultItemsViewed(TArray<class UFortItem*>& Items);
	void OnItemPreviewChanged(class AActor* NewPrefab, class UFortItem* NewItem);
	void OnCosmeticSpecialActionPressed_7(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_6(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_5(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_4(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_3(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_2(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_1(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_0(bool* bPassThrough);
	void HideItemDetails();
	class UWidget* GetWidgetForFramingViewedItem();
};

// 0x20 (0x580 - 0x560)
// Class FortniteUI.AthenaChallengeSetBaseDetails
class UAthenaChallengeSetBaseDetails : public UFortActivatablePanelWithItemPreview
{
public:
	uint8                                        Pad_145[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeSetBaseDetails* GetDefaultObj();

};

// 0x78 (0x5F8 - 0x580)
// Class FortniteUI.AthenaChallengeSetDetails
class UAthenaChallengeSetDetails : public UAthenaChallengeSetBaseDetails
{
public:
	uint8                                        Pad_148[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ChallengeContext;                             // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_ChallengeSetName;                             // 0x5A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaChallengeProgressBar*           ChallengeProgress_Completion;                      // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0x5B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSwipePanel*                       SwipePanel_ChangeSet;                              // 0x5C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                          VB_ChallengeExtensions;                            // 0x5C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaChallengeDetailBase*            ChallengeDetail_ListPanel;                         // 0x5D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SB_MainContent;                                    // 0x5D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemBaseWidget*                   ItemInfo_PreviewedItem;                            // 0x5E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_PreviousSet;                                // 0x5E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_NextSet;                                    // 0x5F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetDetails* GetDefaultObj();

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
};

// 0x70 (0x668 - 0x5F8)
// Class FortniteUI.AthenaChallengeSetDetails_Missions
class UAthenaChallengeSetDetails_Missions : public UAthenaChallengeSetDetails
{
public:
	int32                                        CurrentBundleItemLevel;                            // 0x5F8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PrestigeShimmerParamName;                          // 0x5FC(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ContextColorParamName;                             // 0x604(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   NextRewardInputAction;                             // 0x610(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PrevRewardInputAction;                             // 0x620(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	class UAthenaChallengeDetailRewardTrack*     ChallengeDetails_Rewards;                          // 0x630(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_LevelUpBundle;                              // 0x638(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_RewardUnlockTip;                              // 0x640(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              PrestiegeUpsell;                                   // 0x648(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_ProgressDisplay;                          // 0x650(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_MissionIcon;                              // 0x658(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_BundleState;                              // 0x660(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetDetails_Missions* GetDefaultObj();

	void VeiwingBundleLevelChanged();
	void UpdateLevelUpBundleButtonText();
	void OnBundlePrestiged();
	bool IsUrgentMission();
	bool IsGenericMission();
	bool IsCurrentlyViewPrestige();
	void HidePriestigeInfo(bool bHidePriestigeUpsell);
	TSoftObjectPtr<class UTexture2D> GetChaseRewardForBundleLevel(int32 BundleLevel);
	bool CanLevelBundle();
	bool BundleHasMultipleLevels();
};

// 0x80 (0x600 - 0x580)
// Class FortniteUI.AthenaChallengeSetImageGrid
class UAthenaChallengeSetImageGrid : public UAthenaChallengeSetBaseDetails
{
public:
	uint8                                        Pad_14E[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ChallengeContext;                             // 0x5B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeSetName;                             // 0x5B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_Completion;                      // 0x5C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0x5C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                       SwipePanel_ChangeSet;                              // 0x5D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeListEntry_CompletionReward* CompletionReward_Entry;                            // 0x5D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeSetListView*           ChallengeDetail_List;                              // 0x5E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeDetailImageGrid*       ChallengeDetail_ImageGrid;                         // 0x5E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_PreviousSet;                                // 0x5F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_NextSet;                                    // 0x5F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetImageGrid* GetDefaultObj();

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
	void ApplyNextSort();
};

// 0x58 (0x358 - 0x300)
// Class FortniteUI.AthenaChallengeSetListView
class UAthenaChallengeSetListView : public UAthenaChallengeListViewBase
{
public:
	struct FAthenaChallengeListVisualOptions     ListVisualOptions;                                 // 0x300(0xC)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bHideHeaders;                                      // 0x30C(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHideCompletionRewards;                            // 0x30D(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHideQuestRewards;                                 // 0x30E(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseCompactActionInfo;                             // 0x30F(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowFocus;                                       // 0x310(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_152[0x2F];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaChallengeListEntry_Header> SectionHeaderEntryClass;                           // 0x340(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaChallengeListEntry_CompletionReward> CompletionRewardEntryClass;                        // 0x348(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaChallengeListEntry_StoreOffer> SpecialOfferEntryClass;                            // 0x350(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetListView* GetDefaultObj();

};

// 0x18 (0xB88 - 0xB70)
// Class FortniteUI.AthenaChallengeScreenTileBase
class UAthenaChallengeScreenTileBase : public UCommonButton
{
public:
	class UCommonTextBlock*                      Text_ChallengeName;                                // 0xB70(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                        LazyImage_RewardPreview;                           // 0xB78(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_156[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeScreenTileBase* GetDefaultObj();

	void ResetToLocked();
	void OnContainsPartyAssistedChallengeChanged(bool bHasPartyAssistedChallenge);
	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete, bool bIsLocked);
};

// 0x8 (0x260 - 0x258)
// Class FortniteUI.AthenaMinimalChallengeInfoEntry
class UAthenaMinimalChallengeInfoEntry : public UCommonUserWidget
{
public:
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesComplete;              // 0x258(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMinimalChallengeInfoEntry* GetDefaultObj();

	void OnChallengeInfoSet(bool bIsInProgress);
};

// 0x10 (0xB98 - 0xB88)
// Class FortniteUI.AthenaChallengeScreenTile_Daily
class UAthenaChallengeScreenTile_Daily : public UAthenaChallengeScreenTileBase
{
public:
	class UImage*                                Image_PartyAssist;                                 // 0xB88(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_MinimalInfoDailies;                       // 0xB90(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeScreenTile_Daily* GetDefaultObj();

};

// 0x8 (0xB90 - 0xB88)
// Class FortniteUI.AthenaChallengeScreenTile_PunchCard
class UAthenaChallengeScreenTile_PunchCard : public UAthenaChallengeScreenTileBase
{
public:
	class UAthenaPunchCard*                      PunchCard;                                         // 0xB88(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeScreenTile_PunchCard* GetDefaultObj();

};

// 0x30 (0xBB8 - 0xB88)
// Class FortniteUI.AthenaChallengeSetTile
class UAthenaChallengeSetTile : public UAthenaChallengeScreenTileBase
{
public:
	uint8                                        Pad_15A[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaChallengeProgressBar*           ChallengeProgress_QuestsCompleted;                 // 0xB98(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_ChallengeContext;                             // 0xBA0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                        LazyImage_CustomBackground;                        // 0xBA8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                  RichText_UnavailableReason;                        // 0xBB0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile* GetDefaultObj();

};

// 0x8 (0xBC0 - 0xBB8)
// Class FortniteUI.AthenaChallengeSetTile_Event
class UAthenaChallengeSetTile_Event : public UAthenaChallengeSetTile
{
public:
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0xBB8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Event* GetDefaultObj();

};

// 0x0 (0xBB8 - 0xBB8)
// Class FortniteUI.AthenaChallengeSetTile_Weekly
class UAthenaChallengeSetTile_Weekly : public UAthenaChallengeSetTile
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Weekly* GetDefaultObj();

};

// 0x58 (0xC10 - 0xBB8)
// Class FortniteUI.AthenaChallengeSetTile_Mission
class UAthenaChallengeSetTile_Mission : public UAthenaChallengeSetTile
{
public:
	int32                                        BundleLevel;                                       // 0xBB8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        BundleLevelCompletionPercent;                      // 0xBBC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PrestigeShimmerParamName;                          // 0xBC0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ContextColorParamName;                             // 0xBC8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_15D[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_MissionCompleted;                            // 0xBD8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ChaseReward;                                 // 0xBE0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  Text_AvailableInTime;                              // 0xBE8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0xBF0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_LockReason;                               // 0xBF8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_MissionIcon;                              // 0xC00(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_Reward;                                   // 0xC08(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Mission* GetDefaultObj();

	bool IsUrgentMission();
	bool IsLockedByTime();
	bool IsGenericMission();
	TSoftObjectPtr<class UTexture2D> GetSoftTextureForChaseReward();
	bool CanLevelUpBundle();
};

// 0x0 (0xBB8 - 0xBB8)
// Class FortniteUI.AthenaChallengeSetTile_Style
class UAthenaChallengeSetTile_Style : public UAthenaChallengeSetTile
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Style* GetDefaultObj();

};

// 0x78 (0x378 - 0x300)
// Class FortniteUI.AthenaChallengeTreeView
class UAthenaChallengeTreeView : public UAthenaChallengeListViewBase
{
public:
	uint8                                        Pad_15F[0x70];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaChallengeTreeEntry_ChallengeSet> SetHeaderEntryClass;                               // 0x370(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeTreeView* GetDefaultObj();

	void HandleQuestsUpdated();
};

// 0x48 (0x2E0 - 0x298)
// Class FortniteUI.AthenaCommonPrioritizedWidget
class UAthenaCommonPrioritizedWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_161[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAutoManagePriorityByVisibility;                   // 0x2D8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x2D9(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_162[0x5];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCommonPrioritizedWidget* GetDefaultObj();

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
};

// 0x220 (0x4B8 - 0x298)
// Class FortniteUI.AthenaCompassBase
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*              CompassMaterial;                                   // 0x298(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_Compass;                                     // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           MarkerBrush;                                       // 0x2A8(0x88)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           HeadingIndicatorBrush;                             // 0x330(0x88)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           StormIndicatorBrush;                               // 0x3B8(0x88)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        MarkerVerticalOffset;                              // 0x440(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_165[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateFontInfo                        HeadingFont;                                       // 0x448(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_166[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCompassBase* GetDefaultObj();

};

// 0x1B0 (0x480 - 0x2D0)
// Class FortniteUI.AthenaMarkedActorIndicator
class UAthenaMarkedActorIndicator : public UFortActorIndicatorWidget
{
public:
	uint8                                        Pad_168[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortWorldMarkerData                  MarkerData;                                        // 0x2F0(0x108)(Protected, NativeAccessSpecifierProtected)
	struct FMarkedActorDisplayInfo               MarkerDisplay;                                     // 0x3F8(0x68)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortMarkerDetailsTable*               DetailsTable;                                      // 0x460(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FreshLargeItemShowTime;                            // 0x468(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        IndicatorDotSizeThreshold;                         // 0x46C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                       Switcher_IndicatorSize;                            // 0x470(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Distance;                                     // 0x478(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMarkedActorIndicator* GetDefaultObj();

};

// 0x0 (0x480 - 0x480)
// Class FortniteUI.AthenaContextTutorialIndicator
class UAthenaContextTutorialIndicator : public UAthenaMarkedActorIndicator
{
public:

	static class UClass* StaticClass();
	static class UAthenaContextTutorialIndicator* GetDefaultObj();

};

// 0x60 (0x2B8 - 0x258)
// Class FortniteUI.AthenaCosmeticUnlockingInfo
class UAthenaCosmeticUnlockingInfo : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                  RichText_StaticUnlockingText;                      // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_UnlockingText;                            // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UProgressBar*                          ProgressBar_StepsCompleted;                        // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ProgressCompletion;                       // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                EmphasisStyle;                                     // 0x278(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                ProgressCompletionNumericStyle;                    // 0x288(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticItemDefinition*         CosmeticItemDef;                                   // 0x298(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_170[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCosmeticUnlockingInfo* GetDefaultObj();

	void ShowUnlockingInfoForCosmeticVariant(class UAthenaCosmeticItemDefinition* InCosmeticItemDef, struct FGameplayTag& InVariantChannel, struct FGameplayTag& InVariant);
	void ShowUnlockingInfoForCosmetic(class UAthenaCosmeticItemDefinition* InCosmeticItemDef);
	void ShowUnlockingInfo(class UAthenaCosmeticItemDefinition* UnlockItem, class UFortItemDefinition* UnlockSource);
	void ShowSeasonUnlockingInfo(int32 SeasonNumber, int32 TierNumber);
	void RequestUpdateAnim();
	void RequestOutroAnim();
	void RequestIntroAnim();
	void OutroAnimFinished();
	void OnUnlockingInfoSet(bool bShowProgression);
	void HideUnlockingInfo();
};

// 0x48 (0x2E0 - 0x298)
// Class FortniteUI.AthenaCountdownWidgetBase
class UAthenaCountdownWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_174[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x2D8(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_175[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCountdownWidgetBase* GetDefaultObj();

	void OnDisplayWarningMessage(class FText& FirstLineText, class FText& SecondLineText);
	void OnCountdownUpdate(int32 TimeRemaining, class FText& CountdownUpdateText);
	void OnCountdownStarted(int32 TimeRemaining, class FText& CountdownIntroText);
	void OnCountdownFinished();
	void HandleGamePhaseStepChanged(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
	void HandleCountdownStarted(int32 TimeRemaining);
	void HandleCountdownFinished();
};

// 0x120 (0x148 - 0x28)
// Class FortniteUI.AthenaCreativeItemEntryObjectWrapper
class UAthenaCreativeItemEntryObjectWrapper : public UObject
{
public:
	struct FFortItemEntry                        ItemEntry;                                         // 0x28(0x120)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaCreativeItemEntryObjectWrapper* GetDefaultObj();

};

// 0x138 (0xCA8 - 0xB70)
// Class FortniteUI.AthenaCreativeItemTileButton
class UAthenaCreativeItemTileButton : public UCommonButton
{
public:
	uint8                                        Pad_177[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaCreativeItemTileView*           ParentView;                                        // 0xB78(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                   ItemDefinition;                                    // 0xB80(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortItemEntry                        ItemEntry;                                         // 0xB88(0x120)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCreativeItemTileButton* GetDefaultObj();

	void OnLoadedItem();
	void OnEntryClick(class UAthenaCreativeItemTileButton* Entry);
	class UAthenaCreativeItemEntryObjectWrapper* MakeFortItemEntryObjectWrapper(class UObject* Target, struct FFortItemEntry& InItemEntry);
	int32 GetItemTypeCount();
	bool CompareToItemEntry(struct FFortItemEntry& InItemEntry);
};

// 0x18 (0x3A0 - 0x388)
// Class FortniteUI.AthenaCreativeItemTileView
class UAthenaCreativeItemTileView : public UCommonTileView
{
public:
	class UFortOptionsTab*                       ParentTab;                                         // 0x388(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             CurrentlyFocusedItem;                              // 0x390(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_179[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCreativeItemTileView* GetDefaultObj();

};

// 0xD0 (0x328 - 0x258)
// Class FortniteUI.FortItemPickerBase
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	UMulticastInlineDelegateProperty_            OnSelectionChangedEvent;                           // 0x258(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSelectionCommittedEvent;                         // 0x268(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnItemClicked;                                     // 0x278(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnItemClickedDoubleClicked;                        // 0x288(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnItemHoveredEvent;                                // 0x298(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnItemUnhovered;                                   // 0x2A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortItemTileView*                     PickerTileView;                                    // 0x2B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UListView*                             ItemListViewWidget;                                // 0x2C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_180[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bConfirmSelectionIfAlreadySelectedAfterOneClick;   // 0x2D8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_181[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               NewlySelectedItem;                                 // 0x2E0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x2E8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_182[0x30];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItemPickerBase* GetDefaultObj();

	bool TryCommitSelectedItem();
	void SetSelectedItem(class UFortItem* ItemToSelect);
	bool SetSelectedIndex(int32 Index);
	void OnItemSelectionEvent__DelegateSignature(class UFortItem* SelectedItem);
	class UFortItem* GetSelectedItem();
	TScriptInterface<class IFortItemListViewInterface> GetListViewInterface();
	int32 GetIndexForItem(class UFortItem* Item);
	void ClearSelection();
	void CenterSelectedItemTileWidget();
	bool CanItemBeComitted(class UFortItem* ItemToCommit);
};

// 0xB0 (0x3D8 - 0x328)
// Class FortniteUI.AthenaCustomizationPicker
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	UMulticastInlineDelegateProperty_            OnCosmeticSelectionSaving;                         // 0x328(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnCosmeticSelectionSaved;                          // 0x338(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnShowSaveButton;                                  // 0x348(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnHideSaveButton;                                  // 0x358(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonButton>             FilterTabButtonType;                               // 0x368(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonButtonStyle>        FilterTabButtonStyle;                              // 0x370(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortAthenaItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray;                           // 0x378(0x10)(Edit, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortTabListWidgetBase*                FilterTabList;                                     // 0x388(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  CurrentFilterName;                                 // 0x390(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_18C[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x3A8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_18D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0x3AC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowUnownedItems;                                // 0x3B0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowCommits;                                     // 0x3B1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bOneItemPerSlot;                                   // 0x3B2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_18F[0x15];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             ItemListeningTo;                                   // 0x3C8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticAccountItem*            LocalCampaignHeroItem;                             // 0x3D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationPicker* GetDefaultObj();

	void SetFilter(class FName FilterName);
	void SearchText(class FText& Text);
	void RefreshView(bool CategoryChanging, bool FilterChanged, bool bSearchTextChanged);
	void OnUpdateSaveButtonVisuals__DelegateSignature();
	void OnSearchEnabled(bool bEnabled);
	void OnNoItemsAvailableInFilter(class FText& EmptyDisplayText);
	void OnItemsAvailableInFilter();
	void OnCosmeticChangeSaveEvent__DelegateSignature();
	void HandleSelectedItemHasChanged(bool ItemChanged, bool AmmoChanged, bool IngredientsChanged);
	void HandleFilterTabSelected(class FName TabNameID);
	void HandleFilterTabButtonCreated(class FName TabNameID, class UCommonButton* TabButton);
	void HandleDifferentFilterSetBP();
	class FText GetQualifiedFilterDisplayName(enum class EAthenaFilterDisplayType InTopFilterDisplaySetting);
	void EndCustomizationCategory();
	void BeginCustomizationCategory(enum class EAthenaCustomizationCategory Category, int32 SubslotToEdit, bool bInAllowUnownedItems, bool bInOneItemPerSlot);
};

// 0x38 (0xBA8 - 0xB70)
// Class FortniteUI.FortItemTileButton
class UFortItemTileButton : public UCommonButton
{
public:
	uint8                                        Pad_193[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0xB80(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>              Item;                                              // 0xB88(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemCardSize                 ItemCardSize;                                      // 0xB90(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsRewardCard;                                      // 0xB91(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_194[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0xB98(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortItemTileButton* GetDefaultObj();

	void OnTileSizeOverrideCheck(enum class EFortItemCardSize SizeIn, enum class EFortItemCardSize* SizeOut);
};

// 0x10 (0xBB8 - 0xBA8)
// Class FortniteUI.AthenaCustomizationPickerTileButton
class UAthenaCustomizationPickerTileButton : public UFortItemTileButton
{
public:
	uint8                                        Pad_196[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortBangWrapper_NUI*                  Bang;                                              // 0xBB0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationPickerTileButton* GetDefaultObj();

	void OnEquippedStateChanged(bool bEquipped, bool bOnDifferentSlot);
	void OnChangeOwnedState(bool bOwned);
};

// 0xB8 (0x4F0 - 0x438)
// Class FortniteUI.FortItemPreviewScreen
class UFortItemPreviewScreen : public UFortActivatablePanel
{
public:
	uint8                                        Pad_197[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   ItemViewUnifiedSupportsCameraControlInputAction;   // 0x448(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedZoomInputAction;                    // 0x458(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomOutInputAction;                        // 0x468(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomInInputAction;                         // 0x478(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewRotateInputAction;                         // 0x488(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         AllowItemRotation;                                 // 0x498(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         AllowItemZooming;                                  // 0x499(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_198[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          PreviewRotatorTag;                                 // 0x49C(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_199[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AItemPreviewVaultRotator*              PreviewRotator;                                    // 0x4A8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemView*                         ItemViewObject;                                    // 0x4B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowItemRotation;                                // 0x4B8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowItemZooming;                                 // 0x4B9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_19A[0x2E];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidget*                               Widget_CameraFrame;                                // 0x4E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortItemPreviewScreen* GetDefaultObj();

};

// 0x3D8 (0x8C8 - 0x4F0)
// Class FortniteUI.AthenaCustomizationScreen
class UAthenaCustomizationScreen : public UFortItemPreviewScreen
{
public:
	class FText                                  CategoryDisplayNames[0x14];                        // 0x4F0(0x1E0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                  ItemTypeDisplayNames[0x14];                        // 0x6D0(0x1E0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A5[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        LastProfileRev;                                    // 0x8C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationScreen* GetDefaultObj();

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32 SlotIndex, bool bCanShowEmpty);
	void ShiftItemsVariantOption(class UAthenaCosmeticAccountItem* Item, int32 VariantChannelIndex);
	void OnLoadoutChanged();
	class FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	class FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory);
};

// 0x458 (0x9B8 - 0x560)
// Class FortniteUI.AthenaCustomizationScreenBase
class UAthenaCustomizationScreenBase : public UFortActivatablePanelWithItemPreview
{
public:
	bool                                         bCustomizationSelectionBeingProcessed;             // 0x560(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1B2[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaCustomizationParams            CustomizationParams;                               // 0x568(0x48)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      FirstCustomizationCategory;                        // 0x5B0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1B3[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CategoryDisplayNames[0x14];                        // 0x5B8(0x1E0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                  ItemTypeDisplayNames[0x14];                        // 0x798(0x1E0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1B4[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        LastProfileRev;                                    // 0x988(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaItemSelectorScreenBase> ItemSelectorScreenClass;                           // 0x990(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaItemSelectorScreenBase*         ItemSelectorScreen;                                // 0x998(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1B6[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidgetAnimation*                      BoundAnim_Intro;                                   // 0x9A8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Outro;                                   // 0x9B0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationScreenBase* GetDefaultObj();

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32 SlotIndex, bool bCanShowEmpty);
	void ShiftItemsVariantOption(class UAthenaCosmeticAccountItem* Item, int32 VariantChannelIndex);
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed);
	void HandleLoadoutChanged();
	void HandleInventoryUpdated(TSet<class FString>& ItemChangeFlags, int64 ProfileRevision);
	class FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	class FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory);
};

// 0x40 (0xBB0 - 0xB70)
// Class FortniteUI.AthenaCustomizationSlotSelectorButton
class UAthenaCustomizationSlotSelectorButton : public UCommonButton
{
public:
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0xB70(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0xB74(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0xB78(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          RequiredSlotGameplayTag;                           // 0xB80(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C4[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             LocalCampaignHeroPartItem;                         // 0xBA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationSlotSelectorButton* GetDefaultObj();

	void SetCustomizationType(enum class EAthenaCustomizationCategory NewType, int32 InSubslotIndex, struct FGameplayTag& RequiredSlotTag);
	void OnCustomizationSlotActiveStateChanged(bool bInAttachableCosmeticAvailable, bool bInActive);
	bool IsSlotFilled();
	void HandleDifferentHeroLoadoutActivated(class UFortMcpProfileCampaign* Profile);
	void GetCustomizationSlotActiveState(bool* bOutAttachableCosmeticAvailable, bool* bOutActive);
	class UFortItem* GetCampaignHeroPartItem();
};

// 0x58 (0x2F0 - 0x298)
// Class FortniteUI.AthenaDiscoverabilityBase
class UAthenaDiscoverabilityBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_1C5[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x2E0(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C6[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortControllerComponent_MapDiscoverability* AssociatedComponent;                               // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaDiscoverabilityBase* GetDefaultObj();

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
	void CommonArrivalEvent(struct FGameplayTag& NewTag);
};

// 0x0 (0x2F0 - 0x2F0)
// Class FortniteUI.AthenaDiscoveredAreaOverlay
class UAthenaDiscoveredAreaOverlay : public UAthenaDiscoverabilityBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaDiscoveredAreaOverlay* GetDefaultObj();

	void OnNewDiscovery(class FText& LocalizedLocationName, bool bIsNamedLocation);
};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.AthenaEliminationOverlayBase
class UAthenaEliminationOverlayBase : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaEliminationOverlayBase* GetDefaultObj();

};

// 0x0 (0x258 - 0x258)
// Class FortniteUI.AthenaEndGamePlacementWidget
class UAthenaEndGamePlacementWidget : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaEndGamePlacementWidget* GetDefaultObj();

	void SetPlacement(int32 NewPlacement);
	void Activate();
};

// 0x1D0 (0x468 - 0x298)
// Class FortniteUI.BacchusHUDElement
class UBacchusHUDElement : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_1C9[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsInLayoutMode;                                   // 0x2A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1CA[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          VisualType;                                        // 0x2A4(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1CB[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  WidgetName;                                        // 0x2B0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bHideWhenNotUsingTouch;                            // 0x2C8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUpdatesWithHUDState;                              // 0x2C9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysShow;                                       // 0x2CA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBuildMode;                                     // 0x2CB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCombatMode;                                    // 0x2CC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInEditMode;                                      // 0x2CD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCreativeMode;                                  // 0x2CE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBattleLabMode;                                 // 0x2CF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsFreeFalling;                                     // 0x2D0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsGliding;                                         // 0x2D1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              CanOpenChute;                                      // 0x2D2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InLockedBus;                                       // 0x2D3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InUnlockedBus;                                     // 0x2D4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnTargeting;                                       // 0x2D5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnUsingScopeTargeting;                             // 0x2D6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanTarget;                                       // 0x2D7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseScopeTargeting;                            // 0x2D8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCrouching;                                       // 0x2D9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseSecondaryAbility;                          // 0x2DA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDBNO;                                            // 0x2DB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCarryingDBNO;                                    // 0x2DC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnControllingRCPawn;                               // 0x2DD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInVehicle;                                       // 0x2DE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDrivingVehicle;                                  // 0x2DF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnZiplining;                                       // 0x2E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1CE[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHUDLayoutDataEntry                   DefaultEntry;                                      // 0x2E8(0x180)(Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBacchusHUDElement* GetDefaultObj();

	void ShowHighlight(bool Show);
	void OnHUDStateUpdate(struct FFortHUDState& NewState);
	void HandleInputMethodChanged(enum class ECommonInputType CurrentInputType);
	struct FGameplayTag BP_GetMobileVisualType();
};

// 0x10 (0x478 - 0x468)
// Class FortniteUI.AthenaEquippedItemBase
class UAthenaEquippedItemBase : public UBacchusHUDElement
{
public:
	enum class EEquippedWeaponDisplay            CurrentMode;                                       // 0x468(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1DC[0xF];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEquippedItemBase* GetDefaultObj();

	void WeaponTypeChanged(enum class EEquippedWeaponDisplay Mode);
	void WeaponTargetingChanged(bool bIsTargeting);
	void WeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType);
	void WeaponReloadCancelled(class AFortWeapon* Weapon);
	void WeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown);
	void UtilityItemTypeChanged(class AFortWeapon* Weapon, class UFortWeaponItemDefinition* Item);
	void UtilityItemCountChanged(int32 Remaining);
	void ResourceTypeChanged(class UFortResourceItemDefinition* Item, int32 ResourceCount);
	void ResourceCountChanged(int32 ResourceCount);
	void OnWorldItemsChanged();
	void OnWeaponTargetingChanged(bool bIsTargeting);
	void OnWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType);
	void OnWeaponReloadCancelled();
	void OnWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown);
	void OnWeaponChanged(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnViewTargetChanged();
	void OnLocalAmmoChanged(int32 LocalCount, int32 LocalRemaining);
	void OnBuildingMaterialChanged();
	void HasAmmoChanged(bool bHasAmmo);
	void AmmoTypeChanged(class AFortWeaponRanged* RangedWeapon, class UFortWorldItemDefinition* Item);
	void AmmoChanged(int32 MagazineAmmoCount, int32 BackupAmmoCount, int32 TotalRemaining);
};

// 0x0 (0x438 - 0x438)
// Class FortniteUI.AthenaEventGamesBase
class UAthenaEventGamesBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventGamesBase* GetDefaultObj();

};

// 0x0 (0x438 - 0x438)
// Class FortniteUI.AthenaEventScreenBase
class UAthenaEventScreenBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventScreenBase* GetDefaultObj();

};

// 0x28 (0x460 - 0x438)
// Class FortniteUI.AthenaEventMatchActiveGridScreenBase
class UAthenaEventMatchActiveGridScreenBase : public UAthenaEventScreenBase
{
public:
	TSubclassOf<class UAthenaEventMatchTeamWidgetBase> TeamWidgetClass;                                   // 0x438(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaEventMatchTeamWidgetBase*> ActiveTeams;                                       // 0x440(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        MaxNumColumns;                                     // 0x450(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamCount;                                      // 0x454(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamSize;                                       // 0x458(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1DF[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchActiveGridScreenBase* GetDefaultObj();

	void OnTeamEliminated_BP();
	void OnTeamEliminated(int32 InSquadId);
	void OnTeamChanged_BP();
};

// 0x28 (0x460 - 0x438)
// Class FortniteUI.AthenaEventMatchEliminatedGridScreenBase
class UAthenaEventMatchEliminatedGridScreenBase : public UAthenaEventScreenBase
{
public:
	TSubclassOf<class UAthenaEventMatchTeamWidgetBase> TeamWidgetClass;                                   // 0x438(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAthenaEventMatchTeamWidgetBase*> EliminatedTeams;                                   // 0x440(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                        MaxNumColumns;                                     // 0x450(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamCount;                                      // 0x454(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxTeamSize;                                       // 0x458(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1E1[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchEliminatedGridScreenBase* GetDefaultObj();

	void OnTeamEliminated_BP();
	void OnPlayerEliminatedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsEliminated);
};

// 0x10 (0xB80 - 0xB70)
// Class FortniteUI.AthenaEventMatchPlayerWidgetBase
class UAthenaEventMatchPlayerWidgetBase : public UCommonButton
{
public:
	uint8                                        Pad_202[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UAthenaRemotePlayerViewData> PlayerData;                                        // 0xB78(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaEventMatchPlayerWidgetBase* GetDefaultObj();

	void SetPlayerData(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnTeamColorChanged(class UAthenaRemotePlayerViewData* InPlayerData, const struct FLinearColor& InTeamColor);
	void OnSquadIdChanged(class UAthenaRemotePlayerViewData* InPlayerData, uint8 InSquadId);
	void OnShieldHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax);
	void OnShieldDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax);
	void OnPlayerStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerStateAthena* InPlayerState);
	void OnPlayerPawnChanged(class UAthenaRemotePlayerViewData* InPlayerData, class AFortPlayerPawn* InPlayerPawn);
	void OnPlayerNameChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InPlayerName);
	void OnPlayerDataChanged(class UAthenaRemotePlayerViewData* InPlayerData);
	void OnPlaceChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InPlace);
	void OnMaterialCountChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InCount);
	void OnLocationChanged(class UAthenaRemotePlayerViewData* InPlayerData, const class FString& InLocation);
	void OnKillScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void OnIsReplayRelevancyPlayerChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsReplayRelevancyPlayer);
	void OnIsInRelevancyChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsInRelevancy);
	void OnIsFollowedPlayerChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsFollowedPlayer);
	void OnHealthHealed(class UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax);
	void OnHealthDamaged(class UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax);
	void OnDisconnectedChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDisconnected);
	void OnDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDead);
	void OnDBNOStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsDBNO);
	void OnBeingRevivedStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bIsBeingRevived);
};

// 0x0 (0xB80 - 0xB80)
// Class FortniteUI.AthenaEventMatchScoreboardPlayerWidgetBase
class UAthenaEventMatchScoreboardPlayerWidgetBase : public UAthenaEventMatchPlayerWidgetBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaEventMatchScoreboardPlayerWidgetBase* GetDefaultObj();

	void SetSquadIdVisible(bool InVisible);
};

// 0x58 (0x490 - 0x438)
// Class FortniteUI.AthenaEventMatchScoreboardScreenBase
class UAthenaEventMatchScoreboardScreenBase : public UAthenaEventScreenBase
{
public:
	struct FUIActionTag                          SortByElimsAction;                                 // 0x438(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_207[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FUIActionTag                          SortByPlaceAction;                                 // 0x444(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_208[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   SortByEliminationsActionRowHandle;                 // 0x450(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   SortByPlaceActionRowHandle;                        // 0x460(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<class UAthenaRemoteSquadViewData*>    SquadDataArray;                                    // 0x470(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_20A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonListView*                       ScoreboardListView;                                // 0x488(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaEventMatchScoreboardScreenBase* GetDefaultObj();

	void SetSquadIdsVisible_BP(bool bSquadIdsVisible);
	void HandleSquadKillScoreChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InKillScore);
	void HandleSquadEliminated(class UAthenaRemoteSquadViewData* InSquadData);
};

// 0x8 (0x2A8 - 0x2A0)
// Class FortniteUI.AthenaEventMatchScoreboardSquadWidget
class UAthenaEventMatchScoreboardSquadWidget : public UAthenaEventMatchSquadWidgetBase
{
public:
	uint8                                        Pad_20B[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchScoreboardSquadWidget* GetDefaultObj();

};

// 0x50 (0x488 - 0x438)
// Class FortniteUI.AthenaEventMatchStatusScreenBase
class UAthenaEventMatchStatusScreenBase : public UAthenaEventScreenBase
{
public:
	uint8                                        Pad_210[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchStatusScreenBase* GetDefaultObj();

	void UpdateTimeSinceLastKillText(class FText& TimeSinceLastKillText);
	void UpdateSupplyDropsLootedText(class FText& SupplyDropsLootedText);
	void UpdateShotsFiredText(class FText& ShotsFiredText);
	void UpdatePlayersRemainingText(class FText& PlayersRemainingText);
	void UpdatePiecesDestroyedText(class FText& PiecesDestroyedText);
	void UpdatePiecesBuiltText(class FText& PiecesBuiltText);
	void UpdateMostKillsText(class FText& MostKillsText);
	void UpdateMostKillsScore(class FText& MostKillsScore);
	void UpdateMatchTimeText(class FText& MatchTimeText);
	void UpdateLongestEliminationText(class FText& LongestEliminationText);
	void UpdateLongestEliminationScore(class FText& LongestEliminationScore);
	void UpdateGamePhaseTimeTitleText(class FText& GamePhaseTimeTitleText);
	void UpdateGamePhaseTimeText(class FText& GamePhaseTimeText);
	void UpdateGamePhaseText(class FText& GamePhaseText);
	void UpdateFastestKillText(class FText& FastestKillText, class FText& FastestKillTime);
	void UpdateDamageTakenText(class FText& DamageTakenText);
	void UpdateDamageInflictedText(class FText& DamageInflictedText);
	void UpdateDamageHealedText(class FText& DamageHealedText);
	void UpdateCircleRadiusText(class FText& CircleRadiusText);
	void UpdateChestsLootedText(class FText& ChestsLootedText);
	void OnPlayerKillScoreChanged(class UAthenaRemotePlayerViewData* InPlayerData, int32 InKillScore);
	void OnPlayerDeadStateChanged_BP(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead);
	void OnPlayerDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead);
};

// 0x60 (0x2B8 - 0x258)
// Class FortniteUI.AthenaEventMatchTeamWidgetBase
class UAthenaEventMatchTeamWidgetBase : public UCommonUserWidget
{
public:
	TArray<class UAthenaEventMatchPlayerWidgetBase*> PlayerWidgets;                                     // 0x258(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        SquadId;                                           // 0x268(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_216[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          TeamColor;                                         // 0x26C(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxTeamSize;                                       // 0x27C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAthenaEventMatchPlayerWidgetBase> PlayerWidgetClass;                                 // 0x280(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_217[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UAthenaRemotePlayerViewData>> PlayerDatas;                                       // 0x2A0(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_218[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventMatchTeamWidgetBase* GetDefaultObj();

	void OnPlayerWidgetAdded();
	void OnPlayerDisconnectedChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDisconnected);
	void OnPlayerDeadStateChanged(class UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead);
	bool IsTeamDead();
	int32 GetTeamKills();
};

// 0x50 (0x2A8 - 0x258)
// Class FortniteUI.AthenaFeatTimelineListEntry
class UAthenaFeatTimelineListEntry : public UCommonUserWidget
{
public:
	uint8                                        Pad_21C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UPanelWidget*                          Panel_FeatInfo;                                    // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_Date;                                        // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_FeatName;                                     // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_FeatDescription;                              // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        LazyImage_QuestIcon;                               // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CompletedTime;                                // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Date;                                     // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_220[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaFeatTimelineListEntry* GetDefaultObj();

	void OnWaitingForCompletedTimer();
	void OnTimespanInfoSet(int32 NumDays);
	void OnFeatInfoSet(int32 NumFeatsOnDay, int32 IdxOnDay);
	void OnFeatCompletedThisSession();
};

// 0x108 (0x320 - 0x218)
// Class FortniteUI.AthenaFeatTimelineListView
class UAthenaFeatTimelineListView : public UListViewBase
{
public:
	uint8                                        Pad_221[0xC0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EntrySpacing;                                      // 0x2D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        EndSpacing;                                        // 0x2DC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DelayBeforeStartCompleted;                         // 0x2E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DelayBetweenCompletedItems;                        // 0x2E4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_222[0x38];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaFeatTimelineListView* GetDefaultObj();

};

// 0x20 (0x278 - 0x258)
// Class FortniteUI.AthenaFPSBase
class UAthenaFPSBase : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      FPS;                                               // 0x258(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_223[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaFPSBase* GetDefaultObj();

	void HandleShowFPSChanged(bool bInShowFPS);
};

// 0x28 (0x280 - 0x258)
// Class FortniteUI.AthenaGadgetFuelWidget
class UAthenaGadgetFuelWidget : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class UAthenaGadgetItemDefinition> AthenaGadgetItemDefinition;                        // 0x258(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EFortFuelGadgetVisualType         FortFuelGadgetVisualType;                          // 0x260(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_226[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                FuelGaugeProgressImage;                            // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonNumericTextBlock*               CurrentChargesText;                                // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_227[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGadgetFuelWidget* GetDefaultObj();

	void SetItem(class UFortWorldItem* Item);
};

// 0xC0 (0x318 - 0x258)
// Class FortniteUI.AthenaGameFeatureStatus
class UAthenaGameFeatureStatus : public UCommonUserWidget
{
public:
	class FText                                  ProgressStatusToastTitle;                          // 0x258(0x18)(Edit, NativeAccessSpecifierPrivate)
	enum class EFortGameFeature                  GameFeature;                                       // 0x270(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bExtendedDisplay;                                  // 0x271(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_22E[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ExtendedDisplayText;                               // 0x278(0x18)(Edit, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                DownloadingIconAsset;                              // 0x290(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                InitialToastNotificationIcon;                      // 0x2B8(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  DownloadingIconMaterialParam;                      // 0x2E0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        Image_DownloadingIcon;                             // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonNumericTextBlock*               Text_ProgressPercent;                              // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ExtendedDisplayText;                          // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_22F[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGameFeatureStatus* GetDefaultObj();

	void OnStatusChanged(enum class EAthenaGameFeatureStatus NewStatus);
};

// 0x0 (0x438 - 0x438)
// Class FortniteUI.AthenaGameOverDisplay
class UAthenaGameOverDisplay : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaGameOverDisplay* GetDefaultObj();

};

// 0x20 (0x2B8 - 0x298)
// Class FortniteUI.AthenaGenericHUDTimerWidgetBase
class UAthenaGenericHUDTimerWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_230[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTextBlock*                            TimeText;                                          // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_231[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGenericHUDTimerWidgetBase* GetDefaultObj();

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x80 (0x4B8 - 0x438)
// Class FortniteUI.AthenaGiftReceivedPrompt
class UAthenaGiftReceivedPrompt : public UFortActivatablePanel
{
public:
	uint8                                        Pad_233[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortItemPresentationScreen> ItemPresentationScreenClass;                       // 0x450(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>     GiftMaterial;                                      // 0x458(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortGiftBoxItem*                      GiftBoxItem;                                       // 0x480(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemReceivedHeaderBase*           Widget_HeaderInfo;                                 // 0x488(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Open;                                       // 0x490(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                      Image_GiftBox;                                     // 0x498(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_234[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGiftReceivedPrompt* GetDefaultObj();

	void OnGiftInfoPopulated();
	void OnCloseButtonClicked();
	void HandleMessageTextFiltered(bool bSuccess, const class FString& SanitizedMessage);
	void HandleGiftingComplete();
	void DismissPrompt();
};

// 0x18 (0x450 - 0x438)
// Class FortniteUI.FortMessageReceivedScreen
class UFortMessageReceivedScreen : public UFortActivatablePanel
{
public:
	UMulticastInlineDelegateProperty_            OnMessageClosed;                                   // 0x438(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UFortGiftBoxItem*                      GiftBoxItem;                                       // 0x448(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFortMessageReceivedScreen* GetDefaultObj();

};

// 0x28 (0x478 - 0x450)
// Class FortniteUI.AthenaGrantChallengeModal
class UAthenaGrantChallengeModal : public UFortMessageReceivedScreen
{
public:
	TArray<class UFortChallengeBundleItemDefinition*> BundleDefs;                                        // 0x450(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_ChallengeName;                                // 0x460(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_ChallengeContext;                             // 0x468(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_BodyCopy;                                     // 0x470(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaGrantChallengeModal* GetDefaultObj();

	void ShowNextChallengePopup();
	void OnChallengeBundleSet(struct FFortChallengeSetStyle& DisplayStyle);
};

// 0x228 (0x258 - 0x30)
// Class FortniteUI.AthenaHUDContext
class UAthenaHUDContext : public UBlueprintContextBase
{
public:
	uint8                                        Pad_26A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastInlineDelegateProperty_            OnLocalPlayerWon;                                  // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalPlayerDeathOnWin;                           // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalTeamWon;                                    // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalTeamLost;                                   // 0x68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalPlayerLost;                                 // 0x78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalPlayerKilledPlayer;                         // 0x88(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalPlayerDBNOStateChanged;                     // 0x98(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnUIGameplayCue;                                   // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLocalPlayerBeginSkydiving;                       // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnAthenaAutoFireChanged;                           // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnClientSettingsShowViewersChanged;                // 0xD8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnAthenaGamePhaseChanged;                          // 0xE8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPlayerFiredWeapon;                               // 0xF8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnLowPerformanceMode;                              // 0x108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPTTStateChange;                                  // 0x118(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnCanPTTChange;                                    // 0x128(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            ShowMobilePickerDelegate;                          // 0x138(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPlayerNameChangeDelegate;                        // 0x148(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnResurrectingNowDelegate;                         // 0x158(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnAllWinnersAnnouncedDelegate;                     // 0x168(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSignalQualityChangeDelegate;                     // 0x178(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnForwardStartedFalling;                           // 0x188(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnSpecialActorListChanged;                         // 0x198(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_26B[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastInlineDelegateProperty_            OnFireStopped;                                     // 0x1C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnPostGameWidgetPlacementChange;                   // 0x1D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnForceStartPostGameFlow;                          // 0x1E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UWidget>                MoveButtonWidgetPtr;                               // 0x1F0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAthenaWinnerInfo                     WinnerInfo;                                        // 0x1F8(0x20)(NativeAccessSpecifierPrivate)
	bool                                         bMoveButtonMode;                                   // 0x218(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bPendingAttachToHUD;                               // 0x219(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bLocalPlayerWonMatch;                              // 0x21A(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_26C[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerPawnAthena*                 BoundPlayerPawn;                                   // 0x220(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaPlayerViewModel*                PlayerViewModel;                                   // 0x228(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_26D[0x28];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaHUDContext* GetDefaultObj();

	float VictoryStingerTimeUntilFadeOut();
	bool UseTapToShoot();
	void UseOrRleoadFromHUDStop();
	void UseOrRleoadFromHUDStart();
	void UpdateSelectedWidgetMoveOffsetVector(struct FVector2D& VectorOffset, float FMoveScale);
	void TakeMovementInputFromHUD(const struct FVector2D& MoveVector);
	void TakeLookStickInputFromHUD(const struct FVector2D& LookStickPosition);
	void TakeLookInputFromHUD(const struct FRotator& LookRotator);
	void TakeItemSelectionInputFromHUD(int32 TouchIndex, int32 SlotIdx, bool* bIsUsing, enum class EFortQuickBars InQuickBar, bool bReloadOrUseIfAlreadySelected, bool bStopUseImmediately);
	void SwapQuickBarFocusFromHUD(enum class EFortQuickBars InQuickBar, int32 SlotOverride);
	void StopTargettingFromHUD();
	void StopItemSelectionInputFromHUD(int32 TouchIndex, int32 SlotIdx, enum class EFortQuickBars InQuickBar);
	void ShowMobilePicker__DelegateSignature();
	void ShowMobilePicker();
	void ShowMarkerGameModeMessage(int32 PlayerID, int32 InstanceID);
	void ShowGameModeMessage();
	bool ShouldVictoryUIPushEmoteInput();
	bool ShouldPlayCustomEndScreenAtLoss();
	bool ShouldDisplayScoreUI();
	bool ShouldDisplayPlacement();
	void SetTargetingToggleable(bool bNewValue);
	void SetSelectWidgetToMoveMode(bool bSet);
	void SetSelectedInventoryItem(class UFortItem* Item);
	void SetResourceMaterial(enum class EFortResourceType NewMaterial);
	void SetPTTState(enum class EPTTState NewPushToTalkState);
	void SetPostGameWidgetPlacement(class FName WidgetPlacement);
	void SetLockOnStickCoords(struct FVector2D& LockOnCoords);
	void SetLocalPlayerWonMatch(bool bLocalPlayerWon);
	void SelectWidgetToMove(class UWidget* Widget);
	void ReloadFromHUD();
	void PushGameOverEmoteInput();
	void PTTStateChange__DelegateSignature(enum class EPTTState NewPushToTalkState);
	bool OwnerOrWeaponHasTag(const struct FGameplayTag& InTag);
	void OnSpecialActorListChanged__DelegateSignature();
	void OnSignalQualityChange__DelegateSignature(float NewQuality);
	void OnResurrectingNow__DelegateSignature(bool bResurrectingNow);
	void OnReadyForWinnerInfoDisplay();
	void OnPostGameWidgetPlacement__DelegateSignature(class FName WidgetPlacement);
	void OnPlayerNameChange__DelegateSignature(const class FString& NewName);
	void OnPlayerFiredWeapon__DelegateSignature();
	void OnLowPerformanceMode__DelegateSignature(bool bInLowPerformanceMode);
	void OnLocalTeamWon__DelegateSignature();
	void OnLocalTeamLost__DelegateSignature();
	void OnLocalPlayerWon__DelegateSignature();
	void OnLocalPlayerLost__DelegateSignature(enum class EEndOfMatchReason LostReason);
	void OnLocalPlayerKilledPlayer__DelegateSignature(class AFortPlayerStateAthena* Player);
	void OnLocalPlayerDeathOnWin__DelegateSignature();
	void OnLocalPlayerDBNOStateChanged__DelegateSignature(bool bIsDBNO);
	void OnLocalPlayerBeginSkydiving__DelegateSignature();
	void OnForwardStartedFalling__DelegateSignature();
	void OnForceStartPostGameFlow__DelegateSignature();
	void OnFireStopped__DelegateSignature(int32 StopFireIndex);
	void OnClientSettingUpdatedShowViewers();
	void OnCanPTTChange__DelegateSignature();
	void OnAthenaSettingsApplied__DelegateSignature();
	void OnAthenaHUDAllWinnersAnnounced__DelegateSignature(struct FAthenaWinnerInfo& WinnerInfo);
	void OnAthenaGamePhaseChanged__DelegateSignature(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep NewPhase);
	void OnAthenaAutoFireChanged__DelegateSignature(bool bEntering);
	void OnAllWinnersAnnounced();
	void JumpFromHudStart(int32 TouchIndex);
	void JumpFromHudEnd();
	bool IsVictoryUICinematic();
	bool IsUsingScope();
	bool IsTargeting();
	bool IsShowViewerCountEnabled();
	bool IsRunningOnBattery();
	bool IsOperatingTurret();
	bool IsMovingSelectedWidget();
	bool IsInSelectWidgetToMoveMode();
	bool IsInBuildMode();
	bool IsFiringFromTouch(int32 TouchIndex);
	bool IsCurrentWeaponFiring();
	bool IsCurrentWeaponChargeable();
	bool IsCrouching();
	bool IsAutoRunEnabled();
	bool IsActionBound(class FName ActionName);
	void HideGameModeMessage();
	bool HasWifi();
	bool HasLockOnTarget();
	bool HasFiringTouch();
	bool HasAutofireTarget();
	void HandleUIGameplayCue(class FName CueName, enum class EGameplayCueEvent EventType, struct FGameplayCueParameters& Parameters);
	void HandleSpectatorViewTargetChanged();
	void HandleLocalPlayerDBNOStateChanged(class AFortPawn* FortPawn, bool bIsDBNO);
	void HandleLocalPlayerBeginSkydiving();
	void HandleGamePhaseChange(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void GetWinnerText(class FText* ReturnText, class FText& WinnerName);
	class FText GetVictoryText();
	class USoundCue* GetVictoryStinger();
	int32 GetSquadConnectedCount();
	enum class EPTTState GetPTTState();
	class FString GetPlayerName();
	struct FLinearColor GetPlayerColor();
	void GetLocalTime(int32* Hours, int32* Minutes);
	bool GetLocalPlayerWonMatch();
	int32 GetJumpPressedTouchIndex();
	int32 GetInteractPressedTouchIndex();
	bool GetInLowPerformanceMode();
	class FText GetGliderDisplayName();
	enum class EAthenaGamePhase GetGamePhase();
	float GetGameOverDelayTime();
	TSubclassOf<class UUserWidget> GetCustomDBNOWidgetClass();
	class UMaterialInterface* GetCustomDBNOReviveMaterial();
	bool GetCanPTT();
	TArray<class FName> GetBoundActions();
	float GetBatteryLevel();
	void ForwardOnSpecialActorListChanged(struct FSpecialActorRepData& SpecialActorData);
	void ForceVictoryRoyaleUI();
	void ForceStartPostGameFlow();
	void ForceFireFromHUDStop();
	void FireFromHUDStop(int32 TouchIndex, class UWidget* DebugWidget);
	void FireFromHUDStart(int32 TouchIndex, class UWidget* DebugWidget);
	void ExecuteActionNameFromHUDWithEventType(class FName ActionName, enum class EInputEvent KeyEvent);
	void ExecuteActionNameFromHUD(class FName ActionName);
	void EndUseFromHUD();
	void EnableAutoRunFromHUD(bool bEnable);
	float DisplayPlayerWonTime();
	void CycleQuickbar();
	bool CanShootInVehicle();
	bool CanCurrentWeaponAutoFireFromReticle();
	bool CanAutoRun();
	void BeginUseFromHUD();
};

// 0x50 (0x2E8 - 0x298)
// Class FortniteUI.AthenaHUDGamePhaseChangingBase
class UAthenaHUDGamePhaseChangingBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_276[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x2D8(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_277[0xE];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaHUDGamePhaseChangingBase* GetDefaultObj();

	void UpdateMessaging(enum class EAthenaGamePhaseStep Step, class FText& Message, class FText& TimeText);
	void HandleGamePhaseStepChanged(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void GamePhaseStepChanged(enum class EAthenaGamePhaseStep Step);
};

// 0x0 (0x258 - 0x258)
// Class FortniteUI.AthenaHUDInputWidget
class UAthenaHUDInputWidget : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaHUDInputWidget* GetDefaultObj();

};

// 0x18 (0x270 - 0x258)
// Class FortniteUI.AthenaHUDMenu
class UAthenaHUDMenu : public UCommonUserWidget
{
public:
	class UFortDualBladeMenu*                    DualBladeMenu;                                     // 0x258(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonUserWidget*                     BottomBar;                                         // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActivatableWidgetStack*         WidgetStack_PrimaryContent;                        // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaHUDMenu* GetDefaultObj();

	void ToggleBladeMenus();
	void StartPostGame();
	void RecoverFromPostGame();
	void OnWidgetStackCleared();
	void NativeHandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void FocusPlayerSwitcher();
	void DismissBladeMenus();
};

// 0x20 (0x2B8 - 0x298)
// Class FortniteUI.AthenaHUDPlayerActionAlertBase
class UAthenaHUDPlayerActionAlertBase : public UFortHUDElementWidget
{
public:
	TWeakObjectPtr<class AFortPlayerPawnAthena>  CurrentPlayerPawn;                                 // 0x298(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_28D[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaHUDPlayerActionAlertBase* GetDefaultObj();

	void RequestNextAlert();
	void ClearAlert();
	void AlertPlayer(enum class EAthenaPlayerActionAlert Alert, class FText& DetailText);
};

// 0x28 (0x280 - 0x258)
// Class FortniteUI.AthenaIGMPartyMemberWidget
class UAthenaIGMPartyMemberWidget : public UCommonUserWidget
{
public:
	bool                                         bIsLocalPlayerSlot;                                // 0x258(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsInGameSlot;                                     // 0x259(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_296[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortSocialAvatarIcon*                 AvatarIconWidget;                                  // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialNameTextBlock*                  Text_SocialName;                                   // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortVoiceChatStatusIcon*              VoiceIcon_Status;                                  // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortPartyMember*                      CachedPartyMember;                                 // 0x278(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaIGMPartyMemberWidget* GetDefaultObj();

	void OnWidgetReset();
	void OnUserSet();
	void OnNewReadiness(enum class EGameReadiness GameReadiness);
	void OnNewLocation(enum class EFortPartyMemberLocation NewLocation);
	void OnIsPartyLeaderChanged(bool bIsPartyLeader);
	bool IsPlayingFortnite();
	bool IsEmptySlot();
	bool GetIsLocalPlayerSlot();
	bool GetIsInGameSlot();
};

// 0x50 (0x2E8 - 0x298)
// Class FortniteUI.AthenaIndicatorLayerBase
class UAthenaIndicatorLayerBase : public UFortHUDElementWidget
{
public:
	class UFortActorCanvas*                      GeneralIndicators;                                 // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActorCanvas*                      NameIndicators;                                    // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UAthenaPlayerIndicatorBase*>    PlayerIndicators;                                  // 0x2A8(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaPlayerIndicatorBase> PlayerIndicatorClass;                              // 0x2B8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x2C0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USlateVectorArtData*                   TeamIndicatorMesh;                                 // 0x2C8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bWasTargeting;                                     // 0x2D0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_29C[0x17];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaIndicatorLayerBase* GetDefaultObj();

	void OnTargetingChanged(bool bTargeting);
};

// 0x48 (0x78 - 0x30)
// Class FortniteUI.AthenaInventoryContext
class UAthenaInventoryContext : public UBlueprintContextBase
{
public:
	UMulticastInlineDelegateProperty_            OnInventoryItemSelected;                           // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnInventorySwapStarted;                            // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_            OnInventorySwapComplete;                           // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UFortItem>              LastSelectedInventoryItem;                         // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2B0[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaInventoryContext* GetDefaultObj();

	void StartOrFinishSwap(int32 SlotIndex);
	void SetSelectedInventoryItem(class UFortItem* Item);
	void OnAthenaInventorySwapStarted__DelegateSignature(int32 SlotIndex);
	void OnAthenaInventorySwapComplete__DelegateSignature();
	void OnAthenaInventoryItemSelected__DelegateSignature(class UFortItem* Item);
	bool IsSwapping();
	class UFortItem* GetSelectedInventoryItem();
	void CancelSwap();
};

// 0x28 (0xB98 - 0xB70)
// Class FortniteUI.AthenaInventoryEquipButtonBase
class UAthenaInventoryEquipButtonBase : public UCommonButton
{
public:
	class UFortMultiSizeItemCard*                ItemWidget;                                        // 0xB70(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               EmptyImage;                                        // 0xB78(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SlotIndex;                                         // 0xB80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2B1[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector2D>                     ButtonSizeBySlotUsage;                             // 0xB88(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaInventoryEquipButtonBase* GetDefaultObj();

};

// 0x0 (0xBA8 - 0xBA8)
// Class FortniteUI.AthenaInventoryFortItemTileButtonBase
class UAthenaInventoryFortItemTileButtonBase : public UFortItemTileButton
{
public:

	static class UClass* StaticClass();
	static class UAthenaInventoryFortItemTileButtonBase* GetDefaultObj();

};

// 0x108 (0x540 - 0x438)
// Class FortniteUI.AthenaInventoryPanelBase
class UAthenaInventoryPanelBase : public UFortActivatablePanel
{
public:
	class UFortItemTileView*                     ResourceView;                                      // 0x438(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemTileView*                     AmmoView;                                          // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaQuickbarEditorBase*             QuickbarEditor;                                    // 0x448(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2B8[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortItemTileView*>             InventorySections;                                 // 0x468(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2B9[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UFortCreativeSettingsFlow> MyIslandWidgetClass;                               // 0x488(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortCreativeItemListMenu> CreativeInventoryWidgetClass;                      // 0x4B0(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCommonButton>             TabButtonClass;                                    // 0x4D8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortCreativeItemListPanelData> ItemListPanelDataClass;                            // 0x4E0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScaleBox*                             ScaleBox_Leto;                                     // 0x4E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTabListWidgetBase*                TabList_Inventory;                                 // 0x4F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidgetSwitcher*      Switcher_InventoryTabs;                            // 0x4F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_Inventory;                                   // 0x500(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        SwitcherIndex_Inventory;                           // 0x508(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2BD[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UPanelWidget*                          Panel_MyIslandHost;                                // 0x510(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        SwitcherIndex_MyIsland;                            // 0x518(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2BF[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortCreativeSettingsFlow*             MyIslandWidget;                                    // 0x520(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_CreativeInventoryHost;                       // 0x528(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        SwitcherIndex_CreativeInventory;                   // 0x530(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2C0[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortCreativeItemListMenu*             CreativeInventoryWidget;                           // 0x538(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaInventoryPanelBase* GetDefaultObj();

	void SetBypassNotifications(bool bBypass);
	void RequestEquip(class UFortItem* Item);
	void OnOpenInventoryTab(int32 TabIndex);
	void HandleInventoryItemSelected(class UFortItem* Item);
	class UFortItemTileView* GetTileViewForItem(class UFortItem* Item);
	class UUserWidget* GetMyIslandWidget();
	class UUserWidget* GetCreativeInventoryWidget();
	void FocusTileView(class UFortItemTileView* TileView);
	void AttemptToUpdateFocus();
	void AdvanceSelection(class UFortItemTileView* TileView);
};

// 0x188 (0x6E8 - 0x560)
// Class FortniteUI.AthenaItemSelectorScreenBase
class UAthenaItemSelectorScreenBase : public UFortActivatablePanelWithItemPreview
{
public:
	uint8                                        Pad_2E2[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UCommonButton>             TabButtonType;                                     // 0x568(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<enum class EAthenaCustomizationCategory, struct FFortTabButtonLabelInfo> ItemCategoryButtonLabelInfo;                       // 0x570(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FFortTabButtonLabelInfo               VariantButtonLabelInfo;                            // 0x5C0(0xA0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_ConfirmSelection;                           // 0x660(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_EditStyle;                                  // 0x668(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_ConfirmStyle;                               // 0x670(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCustomizationPicker*            Picker_ItemSelector;                               // 0x678(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                          ItemInfo;                                          // 0x680(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemBaseWidget*                   Item_HeaderInfo;                                   // 0x688(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItem*                             CurrentPreviewItem;                                // 0x690(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCosmeticItemDefinition*         CurrentPreviewItemDef;                             // 0x698(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantChannelInfo>        CurrentPreviewVariantChannels;                     // 0x6A0(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortVariantPicker*                    Picker_VariantSelector;                            // 0x6B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticUnlockingInfo*          UnlockingInfo;                                     // 0x6B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2E7[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x6E0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2E8[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0x6E4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaItemSelectorScreenBase* GetDefaultObj();

	void StartItemCustomization(struct FAthenaCustomizationParams& Params);
	void SaveAndExit_ApplyToAllSlots();
	void SaveAndExit(bool bApplyToAllSlots);
	void OnTabSelectionChanged(bool bShowingVariants);
	void OnSavingItemStarted();
	void OnItemSelectionCommited(class UFortItem* SelectedItem);
	void OnItemSelectedChanged(class UFortItem* SelectedItem);
	void OnFinsihedItemSave();
	void OnFinishedItemSetup(class FText& CategoryDisplayName, class FText& ItemDisplayTypeName, enum class EAthenaCustomizationCategory SelectedCategory, class UMaterialInstance* OverrideSlotImage);
	void OnCurrentItemChanged(class UFortItem* SelectedItem);
	bool IsItemOwned(class UFortItem* Item);
	void IsInTextSearchChanged(bool bEnteredTextSearch);
	void HandleSelectedTabChanged(class FName SelectedTabID);
	class UFortItem* GetCurrentItem();
	void ExitEditStyle();
	void EnterEditStyle();
};

// 0x18 (0xB88 - 0xB70)
// Class FortniteUI.AthenaItemShopSectionTab
class UAthenaItemShopSectionTab : public UCommonButton
{
public:
	class UCommonTextBlock*                      Text_TabName;                                      // 0xB70(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortBangWrapper_NUI*                  Bang_Wrapper;                                      // 0xB78(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2EC[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaItemShopSectionTab* GetDefaultObj();

};

// 0x338 (0x770 - 0x438)
// Class FortniteUI.AthenaItemShopScreen
class UAthenaItemShopScreen : public UFortActivatablePanel
{
public:
	float                                        ScrollPadding;                                     // 0x438(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CurrentScrollOffset;                               // 0x43C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_308[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaItemShopSectionDisplayData     ItemShopSectionDisplayDataList[0x8];               // 0x448(0x200)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<enum class EFortItemShopSection>      DefaultItemShopOrdering;                           // 0x648(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   NextCategoryInputAction;                           // 0x658(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PrevCategoryInputAction;                           // 0x668(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   AffiliateInputAction;                              // 0x678(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortAffilateModal>        AffiliateModalClass;                               // 0x688(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortMtxStoreSelectionPopup> StoreSelectionPopupClass;                          // 0x690(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAffilateModal*                    AffiliateModal;                                    // 0x698(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortMtxStoreSelectionPopup*           StoreSelectionPopup;                               // 0x6A0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_Sections;                                // 0x6A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                        HBox_Sections;                                     // 0x6B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_AffiliateName;                                // 0x6B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_SectionTabs;                              // 0x6C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroup*                    TabButtonGroup;                                    // 0x6C8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_30C[0xA0];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaItemShopScreen* GetDefaultObj();

	void OnSectionsEstablished(bool bEmpty);
	void OnEstablishingSections();
	void HandleTabSelectionChanged(class UCommonButton* TabButton, int32 TabIdx);
	void HandleTabClicked(class UCommonButton* TabButton, int32 TabIdx);
	void HandlePurchaseOfferComplete(bool bSuccess, TArray<struct FPurchasedItemInfo>& PurchasedItems);
	void HandlePrevCategoryAction(bool* bPassThrough);
	void HandleOfferSeenInDetails(const class FString& OfferId);
	void HandleNextCategoryAction(bool* bPassThrough);
	void HandleCarouselOfferChanged(const class FString& OfferId);
	void HandleAffiliateAction(bool* bPassThrough);
};

// 0x108 (0x360 - 0x258)
// Class FortniteUI.AthenaItemShopSection
class UAthenaItemShopSection : public UCommonUserWidget
{
public:
	uint8                                        Pad_318[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_Title;                                        // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEventDateTimeTextBlock*           Text_TimeRemaining;                                // 0x270(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Icon_TimeRemaining;                                // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_319[0xE0];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaItemShopSection* GetDefaultObj();

	void OnSectionEstablished(bool bEmptySection);
	void HandleOfferSeenInDetails(const class FString& OfferId);
	void HandleCarouselOfferChanged(class UFortStoreFrontOfferWidgetBase* Target, const class FString& OfferId);
};

// 0x68 (0x3C8 - 0x360)
// Class FortniteUI.AthenaItemShopSection_CommunityVoting
class UAthenaItemShopSection_CommunityVoting : public UAthenaItemShopSection
{
public:
	TSubclassOf<class UFortCommunityVotingTile>  VotingTileClass;                                   // 0x360(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortDirectAcquisitionOfferWidget> WinningOfferTileClass;                             // 0x368(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortCommunityVotingModalPopup> FirstTimeVoterModalPopupClass;                     // 0x370(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortCommunityVotingRevealScreen> RevealScreenClass;                                 // 0x378(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  FirstTimePopupTitle;                               // 0x380(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                  FirstTimePopupBanner;                              // 0x398(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UFortStoreFrontTileWidgetBase*         SelectedCommunityVotingTile;                       // 0x3B0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Tiles;                                    // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCommunityVotingManager*           VotingManager;                                     // 0x3C0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaItemShopSection_CommunityVoting* GetDefaultObj();

};

// 0x28 (0x388 - 0x360)
// Class FortniteUI.AthenaItemShopSection_Storefront
class UAthenaItemShopSection_Storefront : public UAthenaItemShopSection
{
public:
	class UDynamicEntryBox*                      EntryBox_OfferEntries;                             // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortStoreFrontOfferInfo*>      OffersToDisplay;                                   // 0x368(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_320[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaItemShopSection_Storefront* GetDefaultObj();

};

// 0x10 (0x398 - 0x388)
// Class FortniteUI.AthenaItemShopSection_MixedCurrencyStorefront
class UAthenaItemShopSection_MixedCurrencyStorefront : public UAthenaItemShopSection_Storefront
{
public:
	TArray<struct FItemShopCurrencyDislayData>   CurrencyDisplayDataList;                           // 0x388(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaItemShopSection_MixedCurrencyStorefront* GetDefaultObj();

};

// 0x10 (0x398 - 0x388)
// Class FortniteUI.AthenaItemShopSection_Standalone
class UAthenaItemShopSection_Standalone : public UAthenaItemShopSection_Storefront
{
public:
	TSubclassOf<class UFortStandaloneModalPopup> StandaloneModalPopupClass;                         // 0x388(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  StandaloneStorefrontName;                          // 0x390(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaItemShopSection_Standalone* GetDefaultObj();

};

// 0x10 (0x2E0 - 0x2D0)
// Class FortniteUI.AthenaPostGameScreenWidget
class UAthenaPostGameScreenWidget : public UCommonActivatableWidget
{
public:
	enum class EPostGameScreenType               ScreenType;                                        // 0x2D0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ECinematicBarState                CinematicBarState;                                 // 0x2D1(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPostGameClickCatcherState        ClickCatcherState;                                 // 0x2D2(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_328[0xD];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPostGameScreenWidget* GetDefaultObj();

	void SetPostGameHUDState(enum class EPostGameHUDState NewState);
	void SetPlacementState(enum class EPostGamePlacementWidgetState NewState);
	void SetInputEnabled(bool bNewInputEnabled);
	void GoToPreviousScreen();
	void GoToNextScreen();
	bool GetWantsToShowContent();
	enum class EPostGameScreenType GetScreenType();
	enum class EPostGameClickCatcherState GetClickCatcherState();
	enum class ECinematicBarState GetCinematicBarState();
};

// 0x0 (0x2E0 - 0x2E0)
// Class FortniteUI.AthenaKillerScreenWidget
class UAthenaKillerScreenWidget : public UAthenaPostGameScreenWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaKillerScreenWidget* GetDefaultObj();

	bool NativeShouldShowScreen();
};

// 0x50 (0x2A8 - 0x258)
// Class FortniteUI.AthenaLastKillerInfoWidget
class UAthenaLastKillerInfoWidget : public UCommonUserWidget
{
public:
	UMulticastInlineDelegateProperty_            ShouldShowDeathReport;                             // 0x258(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	float                                        TimeToWait;                                        // 0x268(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_335[0x3C];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLastKillerInfoWidget* GetDefaultObj();

	void SetNumOfKillerKills(int32 NumOfKillers);
	void SetKillerWeaponIconAndName(class UTexture2D* IconTexture, class UFortWeaponItemDefinition* ItemDef);
	void SetKillerName(const class FString& PlayerName, const class FString& PlayerID);
	void SetKillerHealthAndShield(float HealthPercent, float ShieldPercent);
	void Activate();
};

// 0x238 (0x670 - 0x438)
// Class FortniteUI.AthenaLeaderboardScreenBase
class UAthenaLeaderboardScreenBase : public UFortActivatablePanel
{
public:
	class UFortTabListWidgetBase*                LeaderboardTabList;                                // 0x438(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                        MatchRotator;                                      // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                        LeaderboardTypeRotator;                            // 0x448(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      RefreshTimeText;                                   // 0x450(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      NoDataMessageText;                                 // 0x458(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonBorder*                         BorderLocalUserFocus;                              // 0x460(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                               Widget_ProfileStats;                               // 0x468(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_Wins;                                  // 0x470(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_SecondTierFinishes;                    // 0x478(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_ThirdTierFinishes;                     // 0x480(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_Eliminations;                          // 0x488(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortProfileStatsRow*                  AthenaStats_MatchesPlayer;                         // 0x490(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_ChangeFlag;                                 // 0x498(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortFlagImage*                        Image_YourFlag;                                    // 0x4A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  LTMPlaylistDefaultName;                            // 0x4A8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortFlagSelectionModal>   FortFlagSelectionModalClass;                       // 0x4B0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UFortProfileStatsRow*> ActiveProfileRows;                                 // 0x4B8(0x50)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_353[0x88];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            PlaylistsData;                                     // 0x590(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UCommonButton*>      ActiveTabButtons;                                  // 0x598(0x50)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortLeaderboardRowProxyInstance*> RowProxies;                                        // 0x5E8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UFortLeaderboardRowProxyInstance*      LocalUserRowProxy;                                 // 0x5F8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLeaderboardFilter                    CurrentLeaderboardFilter;                          // 0x600(0x20)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_355[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLeaderboardScreenBase* GetDefaultObj();

	void OnUpdateTabButtonText(class UCommonButton* Button, struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateListHeader(struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateLeaderboardListUI(bool bWasSuccessful, class UFortLeaderboardRowProxyInstance* LocalUserRow, class FText& QueryErrorStr);
	void OnQueryStarted();
	void OnQueryFinished();
	void OnPlaylistChanged(class FName NewPlaylistName, enum class ECommonInputType NewInputType);
	void OnMatchTypeChanged(int32 MatchTypeIndex);
	void OnFriendsFilterChanged(int32 FriendsFilterIndex);
	void OnActiveLeaderboardTabChanged(int32 ActiveWidgetIndex);
	bool CanShowFriendsOnlyLeaderboard();
};

// 0x28 (0x2F8 - 0x2D0)
// Class FortniteUI.AthenaLetoLogin
class UAthenaLetoLogin : public UCommonActivatableWidget
{
public:
	class UPanelWidget*                          Panel_Login;                                       // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortUIStateWidget_Login>  LoginWidgetClass;                                  // 0x2D8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_35A[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLetoLogin* GetDefaultObj();

};

// 0x0 (0x2D0 - 0x2D0)
// Class FortniteUI.AthenaLevelBarBase
class UAthenaLevelBarBase : public UFortActorIndicatorWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaLevelBarBase* GetDefaultObj();

};

// 0x68 (0x300 - 0x298)
// Class FortniteUI.AthenaLevelUpWidget
class UAthenaLevelUpWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_35E[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AmountOfTimeToWait;                                // 0x2D8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsLeveling;                                       // 0x2DC(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_360[0xB];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x2E8(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_361[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                QueuedLevels;                                      // 0x2F0(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaLevelUpWidget* GetDefaultObj();

	void ShowWidget(int32 NewLevel);
	void NativeOnLevelUp(int32 NewLevel);
	void CloseWidget();
};

// 0x10 (0x268 - 0x258)
// Class FortniteUI.AthenaLoadoutEntryWidget
class UAthenaLoadoutEntryWidget : public UCommonUserWidget
{
public:
	class UFortAthenaInventoryLoadout*           SelectedLoadout;                                   // 0x258(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_364[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLoadoutEntryWidget* GetDefaultObj();

	void SetLoadout(class UFortAthenaInventoryLoadout* NewLoadout);
	void OnLoadoutPicked();
};

// 0x20 (0x458 - 0x438)
// Class FortniteUI.AthenaLoadoutWidget
class UAthenaLoadoutWidget : public UFortActivatablePanel
{
public:
	TArray<class UAthenaLoadoutEntryWidget*>     EntryWidgets;                                      // 0x438(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UAthenaLoadoutEntryWidget> EntryWidgetClass;                                  // 0x448(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_36A[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLoadoutWidget* GetDefaultObj();

	void OnLoadoutChosen(class UFortAthenaInventoryLoadout* SelectedLoadout);
	void AddEntryWidget(class UAthenaLoadoutEntryWidget* NewWidget);
};

// 0x50 (0x488 - 0x438)
// Class FortniteUI.FortLobbyWidget
class UFortLobbyWidget : public UFortActivatablePanel
{
public:
	uint8                                        Pad_36F[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AAthenaSquadPedestalGroup*             SquadPedestalGroup;                                // 0x448(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortTeamMemberPedestal*>       VisualOrderedPedestals;                            // 0x450(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_370[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortRadialPicker*                     Radial_EmotePicker;                                // 0x468(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLobbyPlayerPanel*                 PlayerPanel_PlayerOptions;                         // 0x470(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   EmoteInputAction;                                  // 0x478(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortLobbyWidget* GetDefaultObj();

	void OnPlayerPanelHidden();
	void OnPlayerClicked();
	void HandleEmoteClicked(bool* bPassThrough);
	void DynamicHandleLoadingScreenVisibilityChanged(bool IsVisible);
};

// 0x1B0 (0x638 - 0x488)
// Class FortniteUI.AthenaLobbyBase
class UAthenaLobbyBase : public UFortLobbyWidget
{
public:
	uint8                                        Pad_384[0x22];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         ShownGlyphBundleUpdate;                            // 0x4AA(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortLobbyType                    CurrentLobbyType;                                  // 0x4AB(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_385[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortAthenaNewsPanel>      NewsModalClass;                                    // 0x4B0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortAthenaMOTDPanel>      MOTDModalClass;                                    // 0x4B8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortTutorialLobbyPopup>   GuidedTutorialPopupModalClass;                     // 0x4C0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortSquadSelectionMenu>   SquadFormationClass;                               // 0x4C8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonActivatableWidget>  LiveStreamVideoClass;                              // 0x4D0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  BadMatchPopupTitle;                                // 0x4D8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  BadMatchPopupDescription;                          // 0x4F0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonActivatableWidget>  FeedbackWidgetClass;                               // 0x508(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                 Switcher_Matchmaking;                              // 0x510(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_388[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAthenaMatchmakingWidgetLegacy*    Matchmaking_AthenaLegacy;                          // 0x520(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEmergencyNoticeBase*                  Notice_Emergency;                                  // 0x528(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAthenaMOTDTeaserWidget*           FortAthenaMOTDTeaserWidget_Main;                   // 0x530(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                         LobbyDetails_Default;                              // 0x538(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTournamentLobbyPanel*             LobbyDetails_Tournament;                           // 0x540(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDivisionLobbyPanel*               LobbyDetails_ShowdownDivision;                     // 0x548(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeInfoPanel*             ChallengeInfo_Widget;                              // 0x550(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaMissionInfoPanel*               MissionInfo_Widget;                                // 0x558(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 Switcher_LobbyDetailsMode;                         // 0x560(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_GenericLink;                                // 0x568(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ShadowPlayHighlights;                       // 0x570(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   SquadFormationInputAction;                         // 0x578(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   WatchLiveInputAction;                              // 0x588(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_38A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCatalogMessaging*                     CatalogMessaging;                                  // 0x5A0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_38B[0x90];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLobbyBase* GetDefaultObj();

	void UpdateGenericLinkText(class FText& NewText);
	void ShowMobileAutoFireScreen();
	void ShowHighlightSummary();
	void OnUpdateSocialImportButtonText(class FText& NewText);
	void OnPlaylistChanged(enum class EFortLobbyType LobbyType, class UFortPlaylistAthena* PlaylistData);
	void OnLobbyChanged(enum class EFortLobbyType& LobbyType);
	void HandleWatchLiveStreamClicked(bool* bPassThrough);
	void HandlePlaylistDataChanged(struct FPlaylistData& NewPlaylistData);
	void HandleGenericLinkButtonClicked();
	void HandleActiveWidgetChanged(class UWidget* NewActiveWidget, int32 WidgetIndex);
	void DisplayStoreUpdated(class UStoreToastRequest* StoreUpdatedRequest);
	void DisplayGlyphQuestUpdated(int32 NewGlyphs);
};

// 0x68 (0x4A0 - 0x438)
// Class FortniteUI.FortLobbyPlayerPanel
class UFortLobbyPlayerPanel : public UFortActivatablePanel
{
public:
	TSubclassOf<class UFortTeamMemberManage>     ManageModalClass;                                  // 0x438(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_395[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButton*                         Button_AddFriend;                                  // 0x448(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_InviteParty;                                // 0x450(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Manage;                                     // 0x458(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Close;                                      // 0x460(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPlayerBanner*                     Banner_Player;                                     // 0x468(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_PlayerName;                               // 0x470(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                            Text_InviteSent;                                   // 0x478(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_PlatformIcon;                                // 0x480(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_397[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortLobbyPlayerPanel* GetDefaultObj();

	void OnFriendStatusUpdated(enum class EFortFriendRequestStatus FriendRequestStatus);
	void ClosePanel();
};

// 0x18 (0x4B8 - 0x4A0)
// Class FortniteUI.AthenaLobbyPlayerPanel
class UAthenaLobbyPlayerPanel : public UFortLobbyPlayerPanel
{
public:
	class UCommonButton*                         Button_Mute;                                       // 0x4A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ViewProfile;                                // 0x4A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                            Text_BattlePassTier;                               // 0x4B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaLobbyPlayerPanel* GetDefaultObj();

	void OnIsMutedUpdated(bool bIsMuted);
	void OnHasBattlePassUpdated(bool bHasBattlePass);
};

// 0xF0 (0x118 - 0x28)
// Class FortniteUI.FortPlayerViewModel
class UFortPlayerViewModel : public UObject
{
public:
	uint8                                        Pad_3A0[0xF0];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortPlayerViewModel* GetDefaultObj();

};

// 0xB8 (0x1D0 - 0x118)
// Class FortniteUI.AthenaPlayerViewModel
class UAthenaPlayerViewModel : public UFortPlayerViewModel
{
public:
	uint8                                        Pad_3A2[0xB8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerViewModel* GetDefaultObj();

};

// 0x20 (0x1F0 - 0x1D0)
// Class FortniteUI.AthenaLocalPlayerViewModel
class UAthenaLocalPlayerViewModel : public UAthenaPlayerViewModel
{
public:
	class AFortPlayerControllerAthena*           PlayerController;                                  // 0x1D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaIndicatorPlayersCache*          IndicatorCache;                                    // 0x1D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortPlayerPawn*>               ListeningForPawnStates;                            // 0x1E0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaLocalPlayerViewModel* GetDefaultObj();

	void HandleViewTargetPlayerStateReplicated(class AFortPlayerPawn* Pawn);
	void HandleLocalPlayerChangedTeams();
};

// 0x0 (0x438 - 0x438)
// Class FortniteUI.AthenaLootStoreScreenBase
class UAthenaLootStoreScreenBase : public UFortActivatablePanel
{
public:

	static class UClass* StaticClass();
	static class UAthenaLootStoreScreenBase* GetDefaultObj();

};

// 0x18 (0x120 - 0x108)
// Class FortniteUI.AthenaMapLayer
class UAthenaMapLayer : public UWidget
{
public:
	uint8                                        Pad_3AA[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ULocalPlayer*                          LocalPlayer;                                       // 0x118(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaMapLayer* GetDefaultObj();

	void SetLocalPlayer(class ULocalPlayer* LocalPlayer);
	void FlashPlayerIcon();
	void ClearTouches();
};

// 0x0 (0x230 - 0x230)
// Class FortniteUI.AthenaMapPanel
class UAthenaMapPanel : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaMapPanel* GetDefaultObj();

	void OpenOrClose(bool bOpen);
};

// 0x10 (0x2A8 - 0x298)
// Class FortniteUI.AthenaMarkerDetails
class UAthenaMarkerDetails : public UFortHUDElementWidget
{
public:
	class UAthenaMarkerPointer*                  MarkerPointer;                                     // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMarkerDetailsTable*               DetailsTable;                                      // 0x2A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaMarkerDetails* GetDefaultObj();

	void UpdateMarkerData(struct FFortWorldMarkerData& MarkerData);
	void UpdateMarkerAction(enum class EFortMarkerActions MarkerAction);
};

// 0x20 (0x128 - 0x108)
// Class FortniteUI.AthenaMarkerPointer
class UAthenaMarkerPointer : public UWidget
{
public:
	class UMaterialInterface*                    LineMeshMaterial;                                  // 0x108(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             TargetScreenPosition;                              // 0x110(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3B3[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaMarkerPointer* GetDefaultObj();

	void SetTargetScreenPosition(const struct FVector2D& InTargetScreenPosition);
	void SetLineMeshMaterial(class UMaterialInterface* Material);
};

// 0x18 (0x248 - 0x230)
// Class FortniteUI.AthenaMatchReadyDesktopPopup
class UAthenaMatchReadyDesktopPopup : public UUserWidget
{
public:
	uint8                                        Pad_3B8[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaMatchReadyDesktopPopup* GetDefaultObj();

	void UserDismissedDialog(bool bBringToFront);
};

// 0x28 (0x308 - 0x2E0)
// Class FortniteUI.AthenaMatchXPScreenWidget
class UAthenaMatchXPScreenWidget : public UAthenaPostGameScreenWidget
{
public:
	bool                                         bAutoTransitionScreen;                             // 0x2E0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bMedalsFinished;                                   // 0x2E1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3CA[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumWidgetsInRecap;                                 // 0x2E4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumWidgetsFinished;                                // 0x2E8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3CB[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidget*                               Leto_IGMMWrapper;                                  // 0x2F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaPunchCard*                      PunchCard;                                         // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEndOfMatchQuestUpdateWidget*          QuestRecap;                                        // 0x300(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMatchXPScreenWidget* GetDefaultObj();

	void UpdateAllVisibility();
	void SpectatorStreamingChanged(bool bSpectatorStreaming);
	bool ShouldShowItemShopButton();
	void SetEndOfMatchXPValueData(const struct FGameplayTag& Tag, int32 XP, int32 BonusPct);
	void SetEndMatchXPValues(int32 CombatXp, int32 SurvivalXp, int32 BonusMedalXp, int32 MatchXp, int32 TotalXpGained);
	void OnMatchMakingButtonPressed();
	void OnMatchMakingButtonEnabled();
	void OnGoToSpectating();
	void OnGamePhaseChanged(enum class EAthenaGamePhase NewPhase);
	void OnFinished();
	void OnBRMatchReportCompleted();
	void Native_AllMedalsPlaced();
	bool IsMatchMakingButtonEnabled();
	void HandleResurrectingNow(bool bResurrectingNow);
	void FinishUpdatingWidget();
	void AllMedalsPlaced();
};

// 0x8 (0x110 - 0x108)
// Class FortniteUI.AthenaMinimap
class UAthenaMinimap : public UWidget
{
public:
	struct FVector2D                             DesiredSize;                                       // 0x108(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaMinimap* GetDefaultObj();

};

// 0x0 (0x258 - 0x258)
// Class FortniteUI.AthenaPickingLayer
class UAthenaPickingLayer : public UCommonUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaPickingLayer* GetDefaultObj();

};

// 0x38 (0x268 - 0x230)
// Class FortniteUI.AthenaPlayerHitPointBarBase
class UAthenaPlayerHitPointBarBase : public UUserWidget
{
public:
	uint8                                        Pad_3D9[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x240(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EHealthBarType                    BarType;                                           // 0x248(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3DA[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ValueCurrent;                                      // 0x24C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BeginDeltaInterpDelayMin;                          // 0x250(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BeginDeltaInterpDelayMax;                          // 0x254(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ValueLast;                                         // 0x258(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ValueMax;                                          // 0x25C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastToCurrentUpdateRate;                           // 0x260(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3DD[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerHitPointBarBase* GetDefaultObj();

	void OnValueChangedWithReason(float Value, enum class EFortHitPointModificationReason Reason);
	void OnMaxValueChanged(float Value);
	void OnDeltaChanged();
	void OnDBNOStateChanged(bool IsDBNO);
	float GetLastValuePercentage();
	float GetCurrentValuePercentage();
};

// 0x10 (0x2A8 - 0x298)
// Class FortniteUI.AthenaPlayerHitPointInfo
class UAthenaPlayerHitPointInfo : public UFortHUDElementWidget
{
public:
	class UOverlay*                              Overlay_LocalPlayerExtensions;                     // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUseLargeFormat;                                   // 0x2A0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3E6[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaPlayerHitPointInfo* GetDefaultObj();

	void HandleExitVehicle();
	void HandleEnterVehicle();
};

// 0x10 (0x2E0 - 0x2D0)
// Class FortniteUI.AthenaPlayerIndicatorBase
class UAthenaPlayerIndicatorBase : public UFortActorIndicatorWidget
{
public:
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x2D0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x2D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaPlayerIndicatorBase* GetDefaultObj();

	void TalkingStateChanged(class AFortPlayerStateAthena* PS, bool bTalking);
	void ShowCallout(enum class ETeamMemberState Callout);
	void RefreshCurrentPawn();
	void PlayerNameChanged(class AFortPlayerStateAthena* PS, const class FString& PlayerName);
	void NativeBeingRevivedStateChanged(class AFortPlayerStateAthena* PS, bool bReviving);
	void DBNOStateChanged(class AFortPlayerStateAthena* PS, bool bDBNO);
	void BeingRevivedStateChanged(class AFortPlayerStateAthena* PS, bool bReviving, float MaxReviveTime);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaPlayerInfoBaseWidgetInterface
class IAthenaPlayerInfoBaseWidgetInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAthenaPlayerInfoBaseWidgetInterface* GetDefaultObj();

};

// 0x110 (0x3A8 - 0x298)
// Class FortniteUI.AthenaPlayerInfoBase
class UAthenaPlayerInfoBase : public UFortHUDElementWidget
{
public:
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x298(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateColor                           Color_PlayerNameAlive;                             // 0x2A0(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSlateColor                           Color_PlayerNameDead;                              // 0x2C8(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSlateColor                           Color_PlayerNameDisconnected;                      // 0x2F0(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_413[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_HealthBar;                                   // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ShieldBar;                                   // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_StormCN;                                     // 0x338(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_DBNOBar;                                     // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_PlatformIcon;                                // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_PlayerName;                                   // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Marker;                                      // 0x358(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
