#pragma once

// Dumped by Twin1dev || Dumper-8

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// Function FortniteUI.ApolloIntroShimBase.HandleGamePhaseChanged
struct UApolloIntroShimBase_HandleGamePhaseChanged_Params
{
public:
	enum class EAthenaGamePhase                  GamePhase;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent
struct UFortHUDElementWidget_OnVisibilitySetEvent_Params
{
public:
	enum class ESlateVisibility                  InVisibility;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortHUDElementWidget.HandleOnHUDResetToDefaults
struct UFortHUDElementWidget_HandleOnHUDResetToDefaults_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
struct UFortHUDElementWidget_HandleOnHUDElementVisibilityChanged_Params
{
public:
	struct FGameplayTagContainer                 HiddenHUDElementTags;                              // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.LTMWidgetBase.OnStompFailed
struct ULTMWidgetBase_OnStompFailed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.LTMWidgetBase.OnStompedByOtherWidget
struct ULTMWidgetBase_OnStompedByOtherWidget_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.LTMWidgetBase.OnHandleSpectatingChanged
struct ULTMWidgetBase_OnHandleSpectatingChanged_Params
{
public:
	class AFortPlayerStateZone*                  SpectatingTarget;                                  // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.LTMWidgetBase.OnGamePhaseChanged
struct ULTMWidgetBase_OnGamePhaseChanged_Params
{
public:
	enum class EAthenaGamePhase                  NewPhase;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.LTMWidgetBase.K2_OnBecomeInactive
struct ULTMWidgetBase_K2_OnBecomeInactive_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.LTMWidgetBase.K2_OnBecomeActive
struct ULTMWidgetBase_K2_OnBecomeActive_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.LTMWidgetBase.K2_HasActiveContent
struct ULTMWidgetBase_K2_HasActiveContent_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.LTMWidgetBase.GetViewingTeam
struct ULTMWidgetBase_GetViewingTeam_Params
{
public:
	uint8                                        ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AshtonWidgetBase.UpdateAllUI
struct UAshtonWidgetBase_UpdateAllUI_Params
{
public:
	bool                                         bFirstUpdate;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnVillainRespawnsRemainingChanged
struct UAshtonWidgetBase_OnVillainRespawnsRemainingChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnVillainRespawnCountChanged
struct UAshtonWidgetBase_OnVillainRespawnCountChanged_Params
{
public:
	int32                                        NumRespawnsLeft;                                   // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RespawnPercentLeft;                                // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnStoneListChanged
struct UAshtonWidgetBase_OnStoneListChanged_Params
{
public:
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnStoneChanged
struct UAshtonWidgetBase_OnStoneChanged_Params
{
public:
	enum class EAshtonStoneType                  StoneType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAshtonStoneStateType             StoneState;                                        // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnOpenWidget
struct UAshtonWidgetBase_OnOpenWidget_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AshtonWidgetBase.OnCloseWidget
struct UAshtonWidgetBase_OnCloseWidget_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.OnAllSurveysFinishedDelegate__DelegateSignature
struct UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_OnAllSurveysFinishedDelegate__DelegateSignature_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.HandleAllSurveysFinished
struct UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_HandleAllSurveysFinished_Params
{
public:
	class UObject*                               Source;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.DisplaySurveys
struct UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys_Params
{
public:
	class UFortPlayerSurveyDispatcher*           Dispatcher;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SurveyCount;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_66[0x4];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaAccoladeListEntryWidget.SetTitle
struct UAthenaAccoladeListEntryWidget_SetTitle_Params
{
public:
	class FText                                  TitleText;                                         // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaAccoladeListEntryWidget.SetSource
struct UAthenaAccoladeListEntryWidget_SetSource_Params
{
public:
	class FText                                  SourceText;                                        // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAccoladeListEntryWidget.SetIcon
struct UAthenaAccoladeListEntryWidget_SetIcon_Params
{
public:
	class UFortAccoladeItemDefinition*           ItemDef;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaAccoladeListEntryWidget.SetCount
struct UAthenaAccoladeListEntryWidget_SetCount_Params
{
public:
	int32                                        Count;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaAccoladeListWidget.PopulateWidget
struct UAthenaAccoladeListWidget_PopulateWidget_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaAccoladesWidget.OpenWidget
struct UAthenaAccoladesWidget_OpenWidget_Params
{
public:
	class UFortAccoladeItemDefinition*           AccoladeDef;                                       // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        XpValue;                                           // 0x8(0x4)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_69[0x4];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  DisplayName;                                       // 0x10(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaAccoladesWidget.OnXPEvent
struct UAthenaAccoladesWidget_OnXPEvent_Params
{
public:
	struct FXPUIEvent                            XPEvent;                                           // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaAccoladesWidget.OnStompedByOtherWidget
struct UAthenaAccoladesWidget_OnStompedByOtherWidget_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaAccoladesWidget.HasMoreXPEvents
struct UAthenaAccoladesWidget_HasMoreXPEvents_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaAccoladesWidget.ForwardEvent
struct UAthenaAccoladesWidget_ForwardEvent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaAccoladesWidget.EventAdded
struct UAthenaAccoladesWidget_EventAdded_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaAccoladesWidget.CloseWidget
struct UAthenaAccoladesWidget_CloseWidget_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaAccountContext.SimulateBattleBookPurchase
struct UAthenaAccountContext_SimulateBattleBookPurchase_Params
{
public:
	int32                                        NumLevelsToPurchase;                               // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusLevelsGranted;                                // 0x4(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverLimit;                                        // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6C[0x3];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaAccountContext.ShouldReplaceBattleStarsWithAlternateReward
struct UAthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaAccountContext.IsAtMaxBattlePassTier
struct UAthenaAccountContext_IsAtMaxBattlePassTier_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumberAsText
struct UAthenaAccountContext_GetCurrentSeasonNumberAsText_Params
{
public:
	bool                                         bFullText;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6D[0x7];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumber
struct UAthenaAccountContext_GetCurrentSeasonNumber_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonDefinition
struct UAthenaAccountContext_GetCurrentSeasonDefinition_Params
{
public:
	class UAthenaSeasonItemDefinition*           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaAccountContext.GetCurrentChapterNumberAsText
struct UAthenaAccountContext_GetCurrentChapterNumberAsText_Params
{
public:
	bool                                         bFullText;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6E[0x7];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaAccountContext.GetCurrentChapterAndSeasonText
struct UAthenaAccountContext_GetCurrentChapterAndSeasonText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAccountContext.GetBattleBookPurchaseLimit
struct UAthenaAccountContext_GetBattleBookPurchaseLimit_Params
{
public:
	int32                                        MaxNumLevelsPossibleToPurchase;                    // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusLevelsGranted;                                // 0x4(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerState
struct UAthenaAIKillsBase_SetKillsSourcePlayerState_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerController
struct UAthenaAIKillsBase_SetKillsSourcePlayerController_Params
{
public:
	class AFortPlayerControllerAthena*           InPlayerController;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAwardAlertBase.SetDataSource
struct UAthenaAwardAlertBase_SetDataSource_Params
{
public:
	class UAthenaPlayerViewModel*                PlayerViewModel;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaAwardAlertBase.OnAwardGranted
struct UAthenaAwardAlertBase_OnAwardGranted_Params
{
public:
	class UFortAwardItemDefinition*              AwardDefinition;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBattleMapClickHandler.HandleToggledBattleMapLive
struct UAthenaBattleMapClickHandler_HandleToggledBattleMapLive_Params
{
public:
	class ABattleMapPawnLive*                    BattleMapPawn;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapNodeTooltip.OnReplayLevelStreamingChanged
struct UAthenaBattleMapNodeTooltip_OnReplayLevelStreamingChanged_Params
{
public:
	bool                                         bStreaming;                                        // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBattleMapNodeTooltip.HandleUnhoveredNode
struct UAthenaBattleMapNodeTooltip_HandleUnhoveredNode_Params
{
public:
	class ABattleMapNode*                        Node;                                              // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBattleMapHoveredReason           Reason;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_72[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBattleMapNodeTooltip.HandleToggledBattleMapLive
struct UAthenaBattleMapNodeTooltip_HandleToggledBattleMapLive_Params
{
public:
	class ABattleMapPawnLive*                    BattleMapPawn;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapNodeTooltip.HandleTimelineModeChanged
struct UAthenaBattleMapNodeTooltip_HandleTimelineModeChanged_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapNodeTooltip.HandleInputMethodChanged
struct UAthenaBattleMapNodeTooltip_HandleInputMethodChanged_Params
{
public:
	enum class ECommonInputType                  NewInputType;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBattleMapNodeTooltip.HandleHoveredNode
struct UAthenaBattleMapNodeTooltip_HandleHoveredNode_Params
{
public:
	class ABattleMapNode*                        Node;                                              // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBattleMapHoveredReason           Reason;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_73[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBattleMapNodeTooltip.HandleCameraTypeChanged
struct UAthenaBattleMapNodeTooltip_HandleCameraTypeChanged_Params
{
public:
	class AFortPlayerControllerSpectating*       SpectatorPC;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESpectatorCameraType              NewCameraType;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_74[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActivatablePanel.RestoreScrollWidget
struct UFortActivatablePanel_RestoreScrollWidget_Params
{
public:
	class UWidget*                               FallbackWidget;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActivatablePanel.RestoreCenterWidget
struct UFortActivatablePanel_RestoreCenterWidget_Params
{
public:
	class UWidget*                               FallbackWidget;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function FortniteUI.FortActivatablePanel.AsyncPlaySound2D
struct UFortActivatablePanel_AsyncPlaySound2D_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundBase>             SoundToLoad;                                       // 0x8(0x28)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VolumeMultiplier;                                  // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PitchMultiplier;                                   // 0x34(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StartTime;                                         // 0x38(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_76[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.OnReplayLevelStreamingChanged
struct UAthenaBattleMapTimelineWidget_OnReplayLevelStreamingChanged_Params
{
public:
	bool                                         bStreaming;                                        // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomOutPressed
struct UAthenaBattleMapTimelineWidget_HandleZoomOutPressed_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomOutHeld
struct UAthenaBattleMapTimelineWidget_HandleZoomOutHeld_Params
{
public:
	float                                        HeldPercent;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomInPressed
struct UAthenaBattleMapTimelineWidget_HandleZoomInPressed_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomInHeld
struct UAthenaBattleMapTimelineWidget_HandleZoomInHeld_Params
{
public:
	float                                        HeldPercent;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleToggledBattleMapLive
struct UAthenaBattleMapTimelineWidget_HandleToggledBattleMapLive_Params
{
public:
	class ABattleMapPawnLive*                    BattleMapPawn;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineStopPressed
struct UAthenaBattleMapTimelineWidget_HandleTimelineStopPressed_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineScrubToPressed
struct UAthenaBattleMapTimelineWidget_HandleTimelineScrubToPressed_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineModeChanged
struct UAthenaBattleMapTimelineWidget_HandleTimelineModeChanged_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineForwardPressed
struct UAthenaBattleMapTimelineWidget_HandleTimelineForwardPressed_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineBackwardPressed
struct UAthenaBattleMapTimelineWidget_HandleTimelineBackwardPressed_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleSelectedNode
struct UAthenaBattleMapTimelineWidget_HandleSelectedNode_Params
{
public:
	class ABattleMapNode*                        InSelectedNode;                                    // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleExitBattleMapPressed
struct UAthenaBattleMapTimelineWidget_HandleExitBattleMapPressed_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBattleMapTimelineWidget.HandleCameraTypeChanged
struct UAthenaBattleMapTimelineWidget_HandleCameraTypeChanged_Params
{
public:
	class AFortPlayerControllerSpectating*       SpectatorPC;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESpectatorCameraType              NewCameraType;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_78[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBattlePassItemTracker.OnInterpStarted
struct UAthenaBattlePassItemTracker_OnInterpStarted_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBattlePassItemTracker.OnInterpEnded
struct UAthenaBattlePassItemTracker_OnInterpEnded_Params
{
public:
	class UCommonNumericTextBlock*               NumericTextBlock;                                  // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HadCompleted;                                      // 0x8(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7A[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBattlePassTracker.HandleBattlePassPurchaseComplete
struct UAthenaBattlePassTracker_HandleBattlePassPurchaseComplete_Params
{
public:
	bool                                         bSuccess;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnVehicleStateChanged
struct UAthenaBroadcastFollowedPlayerInfoBase_OnVehicleStateChanged_Params
{
public:
	class AActor*                                NewVehicle;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OldVehicle;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnPipModeChanged
struct UAthenaBroadcastFollowedPlayerInfoBase_OnPipModeChanged_Params
{
public:
	bool                                         bPipModeEnabled;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnFollowedPlayerChanged
struct UAthenaBroadcastFollowedPlayerInfoBase_OnFollowedPlayerChanged_Params
{
public:
	class AFortPlayerControllerSpectating*       SpectatingPC;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                      FollowedPlayerState;                               // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnEliminatedStateChanged
struct UAthenaBroadcastFollowedPlayerInfoBase_OnEliminatedStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           PlayerData;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsEliminated;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7D[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaGamePhaseWidgetBase.OnGameStateSet
struct UAthenaGamePhaseWidgetBase_OnGameStateSet_Params
{
public:
	class AFortGameState*                        InGameState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaGamePhaseWidgetBase.OnGamePhaseStepChanged
struct UAthenaGamePhaseWidgetBase_OnGamePhaseStepChanged_Params
{
public:
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaGamePhaseWidgetBase.HandleGamePhaseStepChanged
struct UAthenaGamePhaseWidgetBase_HandleGamePhaseStepChanged_Params
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x10(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7F[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaGamePhaseWidgetBase.HandleCountdownUpdate
struct UAthenaGamePhaseWidgetBase_HandleCountdownUpdate_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastGamePhaseWidget.SetMinigameOverride
struct UAthenaBroadcastGamePhaseWidget_SetMinigameOverride_Params
{
public:
	class AFortMinigame*                         Minigame;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.UpdateUIExtensions
struct UAthenaHUDBase_UpdateUIExtensions_Params
{
public:
	class AFortPlayerState*                      ClientState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortMinigame*                         Minigame;                                          // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.SetZoneCompleted
struct UAthenaHUDBase_SetZoneCompleted_Params
{
public:
	bool                                         bValue;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.SetQuickBarNative
struct UAthenaHUDBase_SetQuickBarNative_Params
{
public:
	bool                                         bShouldDoQuickBarNative;                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.SetFullscreenMapVisibilityNative
struct UAthenaHUDBase_SetFullscreenMapVisibilityNative_Params
{
public:
	bool                                         bIsVisible;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDBase.PrepareToShowEndGameUI
struct UAthenaHUDBase_PrepareToShowEndGameUI_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.OnPlaylistExtensionWidgetCreated
struct UAthenaHUDBase_OnPlaylistExtensionWidgetCreated_Params
{
public:
	enum class EPlaylistUIExtensionSlot          ExtensionSlot;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_82[0x7];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class UUserWidget*                           Widget;                                            // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.OnMinigameHideHUD
struct UAthenaHUDBase_OnMinigameHideHUD_Params
{
public:
	bool                                         bLoading;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDBase.OnHUDScaleChanged
struct UAthenaHUDBase_OnHUDScaleChanged_Params
{
public:
	float                                        HUDScale;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDBase.OnDisplayGameOver
struct UAthenaHUDBase_OnDisplayGameOver_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleVolumeUnloaded
struct UAthenaHUDBase_HandleVolumeUnloaded_Params
{
public:
	class APlayerState*                          ClientState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleVolumeStateChanged
struct UAthenaHUDBase_HandleVolumeStateChanged_Params
{
public:
	enum class EVolumeState                      NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_83[0x7];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class AFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleVolumeLoaded
struct UAthenaHUDBase_HandleVolumeLoaded_Params
{
public:
	class APlayerState*                          ClientState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleUpdateMinigameUIExtensions
struct UAthenaHUDBase_HandleUpdateMinigameUIExtensions_Params
{
public:
	class AFortMinigame*                         Minigame;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleOnMutatorRemoved
struct UAthenaHUDBase_HandleOnMutatorRemoved_Params
{
public:
	class AFortGameplayMutator*                  NewMutator;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleOnMutatorAdded
struct UAthenaHUDBase_HandleOnMutatorAdded_Params
{
public:
	class AFortGameplayMutator*                  NewMutator;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleNewPanelFromMutator
struct UAthenaHUDBase_HandleNewPanelFromMutator_Params
{
public:
	TSubclassOf<class UUserWidget>               PanelClass;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleExitVolume
struct UAthenaHUDBase_HandleExitVolume_Params
{
public:
	class APlayerState*                          ClientState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleEnteredVolume
struct UAthenaHUDBase_HandleEnteredVolume_Params
{
public:
	class APlayerState*                          ClientState;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                           Volume;                                            // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleCursorModeChanging
struct UAthenaHUDBase_HandleCursorModeChanging_Params
{
public:
	bool                                         bCursorModeEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaHUDBase.HandleCursorModeChanged
struct UAthenaHUDBase_HandleCursorModeChanged_Params
{
public:
	bool                                         bCursorModeEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_84[0x3];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FName                                  ActionName;                                        // 0x4(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_85[0x4];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class UUserWidget*                           CustomWidget;                                      // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDBase.GetZoneCompleted
struct UAthenaHUDBase_GetZoneCompleted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDBase.ClearUIExtensions
struct UAthenaHUDBase_ClearUIExtensions_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDBase.BindVolumeEvents
struct UAthenaHUDBase_BindVolumeEvents_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.SetFullscreenMapVisibility
struct UAthenaBroadcastHUDBase_SetFullscreenMapVisibility_Params
{
public:
	bool                                         bIsVisible;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnVolumeEndOverlap
struct UAthenaBroadcastHUDBase_OnVolumeEndOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_88[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnVolumeBeginOverlap
struct UAthenaBroadcastHUDBase_OnVolumeBeginOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89[0x3];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	struct FHitResult                            SweepResult;                                       // 0x20(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnVolumeAdded
struct UAthenaBroadcastHUDBase_OnVolumeAdded_Params
{
public:
	class AFortVolume*                           Volume;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnUnableToPerformAction
struct UAthenaBroadcastHUDBase_OnUnableToPerformAction_Params
{
public:
	struct FGameplayTagContainer                 FailedReason;                                      // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	class FText                                  FailureText;                                       // 0x20(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleSquadStatusActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleSquadStatusActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleScoreboardScreenActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleScoreboardScreenActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleRemainingPlayersActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleRemainingPlayersActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnTogglePipModeActionExecuted
struct UAthenaBroadcastHUDBase_OnTogglePipModeActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleMatchStatusScreenActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleMatchStatusScreenActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleMatchStatusActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleMatchStatusActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleKillFeedActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleKillFeedActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleFollowedPlayerInfoActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleFollowedPlayerInfoActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleEliminatedGridScreenActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleEliminatedGridScreenActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnToggleActiveGridScreenActionExecuted
struct UAthenaBroadcastHUDBase_OnToggleActiveGridScreenActionExecuted_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnPlaylistDataChanged
struct UAthenaBroadcastHUDBase_OnPlaylistDataChanged_Params
{
public:
	class UFortPlaylistAthena*                   PlaylistData;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnPlayerTargetingChanged
struct UAthenaBroadcastHUDBase_OnPlayerTargetingChanged_Params
{
public:
	bool                                         bIsTargeting;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnPipModeChanged
struct UAthenaBroadcastHUDBase_OnPipModeChanged_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnMinigameChanged
struct UAthenaBroadcastHUDBase_OnMinigameChanged_Params
{
public:
	class AFortMinigame*                         NewMinigame;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnIndicatorModeChanged
struct UAthenaBroadcastHUDBase_OnIndicatorModeChanged_Params
{
public:
	bool                                         bIndicatorsEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnHudVisibilityChanged
struct UAthenaBroadcastHUDBase_OnHudVisibilityChanged_Params
{
public:
	enum class EHudVisibilityState               NewVisibility;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnGameStateSet_BP
struct UAthenaBroadcastHUDBase_OnGameStateSet_BP_Params
{
public:
	class AFortGameStateAthena*                  GameStateAthena;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnGameStateSet
struct UAthenaBroadcastHUDBase_OnGameStateSet_Params
{
public:
	class AFortGameState*                        NewGameState;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.OnCurrentPlaylistChanged
struct UAthenaBroadcastHUDBase_OnCurrentPlaylistChanged_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleReplayViewSettings
struct UAthenaBroadcastHUDBase_HandleToggleReplayViewSettings_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleHighlightsList
struct UAthenaBroadcastHUDBase_HandleToggleHighlightsList_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleGoToTime
struct UAthenaBroadcastHUDBase_HandleToggleGoToTime_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleActionFeedScreen
struct UAthenaBroadcastHUDBase_HandleToggleActionFeedScreen_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.HandleSpectatorViewTargetChanged
struct UAthenaBroadcastHUDBase_HandleSpectatorViewTargetChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.HandleNameplatesEnabledChanged
struct UAthenaBroadcastHUDBase_HandleNameplatesEnabledChanged_Params
{
public:
	bool                                         bInNameplatesEnabled;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.HandleHudVisibilityChanged
struct UAthenaBroadcastHUDBase_HandleHudVisibilityChanged_Params
{
public:
	enum class EHudVisibilityState               NewVisibility;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDBase.HandleFollowedPlayerRespawnTimeChanged
struct UAthenaBroadcastHUDBase_HandleFollowedPlayerRespawnTimeChanged_Params
{
public:
	float                                        RespawnTime;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortActorIndicatorWidget.IsIndicatingActor
struct UFortActorIndicatorWidget_IsIndicatingActor_Params
{
public:
	class AActor*                                OtherActor;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDMenuStatusBase.MapActivated
struct UAthenaBroadcastHUDMenuStatusBase_MapActivated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDMenuStatusBase.InventoryActivated
struct UAthenaBroadcastHUDMenuStatusBase_InventoryActivated_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.RemoveHUDMenuStatus
struct UAthenaBroadcastHUDMenuStatusLayerBase_RemoveHUDMenuStatus_Params
{
public:
	class UAthenaBroadcastHUDMenuStatusBase*     HUDMenuStatusWidget;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.DeactivateHudMenuWidget
struct UAthenaBroadcastHUDMenuStatusLayerBase_DeactivateHudMenuWidget_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.AddHUDMenuStatus
struct UAthenaBroadcastHUDMenuStatusLayerBase_AddHUDMenuStatus_Params
{
public:
	class UAthenaBroadcastHUDMenuStatusBase*     HUDMenuStatusWidget;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastKillFeedBase.OnToggleShowKillFeed
struct UAthenaBroadcastKillFeedBase_OnToggleShowKillFeed_Params
{
public:
	bool                                         bShowKillFeed;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastKillFeedBase.OnTimelineScrubbed
struct UAthenaBroadcastKillFeedBase_OnTimelineScrubbed_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaBroadcastKillFeedBase.AddKillFeedEntry
struct UAthenaBroadcastKillFeedBase_AddKillFeedEntry_Params
{
public:
	struct FAthenaBroadcastKillFeedEntryInfo     KillFeedEntryInfo;                                 // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaBroadcastMatchStatusWidget.OnStormPhaseChanged
struct UAthenaBroadcastMatchStatusWidget_OnStormPhaseChanged_Params
{
public:
	int32                                        StormPhase;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaBroadcastPlayerEventScoreWidget.OnRemoteClientEventScoreChanged
struct UAthenaBroadcastPlayerEventScoreWidget_OnRemoteClientEventScoreChanged_Params
{
public:
	int32                                        NewEventScore;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaBroadcastPlayerLocationWidget.OnRemoteClientPoiTagIDChanged
struct UAthenaBroadcastPlayerLocationWidget_OnRemoteClientPoiTagIDChanged_Params
{
public:
	int16                                        RemoteClientPoiTagID;                              // 0x0(0x2)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.SetSquadIdVisible
struct UAthenaEventMatchSquadWidgetBase_SetSquadIdVisible_Params
{
public:
	bool                                         bSquadIdVisible;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadPlaceChanged
struct UAthenaEventMatchSquadWidgetBase_OnSquadPlaceChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InSquadPlace;                                      // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_93[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadKillscoreChanged
struct UAthenaEventMatchSquadWidgetBase_OnSquadKillscoreChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InSquadKills;                                      // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_94[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadIdChanged
struct UAthenaEventMatchSquadWidgetBase_OnSquadIdChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        InSquadId;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_95[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadColorChanged
struct UAthenaEventMatchSquadWidgetBase_OnSquadColorChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          InSquadColor;                                      // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnPlayerAdded
struct UAthenaEventMatchSquadWidgetBase_OnPlayerAdded_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnPipModeChanged
struct UAthenaBroadcastSquadStatusWidget_OnPipModeChanged_Params
{
public:
	bool                                         bPipModeEnabled;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnMinigameTeamIdChanged
struct UAthenaBroadcastSquadStatusWidget_OnMinigameTeamIdChanged_Params
{
public:
	class UFortMinigameTeamIdentification*       MinigameTeamId;                                    // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnFollowedPlayerChanged
struct UAthenaBroadcastSquadStatusWidget_OnFollowedPlayerChanged_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBroadcastSquadStatusWidget.HandleSquadIdChanged
struct UAthenaBroadcastSquadStatusWidget_HandleSquadIdChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SquadId;                                           // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_96[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaBroadcastSquadStatusWidget.HandleFollowedPlayerChanged
struct UAthenaBroadcastSquadStatusWidget_HandleFollowedPlayerChanged_Params
{
public:
	class AFortPlayerControllerSpectating*       SpectatorController;                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                      NewFollowedPlayer;                                 // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaCareerScreen.ShowFeats
struct UAthenaCareerScreen_ShowFeats_Params
{
public:
	bool                                         bShowFeats;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasCompletedFeats;                                // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaChallengeCountdownDisplay.OnChallengeSet
struct UAthenaChallengeCountdownDisplay_OnChallengeSet_Params
{
public:
	struct FTimerDisplayData                     DisplayStyle;                                      // 0x0(0x38)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaChallengeDetailImageGrid.OnOwnedToCompleteTransitions
struct UAthenaChallengeDetailImageGrid_OnOwnedToCompleteTransitions_Params
{
public:
	int32                                        Count;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeOffset;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AdditionalTime;                                    // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaChallengeDetailImageGrid.OnLockedToOwnedTransitions
struct UAthenaChallengeDetailImageGrid_OnLockedToOwnedTransitions_Params
{
public:
	int32                                        Count;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeOffset;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AdditionalTime;                                    // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaChallengeDetailRewardTrack.HandlePreviewItemChanged
struct UAthenaChallengeDetailRewardTrack_HandlePreviewItemChanged_Params
{
public:
	int32                                        RewardIndexToView;                                 // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB0 - 0x0)
// Function FortniteUI.AthenaChallengeDisplayLibrary.GetChallengeStyleLightAccentColor
struct UAthenaChallengeDisplayLibrary_GetChallengeStyleLightAccentColor_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0xA0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLinearColor                          ReturnValue;                                       // 0xA0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteUI.AthenaChallengeDisplayLibrary.ApplyChallengeSetStyleColorsToMaterial
struct UAthenaChallengeDisplayLibrary_ApplyChallengeSetStyleColorsToMaterial_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0xA0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              StyleMaterial;                                     // 0xA0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteUI.AthenaChallengeDisplayLibrary.ApplyChallengeSetStyleColorsToImageMaterial
struct UAthenaChallengeDisplayLibrary_ApplyChallengeSetStyleColorsToImageMaterial_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0xA0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UImage*                                ImageWidget;                                       // 0xA0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeImageGridEntry.TransitionFromOwnedToCompletedState
struct UAthenaChallengeImageGridEntry_TransitionFromOwnedToCompletedState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeImageGridEntry.TransitionFromLockedToOwnedState
struct UAthenaChallengeImageGridEntry_TransitionFromLockedToOwnedState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeImageGridEntry.SetupLockedToOwnState
struct UAthenaChallengeImageGridEntry_SetupLockedToOwnState_Params
{
public:
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaChallengeImageGridEntry.OnChallengeSet
struct UAthenaChallengeImageGridEntry_OnChallengeSet_Params
{
public:
	bool                                         bIsComplete;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLocked;                                         // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeInfoPanelEntry.OnLocalPlayerMissingAssistedChallenge
struct UAthenaChallengeInfoPanelEntry_OnLocalPlayerMissingAssistedChallenge_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeInfoPanelEntry.OnChallengeInfoSet
struct UAthenaChallengeInfoPanelEntry_OnChallengeInfoSet_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeInfoPanelEntry.HandleQuestsUpdated
struct UAthenaChallengeInfoPanelEntry_HandleQuestsUpdated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeInfoPanel.HandleQuestsUpdatedInGame
struct UAthenaChallengeInfoPanel_HandleQuestsUpdatedInGame_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeInfoPanel.HandleCycleQuestsInputAction
struct UAthenaChallengeInfoPanel_HandleCycleQuestsInputAction_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA0 (0xA0 - 0x0)
// Function FortniteUI.AthenaMissionInfoPanel.SetMissionStyle
struct UAthenaMissionInfoPanel_SetMissionStyle_Params
{
public:
	struct FFortChallengeSetStyle                Style;                                             // 0x0(0xA0)(Parm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMissionInfoPanel.HandleCycleMissionClicked
struct UAthenaMissionInfoPanel_HandleCycleMissionClicked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeListEntryBase.StartHighlight
struct UAthenaChallengeListEntryBase_StartHighlight_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeListEntryBase.EndHighlight
struct UAthenaChallengeListEntryBase_EndHighlight_Params
{
public:
};

// 0xA0 (0xA0 - 0x0)
// Function FortniteUI.AthenaChallengeTreeEntry_ChallengeSet.OnChallengeSetEstablished
struct UAthenaChallengeTreeEntry_ChallengeSet_OnChallengeSetEstablished_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0xA0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_Challenge.OnPartyAssistEnabledChanged
struct UAthenaChallengeListEntry_Challenge_OnPartyAssistEnabledChanged_Params
{
public:
	bool                                         bIsPartyAssistEnabled;                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_Challenge.OnChallengeInfoSet
struct UAthenaChallengeListEntry_Challenge_OnChallengeInfoSet_Params
{
public:
	bool                                         bIsComplete;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLocked;                                         // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCompact;                                          // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HideRewards;                                       // 0x3(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_Challenge.GetChallengeWeight
struct UAthenaChallengeListEntry_Challenge_GetChallengeWeight_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_DetailedChallenge.HandleUpperAreaClicked
struct UAthenaChallengeListEntry_DetailedChallenge_HandleUpperAreaClicked_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_DetailedChallenge.HandleCloseChallengeOptionsInputAction
struct UAthenaChallengeListEntry_DetailedChallenge_HandleCloseChallengeOptionsInputAction_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_Header.OnSectionTypeSet
struct UAthenaChallengeListEntry_Header_OnSectionTypeSet_Params
{
public:
	enum class EChallengeListSection             SectionType;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_CompletionReward.OnRewardInfoSet
struct UAthenaChallengeListEntry_CompletionReward_OnRewardInfoSet_Params
{
public:
	bool                                         bIsCompleted;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B2[0x7];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x8(0xA0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_StoreOffer.OnOfferSet
struct UAthenaChallengeListEntry_StoreOffer_OnOfferSet_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeListEntry_StoreOffer.HandleClicked
struct UAthenaChallengeListEntry_StoreOffer_HandleClicked_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaChallengeProgressBar.SetPercentValueForMaterialNumber
struct UAthenaChallengeProgressBar_SetPercentValueForMaterialNumber_Params
{
public:
	int32                                        PercentValue;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaChallengeRecapEntry.UpdateProgressBar
struct UAthenaChallengeRecapEntry_UpdateProgressBar_Params
{
public:
	float                                        StartingPercent;                                   // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EndingPercent;                                     // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeRecapEntry.StartOutroAnim
struct UAthenaChallengeRecapEntry_StartOutroAnim_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeRecapEntry.StartIntroAnim
struct UAthenaChallengeRecapEntry_StartIntroAnim_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeRecapEntry.OutroFinished
struct UAthenaChallengeRecapEntry_OutroFinished_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeRecapEntry.IntroFinished
struct UAthenaChallengeRecapEntry_IntroFinished_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeRewardTrackEntry.StyleChange
struct UAthenaChallengeRewardTrackEntry_StyleChange_Params
{
public:
	bool                                         bViewingPrestige;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeRewardTrackEntry.SetToDefaultState
struct UAthenaChallengeRewardTrackEntry_SetToDefaultState_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeRewardTrackEntry.SetLastNodeInTrack
struct UAthenaChallengeRewardTrackEntry_SetLastNodeInTrack_Params
{
public:
	bool                                         bIsLast;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeRewardTrackEntry.SetAsCurrentPreviewItem
struct UAthenaChallengeRewardTrackEntry_SetAsCurrentPreviewItem_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeRewardTrackEntry.NextRewardToEarn
struct UAthenaChallengeRewardTrackEntry_NextRewardToEarn_Params
{
public:
	bool                                         bNext;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeRewardTrackEntry.CompletedNextNode
struct UAthenaChallengeRewardTrackEntry_CompletedNextNode_Params
{
public:
	bool                                         bAnimate;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaChallengeRewardTrackEntry.CompletedCurrentNode
struct UAthenaChallengeRewardTrackEntry_CompletedCurrentNode_Params
{
public:
	bool                                         bAnimate;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         LastReward;                                        // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeRewardTrackEntry.ClearPreviewSelection
struct UAthenaChallengeRewardTrackEntry_ClearPreviewSelection_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.ShouldPlayHolidayVideo
struct UAthenaChallengeScreen_ShouldPlayHolidayVideo_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.OnHandleReplayHolidayVideo
struct UAthenaChallengeScreen_OnHandleReplayHolidayVideo_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.IsPartyAssistedChallengeSet
struct UAthenaChallengeScreen_IsPartyAssistedChallengeSet_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.HandleTabSelectionChanged
struct UAthenaChallengeScreen_HandleTabSelectionChanged_Params
{
public:
	class UCommonButton*                         TabButton;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TabIdx;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B9[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaChallengeScreen.HandleTabClicked
struct UAthenaChallengeScreen_HandleTabClicked_Params
{
public:
	class UCommonButton*                         TabButton;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TabIdx;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BA[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.ShowItemDetails
struct UFortActivatablePanelWithItemPreview_ShowItemDetails_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnVaultItemsViewed
struct UFortActivatablePanelWithItemPreview_OnVaultItemsViewed_Params
{
public:
	TArray<class UFortItem*>                     Items;                                             // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnItemPreviewChanged
struct UFortActivatablePanelWithItemPreview_OnItemPreviewChanged_Params
{
public:
	class AActor*                                NewPrefab;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             NewItem;                                           // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_7
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_6
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_5
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_4
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_3
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_2
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_1
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_0
struct UFortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.HideItemDetails
struct UFortActivatablePanelWithItemPreview_HideItemDetails_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortActivatablePanelWithItemPreview.GetWidgetForFramingViewedItem
struct UFortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem_Params
{
public:
	class UWidget*                               ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails.OnChallengeSetEstablished
struct UAthenaChallengeSetDetails_OnChallengeSetEstablished_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0xA0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         bIsComplete;                                       // 0xA0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C2[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails_Missions.VeiwingBundleLevelChanged
struct UAthenaChallengeSetDetails_Missions_VeiwingBundleLevelChanged_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails_Missions.UpdateLevelUpBundleButtonText
struct UAthenaChallengeSetDetails_Missions_UpdateLevelUpBundleButtonText_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails_Missions.OnBundlePrestiged
struct UAthenaChallengeSetDetails_Missions_OnBundlePrestiged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails_Missions.IsUrgentMission
struct UAthenaChallengeSetDetails_Missions_IsUrgentMission_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails_Missions.IsGenericMission
struct UAthenaChallengeSetDetails_Missions_IsGenericMission_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails_Missions.IsCurrentlyViewPrestige
struct UAthenaChallengeSetDetails_Missions_IsCurrentlyViewPrestige_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails_Missions.HidePriestigeInfo
struct UAthenaChallengeSetDetails_Missions_HidePriestigeInfo_Params
{
public:
	bool                                         bHidePriestigeUpsell;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails_Missions.GetChaseRewardForBundleLevel
struct UAthenaChallengeSetDetails_Missions_GetChaseRewardForBundleLevel_Params
{
public:
	int32                                        BundleLevel;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C4[0x4];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x8(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails_Missions.CanLevelBundle
struct UAthenaChallengeSetDetails_Missions_CanLevelBundle_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeSetDetails_Missions.BundleHasMultipleLevels
struct UAthenaChallengeSetDetails_Missions_BundleHasMultipleLevels_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteUI.AthenaChallengeSetImageGrid.OnChallengeSetEstablished
struct UAthenaChallengeSetImageGrid_OnChallengeSetEstablished_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0xA0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         bIsComplete;                                       // 0xA0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C6[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeSetImageGrid.ApplyNextSort
struct UAthenaChallengeSetImageGrid_ApplyNextSort_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeScreenTileBase.ResetToLocked
struct UAthenaChallengeScreenTileBase_ResetToLocked_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeScreenTileBase.OnContainsPartyAssistedChallengeChanged
struct UAthenaChallengeScreenTileBase_OnContainsPartyAssistedChallengeChanged_Params
{
public:
	bool                                         bHasPartyAssistedChallenge;                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteUI.AthenaChallengeScreenTileBase.OnChallengeSetEstablished
struct UAthenaChallengeScreenTileBase_OnChallengeSetEstablished_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0xA0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         bIsComplete;                                       // 0xA0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLocked;                                         // 0xA1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C9[0x6];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMinimalChallengeInfoEntry.OnChallengeInfoSet
struct UAthenaMinimalChallengeInfoEntry_OnChallengeInfoSet_Params
{
public:
	bool                                         bIsInProgress;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeSetTile_Mission.IsUrgentMission
struct UAthenaChallengeSetTile_Mission_IsUrgentMission_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeSetTile_Mission.IsLockedByTime
struct UAthenaChallengeSetTile_Mission_IsLockedByTime_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeSetTile_Mission.IsGenericMission
struct UAthenaChallengeSetTile_Mission_IsGenericMission_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaChallengeSetTile_Mission.GetSoftTextureForChaseReward
struct UAthenaChallengeSetTile_Mission_GetSoftTextureForChaseReward_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaChallengeSetTile_Mission.CanLevelUpBundle
struct UAthenaChallengeSetTile_Mission_CanLevelUpBundle_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaChallengeTreeView.HandleQuestsUpdated
struct UAthenaChallengeTreeView_HandleQuestsUpdated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCommonPrioritizedWidget.OnStompFailed
struct UAthenaCommonPrioritizedWidget_OnStompFailed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCommonPrioritizedWidget.OnStompedByOtherWidget
struct UAthenaCommonPrioritizedWidget_OnStompedByOtherWidget_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCommonPrioritizedWidget.K2_OnBecomeInactive
struct UAthenaCommonPrioritizedWidget_K2_OnBecomeInactive_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCommonPrioritizedWidget.K2_OnBecomeActive
struct UAthenaCommonPrioritizedWidget_K2_OnBecomeActive_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfoForCosmeticVariant
struct UAthenaCosmeticUnlockingInfo_ShowUnlockingInfoForCosmeticVariant_Params
{
public:
	class UAthenaCosmeticItemDefinition*         InCosmeticItemDef;                                 // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          InVariantChannel;                                  // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          InVariant;                                         // 0x10(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfoForCosmetic
struct UAthenaCosmeticUnlockingInfo_ShowUnlockingInfoForCosmetic_Params
{
public:
	class UAthenaCosmeticItemDefinition*         InCosmeticItemDef;                                 // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfo
struct UAthenaCosmeticUnlockingInfo_ShowUnlockingInfo_Params
{
public:
	class UAthenaCosmeticItemDefinition*         UnlockItem;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                   UnlockSource;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowSeasonUnlockingInfo
struct UAthenaCosmeticUnlockingInfo_ShowSeasonUnlockingInfo_Params
{
public:
	int32                                        SeasonNumber;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TierNumber;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestUpdateAnim
struct UAthenaCosmeticUnlockingInfo_RequestUpdateAnim_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestOutroAnim
struct UAthenaCosmeticUnlockingInfo_RequestOutroAnim_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestIntroAnim
struct UAthenaCosmeticUnlockingInfo_RequestIntroAnim_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.OutroAnimFinished
struct UAthenaCosmeticUnlockingInfo_OutroAnimFinished_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.OnUnlockingInfoSet
struct UAthenaCosmeticUnlockingInfo_OnUnlockingInfoSet_Params
{
public:
	bool                                         bShowProgression;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCosmeticUnlockingInfo.HideUnlockingInfo
struct UAthenaCosmeticUnlockingInfo_HideUnlockingInfo_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnDisplayWarningMessage
struct UAthenaCountdownWidgetBase_OnDisplayWarningMessage_Params
{
public:
	class FText                                  FirstLineText;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  SecondLineText;                                    // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownUpdate
struct UAthenaCountdownWidgetBase_OnCountdownUpdate_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D4[0x4];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  CountdownUpdateText;                               // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownStarted
struct UAthenaCountdownWidgetBase_OnCountdownStarted_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D5[0x4];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  CountdownIntroText;                                // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownFinished
struct UAthenaCountdownWidgetBase_OnCountdownFinished_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleGamePhaseStepChanged
struct UAthenaCountdownWidgetBase_HandleGamePhaseStepChanged_Params
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x10(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D6[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownUpdate
struct UAthenaCountdownWidgetBase_HandleCountdownUpdate_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownStarted
struct UAthenaCountdownWidgetBase_HandleCountdownStarted_Params
{
public:
	int32                                        TimeRemaining;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownFinished
struct UAthenaCountdownWidgetBase_HandleCountdownFinished_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCreativeItemTileButton.OnLoadedItem
struct UAthenaCreativeItemTileButton_OnLoadedItem_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCreativeItemTileButton.OnEntryClick
struct UAthenaCreativeItemTileButton_OnEntryClick_Params
{
public:
	class UAthenaCreativeItemTileButton*         Entry;                                             // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x130 (0x130 - 0x0)
// Function FortniteUI.AthenaCreativeItemTileButton.MakeFortItemEntryObjectWrapper
struct UAthenaCreativeItemTileButton_MakeFortItemEntryObjectWrapper_Params
{
public:
	class UObject*                               Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortItemEntry                        InItemEntry;                                       // 0x8(0x120)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAthenaCreativeItemEntryObjectWrapper* ReturnValue;                                       // 0x128(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaCreativeItemTileButton.GetItemTypeCount
struct UAthenaCreativeItemTileButton_GetItemTypeCount_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x128 (0x128 - 0x0)
// Function FortniteUI.AthenaCreativeItemTileButton.CompareToItemEntry
struct UAthenaCreativeItemTileButton_CompareToItemEntry_Params
{
public:
	struct FFortItemEntry                        InItemEntry;                                       // 0x0(0x120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x120(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D9[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortItemPickerBase.TryCommitSelectedItem
struct UFortItemPickerBase_TryCommitSelectedItem_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortItemPickerBase.SetSelectedItem
struct UFortItemPickerBase_SetSelectedItem_Params
{
public:
	class UFortItem*                             ItemToSelect;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortItemPickerBase.SetSelectedIndex
struct UFortItemPickerBase_SetSelectedIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DC[0x3];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.FortItemPickerBase.OnItemSelectionEvent__DelegateSignature
struct UFortItemPickerBase_OnItemSelectionEvent__DelegateSignature_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.FortItemPickerBase.GetSelectedItem
struct UFortItemPickerBase_GetSelectedItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortItemPickerBase.GetListViewInterface
struct UFortItemPickerBase_GetListViewInterface_Params
{
public:
	TScriptInterface<class IFortItemListViewInterface> ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortItemPickerBase.GetIndexForItem
struct UFortItemPickerBase_GetIndexForItem_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DD[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemPickerBase.ClearSelection
struct UFortItemPickerBase_ClearSelection_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortItemPickerBase.CenterSelectedItemTileWidget
struct UFortItemPickerBase_CenterSelectedItemTileWidget_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.FortItemPickerBase.CanItemBeComitted
struct UFortItemPickerBase_CanItemBeComitted_Params
{
public:
	class UFortItem*                             ItemToCommit;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DE[0x7];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.SetFilter
struct UAthenaCustomizationPicker_SetFilter_Params
{
public:
	class FName                                  FilterName;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.SearchText
struct UAthenaCustomizationPicker_SearchText_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.RefreshView
struct UAthenaCustomizationPicker_RefreshView_Params
{
public:
	bool                                         CategoryChanging;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         FilterChanged;                                     // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSearchTextChanged;                                // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaCustomizationPicker.OnUpdateSaveButtonVisuals__DelegateSignature
struct UAthenaCustomizationPicker_OnUpdateSaveButtonVisuals__DelegateSignature_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.OnSearchEnabled
struct UAthenaCustomizationPicker_OnSearchEnabled_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.OnNoItemsAvailableInFilter
struct UAthenaCustomizationPicker_OnNoItemsAvailableInFilter_Params
{
public:
	class FText                                  EmptyDisplayText;                                  // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.OnItemsAvailableInFilter
struct UAthenaCustomizationPicker_OnItemsAvailableInFilter_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaCustomizationPicker.OnCosmeticChangeSaveEvent__DelegateSignature
struct UAthenaCustomizationPicker_OnCosmeticChangeSaveEvent__DelegateSignature_Params
{
public:
};

// 0x3 (0x3 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleSelectedItemHasChanged
struct UAthenaCustomizationPicker_HandleSelectedItemHasChanged_Params
{
public:
	bool                                         ItemChanged;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AmmoChanged;                                       // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IngredientsChanged;                                // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleFilterTabSelected
struct UAthenaCustomizationPicker_HandleFilterTabSelected_Params
{
public:
	class FName                                  TabNameID;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleFilterTabButtonCreated
struct UAthenaCustomizationPicker_HandleFilterTabButtonCreated_Params
{
public:
	class FName                                  TabNameID;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonButton*                         TabButton;                                         // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.HandleDifferentFilterSetBP
struct UAthenaCustomizationPicker_HandleDifferentFilterSetBP_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.GetQualifiedFilterDisplayName
struct UAthenaCustomizationPicker_GetQualifiedFilterDisplayName_Params
{
public:
	enum class EAthenaFilterDisplayType          InTopFilterDisplaySetting;                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E2[0x7];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.EndCustomizationCategory
struct UAthenaCustomizationPicker_EndCustomizationCategory_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaCustomizationPicker.BeginCustomizationCategory
struct UAthenaCustomizationPicker_BeginCustomizationCategory_Params
{
public:
	enum class EAthenaCustomizationCategory      Category;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E3[0x3];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	int32                                        SubslotToEdit;                                     // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInAllowUnownedItems;                              // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInOneItemPerSlot;                                 // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E4[0x2];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.FortItemTileButton.OnTileSizeOverrideCheck
struct UFortItemTileButton_OnTileSizeOverrideCheck_Params
{
public:
	enum class EFortItemCardSize                 SizeIn;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortItemCardSize                 SizeOut;                                           // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerTileButton.OnEquippedStateChanged
struct UAthenaCustomizationPickerTileButton_OnEquippedStateChanged_Params
{
public:
	bool                                         bEquipped;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnDifferentSlot;                                  // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationPickerTileButton.OnChangeOwnedState
struct UAthenaCustomizationPickerTileButton_OnChangeOwnedState_Params
{
public:
	bool                                         bOwned;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaCustomizationScreen.ShowLockerSlot
struct UAthenaCustomizationScreen_ShowLockerSlot_Params
{
public:
	enum class EAthenaCustomizationCategory      CustomizationCategory;                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EF[0x3];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	int32                                        SlotIndex;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanShowEmpty;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F0[0x3];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationScreen.ShiftItemsVariantOption
struct UAthenaCustomizationScreen_ShiftItemsVariantOption_Params
{
public:
	class UAthenaCosmeticAccountItem*            Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VariantChannelIndex;                               // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F1[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationScreen.OnLoadoutChanged
struct UAthenaCustomizationScreen_OnLoadoutChanged_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationScreen.GetItemTypeDisplayNames
struct UAthenaCustomizationScreen_GetItemTypeDisplayNames_Params
{
public:
	enum class EAthenaCustomizationCategory      InCategory;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F2[0x7];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationScreen.GetFavoriteItemForCategory
struct UAthenaCustomizationScreen_GetFavoriteItemForCategory_Params
{
public:
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F3[0x3];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	int32                                        SubslotIndex;                                      // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationScreen.GetCategoryDisplayName
struct UAthenaCustomizationScreen_GetCategoryDisplayName_Params
{
public:
	enum class EAthenaCustomizationCategory      InCategory;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F4[0x7];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.ShowLockerSlot
struct UAthenaCustomizationScreenBase_ShowLockerSlot_Params
{
public:
	enum class EAthenaCustomizationCategory      CustomizationCategory;                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F6[0x3];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	int32                                        SlotIndex;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanShowEmpty;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F7[0x3];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.ShiftItemsVariantOption
struct UAthenaCustomizationScreenBase_ShiftItemsVariantOption_Params
{
public:
	class UAthenaCosmeticAccountItem*            Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VariantChannelIndex;                               // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F8[0x4];                                       // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.SetCustomizationSelectionBeingProcessed
struct UAthenaCustomizationScreenBase_SetCustomizationSelectionBeingProcessed_Params
{
public:
	bool                                         bIsBeingProcessed;                                 // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.HandleLoadoutChanged
struct UAthenaCustomizationScreenBase_HandleLoadoutChanged_Params
{
public:
};

// 0x58 (0x58 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.HandleInventoryUpdated
struct UAthenaCustomizationScreenBase_HandleInventoryUpdated_Params
{
public:
	TSet<class FString>                          ItemChangeFlags;                                   // 0x0(0x50)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                        ProfileRevision;                                   // 0x50(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.GetItemTypeDisplayNames
struct UAthenaCustomizationScreenBase_GetItemTypeDisplayNames_Params
{
public:
	enum class EAthenaCustomizationCategory      InCategory;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F9[0x7];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.GetFavoriteItemForCategory
struct UAthenaCustomizationScreenBase_GetFavoriteItemForCategory_Params
{
public:
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FA[0x3];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	int32                                        SubslotIndex;                                      // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaCustomizationScreenBase.GetCategoryDisplayName
struct UAthenaCustomizationScreenBase_GetCategoryDisplayName_Params
{
public:
	enum class EAthenaCustomizationCategory      InCategory;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FB[0x7];                                       // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCustomizationType
struct UAthenaCustomizationSlotSelectorButton_SetCustomizationType_Params
{
public:
	enum class EAthenaCustomizationCategory      NewType;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_100[0x3];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	int32                                        InSubslotIndex;                                    // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          RequiredSlotTag;                                   // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnCustomizationSlotActiveStateChanged
struct UAthenaCustomizationSlotSelectorButton_OnCustomizationSlotActiveStateChanged_Params
{
public:
	bool                                         bInAttachableCosmeticAvailable;                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInActive;                                         // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.IsSlotFilled
struct UAthenaCustomizationSlotSelectorButton_IsSlotFilled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.HandleDifferentHeroLoadoutActivated
struct UAthenaCustomizationSlotSelectorButton_HandleDifferentHeroLoadoutActivated_Params
{
public:
	class UFortMcpProfileCampaign*               Profile;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.GetCustomizationSlotActiveState
struct UAthenaCustomizationSlotSelectorButton_GetCustomizationSlotActiveState_Params
{
public:
	bool                                         bOutAttachableCosmeticAvailable;                   // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOutActive;                                        // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaCustomizationSlotSelectorButton.GetCampaignHeroPartItem
struct UAthenaCustomizationSlotSelectorButton_GetCampaignHeroPartItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.OnStompFailed
struct UAthenaDiscoverabilityBase_OnStompFailed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.OnStompedByOtherWidget
struct UAthenaDiscoverabilityBase_OnStompedByOtherWidget_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.K2_OnBecomeInactive
struct UAthenaDiscoverabilityBase_K2_OnBecomeInactive_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.K2_OnBecomeActive
struct UAthenaDiscoverabilityBase_K2_OnBecomeActive_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaDiscoverabilityBase.CommonArrivalEvent
struct UAthenaDiscoverabilityBase_CommonArrivalEvent_Params
{
public:
	struct FGameplayTag                          NewTag;                                            // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaDiscoveredAreaOverlay.OnNewDiscovery
struct UAthenaDiscoveredAreaOverlay_OnNewDiscovery_Params
{
public:
	class FText                                  LocalizedLocationName;                             // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         bIsNamedLocation;                                  // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_105[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaEndGamePlacementWidget.SetPlacement
struct UAthenaEndGamePlacementWidget_SetPlacement_Params
{
public:
	int32                                        NewPlacement;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEndGamePlacementWidget.Activate
struct UAthenaEndGamePlacementWidget_Activate_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.BacchusHUDElement.ShowHighlight
struct UBacchusHUDElement_ShowHighlight_Params
{
public:
	bool                                         Show;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x17 (0x17 - 0x0)
// Function FortniteUI.BacchusHUDElement.OnHUDStateUpdate
struct UBacchusHUDElement_OnHUDStateUpdate_Params
{
public:
	struct FFortHUDState                         NewState;                                          // 0x0(0x17)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.BacchusHUDElement.HandleInputMethodChanged
struct UBacchusHUDElement_HandleInputMethodChanged_Params
{
public:
	enum class ECommonInputType                  CurrentInputType;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.BacchusHUDElement.BP_GetMobileVisualType
struct UBacchusHUDElement_BP_GetMobileVisualType_Params
{
public:
	struct FGameplayTag                          ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.WeaponTypeChanged
struct UAthenaEquippedItemBase_WeaponTypeChanged_Params
{
public:
	enum class EEquippedWeaponDisplay            Mode;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.WeaponTargetingChanged
struct UAthenaEquippedItemBase_WeaponTargetingChanged_Params
{
public:
	bool                                         bIsTargeting;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.WeaponReloadStarted
struct UAthenaEquippedItemBase_WeaponReloadStarted_Params
{
public:
	float                                        ReloadTime;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortWeaponReloadType             ReloadType;                                        // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10A[0x3];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.WeaponReloadCancelled
struct UAthenaEquippedItemBase_WeaponReloadCancelled_Params
{
public:
	class AFortWeapon*                           Weapon;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.WeaponOverheatValueChanged
struct UAthenaEquippedItemBase_WeaponOverheatValueChanged_Params
{
public:
	float                                        CurrentValue;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxValue;                                          // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortWeaponOverheatState          State;                                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInCooldown;                                     // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10B[0x2];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.UtilityItemTypeChanged
struct UAthenaEquippedItemBase_UtilityItemTypeChanged_Params
{
public:
	class AFortWeapon*                           Weapon;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWeaponItemDefinition*             Item;                                              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.UtilityItemCountChanged
struct UAthenaEquippedItemBase_UtilityItemCountChanged_Params
{
public:
	int32                                        Remaining;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.ResourceTypeChanged
struct UAthenaEquippedItemBase_ResourceTypeChanged_Params
{
public:
	class UFortResourceItemDefinition*           Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ResourceCount;                                     // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10C[0x4];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.ResourceCountChanged
struct UAthenaEquippedItemBase_ResourceCountChanged_Params
{
public:
	int32                                        ResourceCount;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnWorldItemsChanged
struct UAthenaEquippedItemBase_OnWorldItemsChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnWeaponTargetingChanged
struct UAthenaEquippedItemBase_OnWeaponTargetingChanged_Params
{
public:
	bool                                         bIsTargeting;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnWeaponReloadStarted
struct UAthenaEquippedItemBase_OnWeaponReloadStarted_Params
{
public:
	float                                        ReloadTime;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortWeaponReloadType             ReloadType;                                        // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10D[0x3];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnWeaponReloadCancelled
struct UAthenaEquippedItemBase_OnWeaponReloadCancelled_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnWeaponOverheatValueChanged
struct UAthenaEquippedItemBase_OnWeaponOverheatValueChanged_Params
{
public:
	float                                        CurrentValue;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxValue;                                          // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortWeaponOverheatState          State;                                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInCooldown;                                     // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10E[0x2];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnWeaponChanged
struct UAthenaEquippedItemBase_OnWeaponChanged_Params
{
public:
	class AFortWeapon*                           NewWeapon;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                           PrevWeapon;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnViewTargetChanged
struct UAthenaEquippedItemBase_OnViewTargetChanged_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnLocalAmmoChanged
struct UAthenaEquippedItemBase_OnLocalAmmoChanged_Params
{
public:
	int32                                        LocalCount;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LocalRemaining;                                    // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.OnBuildingMaterialChanged
struct UAthenaEquippedItemBase_OnBuildingMaterialChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.HasAmmoChanged
struct UAthenaEquippedItemBase_HasAmmoChanged_Params
{
public:
	bool                                         bHasAmmo;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.AmmoTypeChanged
struct UAthenaEquippedItemBase_AmmoTypeChanged_Params
{
public:
	class AFortWeaponRanged*                     RangedWeapon;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWorldItemDefinition*              Item;                                              // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaEquippedItemBase.AmmoChanged
struct UAthenaEquippedItemBase_AmmoChanged_Params
{
public:
	int32                                        MagazineAmmoCount;                                 // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BackupAmmoCount;                                   // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalRemaining;                                    // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamEliminated_BP
struct UAthenaEventMatchActiveGridScreenBase_OnTeamEliminated_BP_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamEliminated
struct UAthenaEventMatchActiveGridScreenBase_OnTeamEliminated_Params
{
public:
	int32                                        InSquadId;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamChanged_BP
struct UAthenaEventMatchActiveGridScreenBase_OnTeamChanged_BP_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEventMatchEliminatedGridScreenBase.OnTeamEliminated_BP
struct UAthenaEventMatchEliminatedGridScreenBase_OnTeamEliminated_BP_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchEliminatedGridScreenBase.OnPlayerEliminatedStateChanged
struct UAthenaEventMatchEliminatedGridScreenBase_OnPlayerEliminatedStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsEliminated;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_111[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.SetPlayerData
struct UAthenaEventMatchPlayerWidgetBase_SetPlayerData_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnTeamColorChanged
struct UAthenaEventMatchPlayerWidgetBase_OnTeamColorChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          InTeamColor;                                       // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnSquadIdChanged
struct UAthenaEventMatchPlayerWidgetBase_OnSquadIdChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        InSquadId;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_113[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnShieldHealed
struct UAthenaEventMatchPlayerWidgetBase_OnShieldHealed_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InShield;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InShieldMax;                                       // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnShieldDamaged
struct UAthenaEventMatchPlayerWidgetBase_OnShieldDamaged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InShield;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InShieldMax;                                       // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerStateChanged
struct UAthenaEventMatchPlayerWidgetBase_OnPlayerStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerPawnChanged
struct UAthenaEventMatchPlayerWidgetBase_OnPlayerPawnChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                       InPlayerPawn;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerNameChanged
struct UAthenaEventMatchPlayerWidgetBase_OnPlayerNameChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                InPlayerName;                                      // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerDataChanged
struct UAthenaEventMatchPlayerWidgetBase_OnPlayerDataChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlaceChanged
struct UAthenaEventMatchPlayerWidgetBase_OnPlaceChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InPlace;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_114[0x4];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnMaterialCountChanged
struct UAthenaEventMatchPlayerWidgetBase_OnMaterialCountChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InCount;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_115[0x4];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnLocationChanged
struct UAthenaEventMatchPlayerWidgetBase_OnLocationChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                InLocation;                                        // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnKillScoreChanged
struct UAthenaEventMatchPlayerWidgetBase_OnKillScoreChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InKillScore;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_116[0x4];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsReplayRelevancyPlayerChanged
struct UAthenaEventMatchPlayerWidgetBase_OnIsReplayRelevancyPlayerChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsReplayRelevancyPlayer;                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_117[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsInRelevancyChanged
struct UAthenaEventMatchPlayerWidgetBase_OnIsInRelevancyChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsInRelevancy;                                  // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_118[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsFollowedPlayerChanged
struct UAthenaEventMatchPlayerWidgetBase_OnIsFollowedPlayerChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsFollowedPlayer;                               // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_119[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnHealthHealed
struct UAthenaEventMatchPlayerWidgetBase_OnHealthHealed_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InHealth;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InHealthMax;                                       // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnHealthDamaged
struct UAthenaEventMatchPlayerWidgetBase_OnHealthDamaged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InHealth;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InHealthMax;                                       // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDisconnectedChanged
struct UAthenaEventMatchPlayerWidgetBase_OnDisconnectedChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDisconnected;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11A[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDeadStateChanged
struct UAthenaEventMatchPlayerWidgetBase_OnDeadStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDead;                                           // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDBNOStateChanged
struct UAthenaEventMatchPlayerWidgetBase_OnDBNOStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDBNO;                                           // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnBeingRevivedStateChanged
struct UAthenaEventMatchPlayerWidgetBase_OnBeingRevivedStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsBeingRevived;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11D[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardPlayerWidgetBase.SetSquadIdVisible
struct UAthenaEventMatchScoreboardPlayerWidgetBase_SetSquadIdVisible_Params
{
public:
	bool                                         InVisible;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.SetSquadIdsVisible_BP
struct UAthenaEventMatchScoreboardScreenBase_SetSquadIdsVisible_BP_Params
{
public:
	bool                                         bSquadIdsVisible;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.HandleSquadKillScoreChanged
struct UAthenaEventMatchScoreboardScreenBase_HandleSquadKillScoreChanged_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InKillScore;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11F[0x4];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaEventMatchScoreboardScreenBase.HandleSquadEliminated
struct UAthenaEventMatchScoreboardScreenBase_HandleSquadEliminated_Params
{
public:
	class UAthenaRemoteSquadViewData*            InSquadData;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateTimeSinceLastKillText
struct UAthenaEventMatchStatusScreenBase_UpdateTimeSinceLastKillText_Params
{
public:
	class FText                                  TimeSinceLastKillText;                             // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateSupplyDropsLootedText
struct UAthenaEventMatchStatusScreenBase_UpdateSupplyDropsLootedText_Params
{
public:
	class FText                                  SupplyDropsLootedText;                             // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateShotsFiredText
struct UAthenaEventMatchStatusScreenBase_UpdateShotsFiredText_Params
{
public:
	class FText                                  ShotsFiredText;                                    // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePlayersRemainingText
struct UAthenaEventMatchStatusScreenBase_UpdatePlayersRemainingText_Params
{
public:
	class FText                                  PlayersRemainingText;                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePiecesDestroyedText
struct UAthenaEventMatchStatusScreenBase_UpdatePiecesDestroyedText_Params
{
public:
	class FText                                  PiecesDestroyedText;                               // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePiecesBuiltText
struct UAthenaEventMatchStatusScreenBase_UpdatePiecesBuiltText_Params
{
public:
	class FText                                  PiecesBuiltText;                                   // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMostKillsText
struct UAthenaEventMatchStatusScreenBase_UpdateMostKillsText_Params
{
public:
	class FText                                  MostKillsText;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMostKillsScore
struct UAthenaEventMatchStatusScreenBase_UpdateMostKillsScore_Params
{
public:
	class FText                                  MostKillsScore;                                    // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMatchTimeText
struct UAthenaEventMatchStatusScreenBase_UpdateMatchTimeText_Params
{
public:
	class FText                                  MatchTimeText;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateLongestEliminationText
struct UAthenaEventMatchStatusScreenBase_UpdateLongestEliminationText_Params
{
public:
	class FText                                  LongestEliminationText;                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateLongestEliminationScore
struct UAthenaEventMatchStatusScreenBase_UpdateLongestEliminationScore_Params
{
public:
	class FText                                  LongestEliminationScore;                           // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseTimeTitleText
struct UAthenaEventMatchStatusScreenBase_UpdateGamePhaseTimeTitleText_Params
{
public:
	class FText                                  GamePhaseTimeTitleText;                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseTimeText
struct UAthenaEventMatchStatusScreenBase_UpdateGamePhaseTimeText_Params
{
public:
	class FText                                  GamePhaseTimeText;                                 // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseText
struct UAthenaEventMatchStatusScreenBase_UpdateGamePhaseText_Params
{
public:
	class FText                                  GamePhaseText;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateFastestKillText
struct UAthenaEventMatchStatusScreenBase_UpdateFastestKillText_Params
{
public:
	class FText                                  FastestKillText;                                   // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  FastestKillTime;                                   // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageTakenText
struct UAthenaEventMatchStatusScreenBase_UpdateDamageTakenText_Params
{
public:
	class FText                                  DamageTakenText;                                   // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageInflictedText
struct UAthenaEventMatchStatusScreenBase_UpdateDamageInflictedText_Params
{
public:
	class FText                                  DamageInflictedText;                               // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageHealedText
struct UAthenaEventMatchStatusScreenBase_UpdateDamageHealedText_Params
{
public:
	class FText                                  DamageHealedText;                                  // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateCircleRadiusText
struct UAthenaEventMatchStatusScreenBase_UpdateCircleRadiusText_Params
{
public:
	class FText                                  CircleRadiusText;                                  // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateChestsLootedText
struct UAthenaEventMatchStatusScreenBase_UpdateChestsLootedText_Params
{
public:
	class FText                                  ChestsLootedText;                                  // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerKillScoreChanged
struct UAthenaEventMatchStatusScreenBase_OnPlayerKillScoreChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InKillScore;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_124[0x4];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerDeadStateChanged_BP
struct UAthenaEventMatchStatusScreenBase_OnPlayerDeadStateChanged_BP_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDead;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_125[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerDeadStateChanged
struct UAthenaEventMatchStatusScreenBase_OnPlayerDeadStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDead;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_126[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerWidgetAdded
struct UAthenaEventMatchTeamWidgetBase_OnPlayerWidgetAdded_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerDisconnectedChanged
struct UAthenaEventMatchTeamWidgetBase_OnPlayerDisconnectedChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDisconnected;                                 // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_128[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerDeadStateChanged
struct UAthenaEventMatchTeamWidgetBase_OnPlayerDeadStateChanged_Params
{
public:
	class UAthenaRemotePlayerViewData*           InPlayerData;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInIsDead;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_129[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaEventMatchTeamWidgetBase.IsTeamDead
struct UAthenaEventMatchTeamWidgetBase_IsTeamDead_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaEventMatchTeamWidgetBase.GetTeamKills
struct UAthenaEventMatchTeamWidgetBase_GetTeamKills_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaFeatTimelineListEntry.OnWaitingForCompletedTimer
struct UAthenaFeatTimelineListEntry_OnWaitingForCompletedTimer_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaFeatTimelineListEntry.OnTimespanInfoSet
struct UAthenaFeatTimelineListEntry_OnTimespanInfoSet_Params
{
public:
	int32                                        NumDays;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaFeatTimelineListEntry.OnFeatInfoSet
struct UAthenaFeatTimelineListEntry_OnFeatInfoSet_Params
{
public:
	int32                                        NumFeatsOnDay;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IdxOnDay;                                          // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaFeatTimelineListEntry.OnFeatCompletedThisSession
struct UAthenaFeatTimelineListEntry_OnFeatCompletedThisSession_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaFPSBase.HandleShowFPSChanged
struct UAthenaFPSBase_HandleShowFPSChanged_Params
{
public:
	bool                                         bInShowFPS;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaGadgetFuelWidget.SetItem
struct UAthenaGadgetFuelWidget_SetItem_Params
{
public:
	class UFortWorldItem*                        Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaGameFeatureStatus.OnStatusChanged
struct UAthenaGameFeatureStatus_OnStatusChanged_Params
{
public:
	enum class EAthenaGameFeatureStatus          NewStatus;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaGenericHUDTimerWidgetBase.HandleGamePhaseChanged
struct UAthenaGenericHUDTimerWidgetBase_HandleGamePhaseChanged_Params
{
public:
	enum class EAthenaGamePhase                  GamePhase;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaGiftReceivedPrompt.OnGiftInfoPopulated
struct UAthenaGiftReceivedPrompt_OnGiftInfoPopulated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaGiftReceivedPrompt.OnCloseButtonClicked
struct UAthenaGiftReceivedPrompt_OnCloseButtonClicked_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaGiftReceivedPrompt.HandleMessageTextFiltered
struct UAthenaGiftReceivedPrompt_HandleMessageTextFiltered_Params
{
public:
	bool                                         bSuccess;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_138[0x7];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class FString                                SanitizedMessage;                                  // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaGiftReceivedPrompt.HandleGiftingComplete
struct UAthenaGiftReceivedPrompt_HandleGiftingComplete_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaGiftReceivedPrompt.DismissPrompt
struct UAthenaGiftReceivedPrompt_DismissPrompt_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaGrantChallengeModal.ShowNextChallengePopup
struct UAthenaGrantChallengeModal_ShowNextChallengePopup_Params
{
public:
};

// 0xA0 (0xA0 - 0x0)
// Function FortniteUI.AthenaGrantChallengeModal.OnChallengeBundleSet
struct UAthenaGrantChallengeModal_OnChallengeBundleSet_Params
{
public:
	struct FFortChallengeSetStyle                DisplayStyle;                                      // 0x0(0xA0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.VictoryStingerTimeUntilFadeOut
struct UAthenaHUDContext_VictoryStingerTimeUntilFadeOut_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.UseTapToShoot
struct UAthenaHUDContext_UseTapToShoot_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.UseOrRleoadFromHUDStop
struct UAthenaHUDContext_UseOrRleoadFromHUDStop_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.UseOrRleoadFromHUDStart
struct UAthenaHUDContext_UseOrRleoadFromHUDStart_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.UpdateSelectedWidgetMoveOffsetVector
struct UAthenaHUDContext_UpdateSelectedWidgetMoveOffsetVector_Params
{
public:
	struct FVector2D                             VectorOffset;                                      // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FMoveScale;                                        // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.TakeMovementInputFromHUD
struct UAthenaHUDContext_TakeMovementInputFromHUD_Params
{
public:
	struct FVector2D                             MoveVector;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.TakeLookStickInputFromHUD
struct UAthenaHUDContext_TakeLookStickInputFromHUD_Params
{
public:
	struct FVector2D                             LookStickPosition;                                 // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.TakeLookInputFromHUD
struct UAthenaHUDContext_TakeLookInputFromHUD_Params
{
public:
	struct FRotator                              LookRotator;                                       // 0x0(0xC)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.TakeItemSelectionInputFromHUD
struct UAthenaHUDContext_TakeItemSelectionInputFromHUD_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SlotIdx;                                           // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsUsing;                                          // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortQuickBars                    InQuickBar;                                        // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReloadOrUseIfAlreadySelected;                     // 0xA(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStopUseImmediately;                               // 0xB(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.SwapQuickBarFocusFromHUD
struct UAthenaHUDContext_SwapQuickBarFocusFromHUD_Params
{
public:
	enum class EFortQuickBars                    InQuickBar;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13B[0x3];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	int32                                        SlotOverride;                                      // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.StopTargettingFromHUD
struct UAthenaHUDContext_StopTargettingFromHUD_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.StopItemSelectionInputFromHUD
struct UAthenaHUDContext_StopItemSelectionInputFromHUD_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SlotIdx;                                           // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortQuickBars                    InQuickBar;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13C[0x3];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.ShowMobilePicker__DelegateSignature
struct UAthenaHUDContext_ShowMobilePicker__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShowMobilePicker
struct UAthenaHUDContext_ShowMobilePicker_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShowMarkerGameModeMessage
struct UAthenaHUDContext_ShowMarkerGameModeMessage_Params
{
public:
	int32                                        PlayerID;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InstanceID;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShowGameModeMessage
struct UAthenaHUDContext_ShowGameModeMessage_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShouldVictoryUIPushEmoteInput
struct UAthenaHUDContext_ShouldVictoryUIPushEmoteInput_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShouldPlayCustomEndScreenAtLoss
struct UAthenaHUDContext_ShouldPlayCustomEndScreenAtLoss_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShouldDisplayScoreUI
struct UAthenaHUDContext_ShouldDisplayScoreUI_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.ShouldDisplayPlacement
struct UAthenaHUDContext_ShouldDisplayPlacement_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetTargetingToggleable
struct UAthenaHUDContext_SetTargetingToggleable_Params
{
public:
	bool                                         bNewValue;                                         // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetSelectWidgetToMoveMode
struct UAthenaHUDContext_SetSelectWidgetToMoveMode_Params
{
public:
	bool                                         bSet;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetSelectedInventoryItem
struct UAthenaHUDContext_SetSelectedInventoryItem_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetResourceMaterial
struct UAthenaHUDContext_SetResourceMaterial_Params
{
public:
	enum class EFortResourceType                 NewMaterial;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetPTTState
struct UAthenaHUDContext_SetPTTState_Params
{
public:
	enum class EPTTState                         NewPushToTalkState;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetPostGameWidgetPlacement
struct UAthenaHUDContext_SetPostGameWidgetPlacement_Params
{
public:
	class FName                                  WidgetPlacement;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetLockOnStickCoords
struct UAthenaHUDContext_SetLockOnStickCoords_Params
{
public:
	struct FVector2D                             LockOnCoords;                                      // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.SetLocalPlayerWonMatch
struct UAthenaHUDContext_SetLocalPlayerWonMatch_Params
{
public:
	bool                                         bLocalPlayerWon;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.SelectWidgetToMove
struct UAthenaHUDContext_SelectWidgetToMove_Params
{
public:
	class UWidget*                               Widget;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.ReloadFromHUD
struct UAthenaHUDContext_ReloadFromHUD_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.PushGameOverEmoteInput
struct UAthenaHUDContext_PushGameOverEmoteInput_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.PTTStateChange__DelegateSignature
struct UAthenaHUDContext_PTTStateChange__DelegateSignature_Params
{
public:
	enum class EPTTState                         NewPushToTalkState;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.OwnerOrWeaponHasTag
struct UAthenaHUDContext_OwnerOrWeaponHasTag_Params
{
public:
	struct FGameplayTag                          InTag;                                             // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13D[0x3];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnSpecialActorListChanged__DelegateSignature
struct UAthenaHUDContext_OnSpecialActorListChanged__DelegateSignature_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnSignalQualityChange__DelegateSignature
struct UAthenaHUDContext_OnSignalQualityChange__DelegateSignature_Params
{
public:
	float                                        NewQuality;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnResurrectingNow__DelegateSignature
struct UAthenaHUDContext_OnResurrectingNow__DelegateSignature_Params
{
public:
	bool                                         bResurrectingNow;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.OnReadyForWinnerInfoDisplay
struct UAthenaHUDContext_OnReadyForWinnerInfoDisplay_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnPostGameWidgetPlacement__DelegateSignature
struct UAthenaHUDContext_OnPostGameWidgetPlacement__DelegateSignature_Params
{
public:
	class FName                                  WidgetPlacement;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnPlayerNameChange__DelegateSignature
struct UAthenaHUDContext_OnPlayerNameChange__DelegateSignature_Params
{
public:
	class FString                                NewName;                                           // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnPlayerFiredWeapon__DelegateSignature
struct UAthenaHUDContext_OnPlayerFiredWeapon__DelegateSignature_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLowPerformanceMode__DelegateSignature
struct UAthenaHUDContext_OnLowPerformanceMode__DelegateSignature_Params
{
public:
	bool                                         bInLowPerformanceMode;                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalTeamWon__DelegateSignature
struct UAthenaHUDContext_OnLocalTeamWon__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalTeamLost__DelegateSignature
struct UAthenaHUDContext_OnLocalTeamLost__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerWon__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerWon__DelegateSignature_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerLost__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerLost__DelegateSignature_Params
{
public:
	enum class EEndOfMatchReason                 LostReason;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerKilledPlayer__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerKilledPlayer__DelegateSignature_Params
{
public:
	class AFortPlayerStateAthena*                Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerDeathOnWin__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerDeathOnWin__DelegateSignature_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerDBNOStateChanged__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerDBNOStateChanged__DelegateSignature_Params
{
public:
	bool                                         bIsDBNO;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerBeginSkydiving__DelegateSignature
struct UAthenaHUDContext_OnLocalPlayerBeginSkydiving__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnForwardStartedFalling__DelegateSignature
struct UAthenaHUDContext_OnForwardStartedFalling__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnForceStartPostGameFlow__DelegateSignature
struct UAthenaHUDContext_OnForceStartPostGameFlow__DelegateSignature_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnFireStopped__DelegateSignature
struct UAthenaHUDContext_OnFireStopped__DelegateSignature_Params
{
public:
	int32                                        StopFireIndex;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.OnClientSettingUpdatedShowViewers
struct UAthenaHUDContext_OnClientSettingUpdatedShowViewers_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnCanPTTChange__DelegateSignature
struct UAthenaHUDContext_OnCanPTTChange__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaSettingsApplied__DelegateSignature
struct UAthenaHUDContext_OnAthenaSettingsApplied__DelegateSignature_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaHUDAllWinnersAnnounced__DelegateSignature
struct UAthenaHUDContext_OnAthenaHUDAllWinnersAnnounced__DelegateSignature_Params
{
public:
	struct FAthenaWinnerInfo                     WinnerInfo;                                        // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaGamePhaseChanged__DelegateSignature
struct UAthenaHUDContext_OnAthenaGamePhaseChanged__DelegateSignature_Params
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	enum class EAthenaGamePhaseStep              NewPhase;                                          // 0x10(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13E[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaAutoFireChanged__DelegateSignature
struct UAthenaHUDContext_OnAthenaAutoFireChanged__DelegateSignature_Params
{
public:
	bool                                         bEntering;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.OnAllWinnersAnnounced
struct UAthenaHUDContext_OnAllWinnersAnnounced_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.JumpFromHudStart
struct UAthenaHUDContext_JumpFromHudStart_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.JumpFromHudEnd
struct UAthenaHUDContext_JumpFromHudEnd_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsVictoryUICinematic
struct UAthenaHUDContext_IsVictoryUICinematic_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsUsingScope
struct UAthenaHUDContext_IsUsingScope_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsTargeting
struct UAthenaHUDContext_IsTargeting_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsShowViewerCountEnabled
struct UAthenaHUDContext_IsShowViewerCountEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsRunningOnBattery
struct UAthenaHUDContext_IsRunningOnBattery_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsOperatingTurret
struct UAthenaHUDContext_IsOperatingTurret_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsMovingSelectedWidget
struct UAthenaHUDContext_IsMovingSelectedWidget_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsInSelectWidgetToMoveMode
struct UAthenaHUDContext_IsInSelectWidgetToMoveMode_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsInBuildMode
struct UAthenaHUDContext_IsInBuildMode_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsFiringFromTouch
struct UAthenaHUDContext_IsFiringFromTouch_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13F[0x3];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsCurrentWeaponFiring
struct UAthenaHUDContext_IsCurrentWeaponFiring_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsCurrentWeaponChargeable
struct UAthenaHUDContext_IsCurrentWeaponChargeable_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsCrouching
struct UAthenaHUDContext_IsCrouching_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.IsAutoRunEnabled
struct UAthenaHUDContext_IsAutoRunEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.IsActionBound
struct UAthenaHUDContext_IsActionBound_Params
{
public:
	class FName                                  ActionName;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_140[0x3];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.HideGameModeMessage
struct UAthenaHUDContext_HideGameModeMessage_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.HasWifi
struct UAthenaHUDContext_HasWifi_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.HasLockOnTarget
struct UAthenaHUDContext_HasLockOnTarget_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.HasFiringTouch
struct UAthenaHUDContext_HasFiringTouch_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.HasAutofireTarget
struct UAthenaHUDContext_HasAutofireTarget_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// Function FortniteUI.AthenaHUDContext.HandleUIGameplayCue
struct UAthenaHUDContext_HandleUIGameplayCue_Params
{
public:
	class FName                                  CueName;                                           // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EGameplayCueEvent                 EventType;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_141[0x7];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x10(0xB8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.HandleSpectatorViewTargetChanged
struct UAthenaHUDContext_HandleSpectatorViewTargetChanged_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.HandleLocalPlayerDBNOStateChanged
struct UAthenaHUDContext_HandleLocalPlayerDBNOStateChanged_Params
{
public:
	class AFortPawn*                             FortPawn;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDBNO;                                           // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_142[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.HandleLocalPlayerBeginSkydiving
struct UAthenaHUDContext_HandleLocalPlayerBeginSkydiving_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaHUDContext.HandleGamePhaseChange
struct UAthenaHUDContext_HandleGamePhaseChange_Params
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x10(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_143[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetWinnerText
struct UAthenaHUDContext_GetWinnerText_Params
{
public:
	class FText                                  ReturnText;                                        // 0x0(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FText                                  WinnerName;                                        // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetVictoryText
struct UAthenaHUDContext_GetVictoryText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetVictoryStinger
struct UAthenaHUDContext_GetVictoryStinger_Params
{
public:
	class USoundCue*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetSquadConnectedCount
struct UAthenaHUDContext_GetSquadConnectedCount_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetPTTState
struct UAthenaHUDContext_GetPTTState_Params
{
public:
	enum class EPTTState                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetPlayerName
struct UAthenaHUDContext_GetPlayerName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetPlayerColor
struct UAthenaHUDContext_GetPlayerColor_Params
{
public:
	struct FLinearColor                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetLocalTime
struct UAthenaHUDContext_GetLocalTime_Params
{
public:
	int32                                        Hours;                                             // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Minutes;                                           // 0x4(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetLocalPlayerWonMatch
struct UAthenaHUDContext_GetLocalPlayerWonMatch_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetJumpPressedTouchIndex
struct UAthenaHUDContext_GetJumpPressedTouchIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetInteractPressedTouchIndex
struct UAthenaHUDContext_GetInteractPressedTouchIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetInLowPerformanceMode
struct UAthenaHUDContext_GetInLowPerformanceMode_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetGliderDisplayName
struct UAthenaHUDContext_GetGliderDisplayName_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetGamePhase
struct UAthenaHUDContext_GetGamePhase_Params
{
public:
	enum class EAthenaGamePhase                  ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetGameOverDelayTime
struct UAthenaHUDContext_GetGameOverDelayTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetCustomDBNOWidgetClass
struct UAthenaHUDContext_GetCustomDBNOWidgetClass_Params
{
public:
	TSubclassOf<class UUserWidget>               ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetCustomDBNOReviveMaterial
struct UAthenaHUDContext_GetCustomDBNOReviveMaterial_Params
{
public:
	class UMaterialInterface*                    ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetCanPTT
struct UAthenaHUDContext_GetCanPTT_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetBoundActions
struct UAthenaHUDContext_GetBoundActions_Params
{
public:
	TArray<class FName>                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.GetBatteryLevel
struct UAthenaHUDContext_GetBatteryLevel_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x208 (0x208 - 0x0)
// Function FortniteUI.AthenaHUDContext.ForwardOnSpecialActorListChanged
struct UAthenaHUDContext_ForwardOnSpecialActorListChanged_Params
{
public:
	struct FSpecialActorRepData                  SpecialActorData;                                  // 0x0(0x208)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.ForceVictoryRoyaleUI
struct UAthenaHUDContext_ForceVictoryRoyaleUI_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.ForceStartPostGameFlow
struct UAthenaHUDContext_ForceStartPostGameFlow_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.ForceFireFromHUDStop
struct UAthenaHUDContext_ForceFireFromHUDStop_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.FireFromHUDStop
struct UAthenaHUDContext_FireFromHUDStop_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_144[0x4];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class UWidget*                               DebugWidget;                                       // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaHUDContext.FireFromHUDStart
struct UAthenaHUDContext_FireFromHUDStart_Params
{
public:
	int32                                        TouchIndex;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_145[0x4];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class UWidget*                               DebugWidget;                                       // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaHUDContext.ExecuteActionNameFromHUDWithEventType
struct UAthenaHUDContext_ExecuteActionNameFromHUDWithEventType_Params
{
public:
	class FName                                  ActionName;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInputEvent                       KeyEvent;                                          // 0x8(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_146[0x3];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaHUDContext.ExecuteActionNameFromHUD
struct UAthenaHUDContext_ExecuteActionNameFromHUD_Params
{
public:
	class FName                                  ActionName;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.EndUseFromHUD
struct UAthenaHUDContext_EndUseFromHUD_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.EnableAutoRunFromHUD
struct UAthenaHUDContext_EnableAutoRunFromHUD_Params
{
public:
	bool                                         bEnable;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaHUDContext.DisplayPlayerWonTime
struct UAthenaHUDContext_DisplayPlayerWonTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.CycleQuickbar
struct UAthenaHUDContext_CycleQuickbar_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.CanShootInVehicle
struct UAthenaHUDContext_CanShootInVehicle_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.CanCurrentWeaponAutoFireFromReticle
struct UAthenaHUDContext_CanCurrentWeaponAutoFireFromReticle_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDContext.CanAutoRun
struct UAthenaHUDContext_CanAutoRun_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDContext.BeginUseFromHUD
struct UAthenaHUDContext_BeginUseFromHUD_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaHUDGamePhaseChangingBase.UpdateMessaging
struct UAthenaHUDGamePhaseChangingBase_UpdateMessaging_Params
{
public:
	enum class EAthenaGamePhaseStep              Step;                                              // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14B[0x7];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  Message;                                           // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  TimeText;                                          // 0x20(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaHUDGamePhaseChangingBase.HandleGamePhaseStepChanged
struct UAthenaHUDGamePhaseChangingBase_HandleGamePhaseStepChanged_Params
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                 // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	enum class EAthenaGamePhaseStep              GamePhaseStep;                                     // 0x10(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14C[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaHUDGamePhaseChangingBase.GamePhaseStepChanged
struct UAthenaHUDGamePhaseChangingBase_GamePhaseStepChanged_Params
{
public:
	enum class EAthenaGamePhaseStep              Step;                                              // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDMenu.ToggleBladeMenus
struct UAthenaHUDMenu_ToggleBladeMenus_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDMenu.StartPostGame
struct UAthenaHUDMenu_StartPostGame_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDMenu.RecoverFromPostGame
struct UAthenaHUDMenu_RecoverFromPostGame_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDMenu.OnWidgetStackCleared
struct UAthenaHUDMenu_OnWidgetStackCleared_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaHUDMenu.NativeHandleCursorModeChanged
struct UAthenaHUDMenu_NativeHandleCursorModeChanged_Params
{
public:
	bool                                         bCursorModeEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14F[0x3];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class FName                                  ActionName;                                        // 0x4(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_150[0x4];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class UUserWidget*                           CursorModeContentWidget;                           // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaHUDMenu.HandleCursorModeChanged
struct UAthenaHUDMenu_HandleCursorModeChanged_Params
{
public:
	bool                                         bCursorModeEnabled;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_151[0x3];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class FName                                  ActionName;                                        // 0x4(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_152[0x4];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class UUserWidget*                           CursorModeContentWidget;                           // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDMenu.FocusPlayerSwitcher
struct UAthenaHUDMenu_FocusPlayerSwitcher_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDMenu.DismissBladeMenus
struct UAthenaHUDMenu_DismissBladeMenus_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDPlayerActionAlertBase.RequestNextAlert
struct UAthenaHUDPlayerActionAlertBase_RequestNextAlert_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaHUDPlayerActionAlertBase.ClearAlert
struct UAthenaHUDPlayerActionAlertBase_ClearAlert_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaHUDPlayerActionAlertBase.AlertPlayer
struct UAthenaHUDPlayerActionAlertBase_AlertPlayer_Params
{
public:
	enum class EAthenaPlayerActionAlert          Alert;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_153[0x7];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class FText                                  DetailText;                                        // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaIGMPartyMemberWidget.OnWidgetReset
struct UAthenaIGMPartyMemberWidget_OnWidgetReset_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaIGMPartyMemberWidget.OnUserSet
struct UAthenaIGMPartyMemberWidget_OnUserSet_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIGMPartyMemberWidget.OnNewReadiness
struct UAthenaIGMPartyMemberWidget_OnNewReadiness_Params
{
public:
	enum class EGameReadiness                    GameReadiness;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIGMPartyMemberWidget.OnNewLocation
struct UAthenaIGMPartyMemberWidget_OnNewLocation_Params
{
public:
	enum class EFortPartyMemberLocation          NewLocation;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIGMPartyMemberWidget.OnIsPartyLeaderChanged
struct UAthenaIGMPartyMemberWidget_OnIsPartyLeaderChanged_Params
{
public:
	bool                                         bIsPartyLeader;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIGMPartyMemberWidget.IsPlayingFortnite
struct UAthenaIGMPartyMemberWidget_IsPlayingFortnite_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIGMPartyMemberWidget.IsEmptySlot
struct UAthenaIGMPartyMemberWidget_IsEmptySlot_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIGMPartyMemberWidget.GetIsLocalPlayerSlot
struct UAthenaIGMPartyMemberWidget_GetIsLocalPlayerSlot_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIGMPartyMemberWidget.GetIsInGameSlot
struct UAthenaIGMPartyMemberWidget_GetIsInGameSlot_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaIndicatorLayerBase.OnTargetingChanged
struct UAthenaIndicatorLayerBase_OnTargetingChanged_Params
{
public:
	bool                                         bTargeting;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaInventoryContext.StartOrFinishSwap
struct UAthenaInventoryContext_StartOrFinishSwap_Params
{
public:
	int32                                        SlotIndex;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryContext.SetSelectedInventoryItem
struct UAthenaInventoryContext_SetSelectedInventoryItem_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// DelegateFunction FortniteUI.AthenaInventoryContext.OnAthenaInventorySwapStarted__DelegateSignature
struct UAthenaInventoryContext_OnAthenaInventorySwapStarted__DelegateSignature_Params
{
public:
	int32                                        SlotIndex;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction FortniteUI.AthenaInventoryContext.OnAthenaInventorySwapComplete__DelegateSignature
struct UAthenaInventoryContext_OnAthenaInventorySwapComplete__DelegateSignature_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// DelegateFunction FortniteUI.AthenaInventoryContext.OnAthenaInventoryItemSelected__DelegateSignature
struct UAthenaInventoryContext_OnAthenaInventoryItemSelected__DelegateSignature_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaInventoryContext.IsSwapping
struct UAthenaInventoryContext_IsSwapping_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryContext.GetSelectedInventoryItem
struct UAthenaInventoryContext_GetSelectedInventoryItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaInventoryContext.CancelSwap
struct UAthenaInventoryContext_CancelSwap_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.SetBypassNotifications
struct UAthenaInventoryPanelBase_SetBypassNotifications_Params
{
public:
	bool                                         bBypass;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.RequestEquip
struct UAthenaInventoryPanelBase_RequestEquip_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.OnOpenInventoryTab
struct UAthenaInventoryPanelBase_OnOpenInventoryTab_Params
{
public:
	int32                                        TabIndex;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.HandleInventoryItemSelected
struct UAthenaInventoryPanelBase_HandleInventoryItemSelected_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.GetTileViewForItem
struct UAthenaInventoryPanelBase_GetTileViewForItem_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemTileView*                     ReturnValue;                                       // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.GetMyIslandWidget
struct UAthenaInventoryPanelBase_GetMyIslandWidget_Params
{
public:
	class UUserWidget*                           ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.GetCreativeInventoryWidget
struct UAthenaInventoryPanelBase_GetCreativeInventoryWidget_Params
{
public:
	class UUserWidget*                           ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.FocusTileView
struct UAthenaInventoryPanelBase_FocusTileView_Params
{
public:
	class UFortItemTileView*                     TileView;                                          // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.AttemptToUpdateFocus
struct UAthenaInventoryPanelBase_AttemptToUpdateFocus_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaInventoryPanelBase.AdvanceSelection
struct UAthenaInventoryPanelBase_AdvanceSelection_Params
{
public:
	class UFortItemTileView*                     TileView;                                          // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.StartItemCustomization
struct UAthenaItemSelectorScreenBase_StartItemCustomization_Params
{
public:
	struct FAthenaCustomizationParams            Params;                                            // 0x0(0x48)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.SaveAndExit_ApplyToAllSlots
struct UAthenaItemSelectorScreenBase_SaveAndExit_ApplyToAllSlots_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.SaveAndExit
struct UAthenaItemSelectorScreenBase_SaveAndExit_Params
{
public:
	bool                                         bApplyToAllSlots;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnTabSelectionChanged
struct UAthenaItemSelectorScreenBase_OnTabSelectionChanged_Params
{
public:
	bool                                         bShowingVariants;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnSavingItemStarted
struct UAthenaItemSelectorScreenBase_OnSavingItemStarted_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectionCommited
struct UAthenaItemSelectorScreenBase_OnItemSelectionCommited_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectedChanged
struct UAthenaItemSelectorScreenBase_OnItemSelectedChanged_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnFinsihedItemSave
struct UAthenaItemSelectorScreenBase_OnFinsihedItemSave_Params
{
public:
};

// 0x40 (0x40 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnFinishedItemSetup
struct UAthenaItemSelectorScreenBase_OnFinishedItemSetup_Params
{
public:
	class FText                                  CategoryDisplayName;                               // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                  ItemDisplayTypeName;                               // 0x18(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	enum class EAthenaCustomizationCategory      SelectedCategory;                                  // 0x30(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15E[0x7];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class UMaterialInstance*                     OverrideSlotImage;                                 // 0x38(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.OnCurrentItemChanged
struct UAthenaItemSelectorScreenBase_OnCurrentItemChanged_Params
{
public:
	class UFortItem*                             SelectedItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.IsItemOwned
struct UAthenaItemSelectorScreenBase_IsItemOwned_Params
{
public:
	class UFortItem*                             Item;                                              // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15F[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.IsInTextSearchChanged
struct UAthenaItemSelectorScreenBase_IsInTextSearchChanged_Params
{
public:
	bool                                         bEnteredTextSearch;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.HandleSelectedTabChanged
struct UAthenaItemSelectorScreenBase_HandleSelectedTabChanged_Params
{
public:
	class FName                                  SelectedTabID;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.GetCurrentItem
struct UAthenaItemSelectorScreenBase_GetCurrentItem_Params
{
public:
	class UFortItem*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.ExitEditStyle
struct UAthenaItemSelectorScreenBase_ExitEditStyle_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemSelectorScreenBase.EnterEditStyle
struct UAthenaItemSelectorScreenBase_EnterEditStyle_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemShopScreen.OnSectionsEstablished
struct UAthenaItemShopScreen_OnSectionsEstablished_Params
{
public:
	bool                                         bEmpty;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaItemShopScreen.OnEstablishingSections
struct UAthenaItemShopScreen_OnEstablishingSections_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaItemShopScreen.HandleTabSelectionChanged
struct UAthenaItemShopScreen_HandleTabSelectionChanged_Params
{
public:
	class UCommonButton*                         TabButton;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TabIdx;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_164[0x4];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaItemShopScreen.HandleTabClicked
struct UAthenaItemShopScreen_HandleTabClicked_Params
{
public:
	class UCommonButton*                         TabButton;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TabIdx;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_165[0x4];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaItemShopScreen.HandlePurchaseOfferComplete
struct UAthenaItemShopScreen_HandlePurchaseOfferComplete_Params
{
public:
	bool                                         bSuccess;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_166[0x7];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	TArray<struct FPurchasedItemInfo>            PurchasedItems;                                    // 0x8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemShopScreen.HandlePrevCategoryAction
struct UAthenaItemShopScreen_HandlePrevCategoryAction_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaItemShopScreen.HandleOfferSeenInDetails
struct UAthenaItemShopScreen_HandleOfferSeenInDetails_Params
{
public:
	class FString                                OfferId;                                           // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemShopScreen.HandleNextCategoryAction
struct UAthenaItemShopScreen_HandleNextCategoryAction_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaItemShopScreen.HandleCarouselOfferChanged
struct UAthenaItemShopScreen_HandleCarouselOfferChanged_Params
{
public:
	class FString                                OfferId;                                           // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemShopScreen.HandleAffiliateAction
struct UAthenaItemShopScreen_HandleAffiliateAction_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaItemShopSection.OnSectionEstablished
struct UAthenaItemShopSection_OnSectionEstablished_Params
{
public:
	bool                                         bEmptySection;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaItemShopSection.HandleOfferSeenInDetails
struct UAthenaItemShopSection_HandleOfferSeenInDetails_Params
{
public:
	class FString                                OfferId;                                           // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaItemShopSection.HandleCarouselOfferChanged
struct UAthenaItemShopSection_HandleCarouselOfferChanged_Params
{
public:
	class UFortStoreFrontOfferWidgetBase*        Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                OfferId;                                           // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPostGameScreenWidget.SetPostGameHUDState
struct UAthenaPostGameScreenWidget_SetPostGameHUDState_Params
{
public:
	enum class EPostGameHUDState                 NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPostGameScreenWidget.SetPlacementState
struct UAthenaPostGameScreenWidget_SetPlacementState_Params
{
public:
	enum class EPostGamePlacementWidgetState     NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPostGameScreenWidget.SetInputEnabled
struct UAthenaPostGameScreenWidget_SetInputEnabled_Params
{
public:
	bool                                         bNewInputEnabled;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPostGameScreenWidget.GoToPreviousScreen
struct UAthenaPostGameScreenWidget_GoToPreviousScreen_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPostGameScreenWidget.GoToNextScreen
struct UAthenaPostGameScreenWidget_GoToNextScreen_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPostGameScreenWidget.GetWantsToShowContent
struct UAthenaPostGameScreenWidget_GetWantsToShowContent_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPostGameScreenWidget.GetScreenType
struct UAthenaPostGameScreenWidget_GetScreenType_Params
{
public:
	enum class EPostGameScreenType               ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPostGameScreenWidget.GetClickCatcherState
struct UAthenaPostGameScreenWidget_GetClickCatcherState_Params
{
public:
	enum class EPostGameClickCatcherState        ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPostGameScreenWidget.GetCinematicBarState
struct UAthenaPostGameScreenWidget_GetCinematicBarState_Params
{
public:
	enum class ECinematicBarState                ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaKillerScreenWidget.NativeShouldShowScreen
struct UAthenaKillerScreenWidget_NativeShouldShowScreen_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLastKillerInfoWidget.SetNumOfKillerKills
struct UAthenaLastKillerInfoWidget_SetNumOfKillerKills_Params
{
public:
	int32                                        NumOfKillers;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaLastKillerInfoWidget.SetKillerWeaponIconAndName
struct UAthenaLastKillerInfoWidget_SetKillerWeaponIconAndName_Params
{
public:
	class UTexture2D*                            IconTexture;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWeaponItemDefinition*             ItemDef;                                           // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteUI.AthenaLastKillerInfoWidget.SetKillerName
struct UAthenaLastKillerInfoWidget_SetKillerName_Params
{
public:
	class FString                                PlayerName;                                        // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayerID;                                          // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLastKillerInfoWidget.SetKillerHealthAndShield
struct UAthenaLastKillerInfoWidget_SetKillerHealthAndShield_Params
{
public:
	float                                        HealthPercent;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ShieldPercent;                                     // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLastKillerInfoWidget.Activate
struct UAthenaLastKillerInfoWidget_Activate_Params
{
public:
};

// 0x70 (0x70 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateTabButtonText
struct UAthenaLeaderboardScreenBase_OnUpdateTabButtonText_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaPlaylistLeaderboardData        PlaylistTabData;                                   // 0x8(0x68)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateListHeader
struct UAthenaLeaderboardScreenBase_OnUpdateListHeader_Params
{
public:
	struct FAthenaPlaylistLeaderboardData        PlaylistTabData;                                   // 0x0(0x68)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateLeaderboardListUI
struct UAthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI_Params
{
public:
	bool                                         bWasSuccessful;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16E[0x7];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class UFortLeaderboardRowProxyInstance*      LocalUserRow;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  QueryErrorStr;                                     // 0x10(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnQueryStarted
struct UAthenaLeaderboardScreenBase_OnQueryStarted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnQueryFinished
struct UAthenaLeaderboardScreenBase_OnQueryFinished_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnPlaylistChanged
struct UAthenaLeaderboardScreenBase_OnPlaylistChanged_Params
{
public:
	class FName                                  NewPlaylistName;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECommonInputType                  NewInputType;                                      // 0x8(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16F[0x3];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnMatchTypeChanged
struct UAthenaLeaderboardScreenBase_OnMatchTypeChanged_Params
{
public:
	int32                                        MatchTypeIndex;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnFriendsFilterChanged
struct UAthenaLeaderboardScreenBase_OnFriendsFilterChanged_Params
{
public:
	int32                                        FriendsFilterIndex;                                // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.OnActiveLeaderboardTabChanged
struct UAthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged_Params
{
public:
	int32                                        ActiveWidgetIndex;                                 // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLeaderboardScreenBase.CanShowFriendsOnlyLeaderboard
struct UAthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLevelUpWidget.ShowWidget
struct UAthenaLevelUpWidget_ShowWidget_Params
{
public:
	int32                                        NewLevel;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLevelUpWidget.NativeOnLevelUp
struct UAthenaLevelUpWidget_NativeOnLevelUp_Params
{
public:
	int32                                        NewLevel;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLevelUpWidget.CloseWidget
struct UAthenaLevelUpWidget_CloseWidget_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLoadoutEntryWidget.SetLoadout
struct UAthenaLoadoutEntryWidget_SetLoadout_Params
{
public:
	class UFortAthenaInventoryLoadout*           NewLoadout;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLoadoutEntryWidget.OnLoadoutPicked
struct UAthenaLoadoutEntryWidget_OnLoadoutPicked_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLoadoutWidget.OnLoadoutChosen
struct UAthenaLoadoutWidget_OnLoadoutChosen_Params
{
public:
	class UFortAthenaInventoryLoadout*           SelectedLoadout;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLoadoutWidget.AddEntryWidget
struct UAthenaLoadoutWidget_AddEntryWidget_Params
{
public:
	class UAthenaLoadoutEntryWidget*             NewWidget;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortLobbyWidget.OnPlayerPanelHidden
struct UFortLobbyWidget_OnPlayerPanelHidden_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortLobbyWidget.OnPlayerClicked
struct UFortLobbyWidget_OnPlayerClicked_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortLobbyWidget.HandleEmoteClicked
struct UFortLobbyWidget_HandleEmoteClicked_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortLobbyWidget.DynamicHandleLoadingScreenVisibilityChanged
struct UFortLobbyWidget_DynamicHandleLoadingScreenVisibilityChanged_Params
{
public:
	bool                                         IsVisible;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaLobbyBase.UpdateGenericLinkText
struct UAthenaLobbyBase_UpdateGenericLinkText_Params
{
public:
	class FText                                  NewText;                                           // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.ShowMobileAutoFireScreen
struct UAthenaLobbyBase_ShowMobileAutoFireScreen_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.ShowHighlightSummary
struct UAthenaLobbyBase_ShowHighlightSummary_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnUpdateSocialImportButtonText
struct UAthenaLobbyBase_OnUpdateSocialImportButtonText_Params
{
public:
	class FText                                  NewText;                                           // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnPlaylistChanged
struct UAthenaLobbyBase_OnPlaylistChanged_Params
{
public:
	enum class EFortLobbyType                    LobbyType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17A[0x7];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	class UFortPlaylistAthena*                   PlaylistData;                                      // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyBase.OnLobbyChanged
struct UAthenaLobbyBase_OnLobbyChanged_Params
{
public:
	enum class EFortLobbyType                    LobbyType;                                         // 0x0(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandleWatchLiveStreamClicked
struct UAthenaLobbyBase_HandleWatchLiveStreamClicked_Params
{
public:
	bool                                         bPassThrough;                                      // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandlePlaylistDataChanged
struct UAthenaLobbyBase_HandlePlaylistDataChanged_Params
{
public:
	struct FPlaylistData                         NewPlaylistData;                                   // 0x0(0x38)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandleGenericLinkButtonClicked
struct UAthenaLobbyBase_HandleGenericLinkButtonClicked_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaLobbyBase.HandleActiveWidgetChanged
struct UAthenaLobbyBase_HandleActiveWidgetChanged_Params
{
public:
	class UWidget*                               NewActiveWidget;                                   // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        WidgetIndex;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17B[0x4];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLobbyBase.DisplayStoreUpdated
struct UAthenaLobbyBase_DisplayStoreUpdated_Params
{
public:
	class UStoreToastRequest*                    StoreUpdatedRequest;                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaLobbyBase.DisplayGlyphQuestUpdated
struct UAthenaLobbyBase_DisplayGlyphQuestUpdated_Params
{
public:
	int32                                        NewGlyphs;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.FortLobbyPlayerPanel.OnFriendStatusUpdated
struct UFortLobbyPlayerPanel_OnFriendStatusUpdated_Params
{
public:
	enum class EFortFriendRequestStatus          FriendRequestStatus;                               // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.FortLobbyPlayerPanel.ClosePanel
struct UFortLobbyPlayerPanel_ClosePanel_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyPlayerPanel.OnIsMutedUpdated
struct UAthenaLobbyPlayerPanel_OnIsMutedUpdated_Params
{
public:
	bool                                         bIsMuted;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaLobbyPlayerPanel.OnHasBattlePassUpdated
struct UAthenaLobbyPlayerPanel_OnHasBattlePassUpdated_Params
{
public:
	bool                                         bHasBattlePass;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaLocalPlayerViewModel.HandleViewTargetPlayerStateReplicated
struct UAthenaLocalPlayerViewModel_HandleViewTargetPlayerStateReplicated_Params
{
public:
	class AFortPlayerPawn*                       Pawn;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaLocalPlayerViewModel.HandleLocalPlayerChangedTeams
struct UAthenaLocalPlayerViewModel_HandleLocalPlayerChangedTeams_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaMapLayer.SetLocalPlayer
struct UAthenaMapLayer_SetLocalPlayer_Params
{
public:
	class ULocalPlayer*                          LocalPlayer;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMapLayer.FlashPlayerIcon
struct UAthenaMapLayer_FlashPlayerIcon_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMapLayer.ClearTouches
struct UAthenaMapLayer_ClearTouches_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMapPanel.OpenOrClose
struct UAthenaMapPanel_OpenOrClose_Params
{
public:
	bool                                         bOpen;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x108 (0x108 - 0x0)
// Function FortniteUI.AthenaMarkerDetails.UpdateMarkerData
struct UAthenaMarkerDetails_UpdateMarkerData_Params
{
public:
	struct FFortWorldMarkerData                  MarkerData;                                        // 0x0(0x108)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMarkerDetails.UpdateMarkerAction
struct UAthenaMarkerDetails_UpdateMarkerAction_Params
{
public:
	enum class EFortMarkerActions                MarkerAction;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaMarkerPointer.SetTargetScreenPosition
struct UAthenaMarkerPointer_SetTargetScreenPosition_Params
{
public:
	struct FVector2D                             InTargetScreenPosition;                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaMarkerPointer.SetLineMeshMaterial
struct UAthenaMarkerPointer_SetLineMeshMaterial_Params
{
public:
	class UMaterialInterface*                    Material;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMatchReadyDesktopPopup.UserDismissedDialog
struct UAthenaMatchReadyDesktopPopup_UserDismissedDialog_Params
{
public:
	bool                                         bBringToFront;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.UpdateAllVisibility
struct UAthenaMatchXPScreenWidget_UpdateAllVisibility_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.SpectatorStreamingChanged
struct UAthenaMatchXPScreenWidget_SpectatorStreamingChanged_Params
{
public:
	bool                                         bSpectatorStreaming;                               // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.ShouldShowItemShopButton
struct UAthenaMatchXPScreenWidget_ShouldShowItemShopButton_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.SetEndOfMatchXPValueData
struct UAthenaMatchXPScreenWidget_SetEndOfMatchXPValueData_Params
{
public:
	struct FGameplayTag                          Tag;                                               // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        XP;                                                // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusPct;                                          // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.SetEndMatchXPValues
struct UAthenaMatchXPScreenWidget_SetEndMatchXPValues_Params
{
public:
	int32                                        CombatXp;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SurvivalXp;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusMedalXp;                                      // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MatchXp;                                           // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalXpGained;                                     // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.OnMatchMakingButtonPressed
struct UAthenaMatchXPScreenWidget_OnMatchMakingButtonPressed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.OnMatchMakingButtonEnabled
struct UAthenaMatchXPScreenWidget_OnMatchMakingButtonEnabled_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.OnGoToSpectating
struct UAthenaMatchXPScreenWidget_OnGoToSpectating_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.OnGamePhaseChanged
struct UAthenaMatchXPScreenWidget_OnGamePhaseChanged_Params
{
public:
	enum class EAthenaGamePhase                  NewPhase;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.OnFinished
struct UAthenaMatchXPScreenWidget_OnFinished_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.OnBRMatchReportCompleted
struct UAthenaMatchXPScreenWidget_OnBRMatchReportCompleted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.Native_AllMedalsPlaced
struct UAthenaMatchXPScreenWidget_Native_AllMedalsPlaced_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.IsMatchMakingButtonEnabled
struct UAthenaMatchXPScreenWidget_IsMatchMakingButtonEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.HandleResurrectingNow
struct UAthenaMatchXPScreenWidget_HandleResurrectingNow_Params
{
public:
	bool                                         bResurrectingNow;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.FinishUpdatingWidget
struct UAthenaMatchXPScreenWidget_FinishUpdatingWidget_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaMatchXPScreenWidget.AllMedalsPlaced
struct UAthenaMatchXPScreenWidget_AllMedalsPlaced_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnValueChangedWithReason
struct UAthenaPlayerHitPointBarBase_OnValueChangedWithReason_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortHitPointModificationReason   Reason;                                            // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_18A[0x3];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnMaxValueChanged
struct UAthenaPlayerHitPointBarBase_OnMaxValueChanged_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnDeltaChanged
struct UAthenaPlayerHitPointBarBase_OnDeltaChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.OnDBNOStateChanged
struct UAthenaPlayerHitPointBarBase_OnDBNOStateChanged_Params
{
public:
	bool                                         IsDBNO;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.GetLastValuePercentage
struct UAthenaPlayerHitPointBarBase_GetLastValuePercentage_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointBarBase.GetCurrentValuePercentage
struct UAthenaPlayerHitPointBarBase_GetCurrentValuePercentage_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointInfo.HandleExitVehicle
struct UAthenaPlayerHitPointInfo_HandleExitVehicle_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerHitPointInfo.HandleEnterVehicle
struct UAthenaPlayerHitPointInfo_HandleEnterVehicle_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.TalkingStateChanged
struct UAthenaPlayerIndicatorBase_TalkingStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTalking;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_18F[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.ShowCallout
struct UAthenaPlayerIndicatorBase_ShowCallout_Params
{
public:
	enum class ETeamMemberState                  Callout;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.RefreshCurrentPawn
struct UAthenaPlayerIndicatorBase_RefreshCurrentPawn_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.PlayerNameChanged
struct UAthenaPlayerIndicatorBase_PlayerNameChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayerName;                                        // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.NativeBeingRevivedStateChanged
struct UAthenaPlayerIndicatorBase_NativeBeingRevivedStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReviving;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_190[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.DBNOStateChanged
struct UAthenaPlayerIndicatorBase_DBNOStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDBNO;                                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_191[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerIndicatorBase.BeingRevivedStateChanged
struct UAthenaPlayerIndicatorBase_BeingRevivedStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReviving;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_192[0x3];                                      // Fixing Size After Last Property  [ Dumper-8 ]
	float                                        MaxReviveTime;                                     // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.UpdateResurrectionExpirationWidget
struct UAthenaPlayerInfoBase_UpdateResurrectionExpirationWidget_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.TalkingStateChanged
struct UAthenaPlayerInfoBase_TalkingStateChanged_Params
{
public:
	class AFortPlayerStateAthena*                PS;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTalking;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_193[0x7];                                      // Fixing Size Of Struct [ Dumper-8 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.SetPlayerState
struct UAthenaPlayerInfoBase_SetPlayerState_Params
{
public:
	class AFortPlayerStateAthena*                InPlayerState;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteUI.AthenaPlayerInfoBase.SetPlayerName
