#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSkeletalControl
struct UGalileo_LobsterLayerAnimBP_C_ItemSkeletalControl_Params
{
public:
	struct FPoseLink                             InPose;                                            // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemSkeletalControl;                               // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x260 (0x260 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemUpperBody
struct UGalileo_LobsterLayerAnimBP_C_ItemUpperBody_Params
{
public:
	struct FPoseLink                             InPoseUpperBody;                                   // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_AdjustedAim            InputParam;                                        // 0x10(0x240)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemUpperBody;                                     // 0x250(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFullBodySprint
struct UGalileo_LobsterLayerAnimBP_C_ItemFullBodySprint_Params
{
public:
	struct FPoseLink                             InPoseSprint;                                      // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemFullBodySprint;                                // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemIdleAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemIdleAdditive_Params
{
public:
	struct FPoseLink                             InPoseIdleAdditive;                                // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemIdleAdditive;                                  // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemCrouchTurningAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemCrouchTurningAdditive_Params
{
public:
	struct FPoseLink                             ItemCrouchTurningAdditive;                         // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSlopeSliding
struct UGalileo_LobsterLayerAnimBP_C_ItemSlopeSliding_Params
{
public:
	struct FPoseLink                             ItemSlopeSliding;                                  // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJumpUpAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemJumpUpAdditive_Params
{
public:
	struct FPoseLink                             ItemJumpUpAdditive;                                // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJumpLoopAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemJumpLoopAdditive_Params
{
public:
	struct FPoseLink                             ItemJumpLoopAdditive;                              // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFallAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemFallAdditive_Params
{
public:
	struct FPoseLink                             ItemFallAdditive;                                  // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFallLandAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemFallLandAdditive_Params
{
public:
	struct FPoseLink                             ItemFallLandAdditive;                              // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJetPackStartAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemJetPackStartAdditive_Params
{
public:
	struct FPoseLink                             ItemJetPackStartAdditive;                          // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJetPackJumpAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemJetPackJumpAdditive_Params
{
public:
	struct FPoseLink                             ItemJetPackJumpAdditive;                           // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemZipLineStartAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemZipLineStartAdditive_Params
{
public:
	struct FPoseLink                             ItemZipLineStartAdditive;                          // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFlyModeStartAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemFlyModeStartAdditive_Params
{
public:
	struct FPoseLink                             ItemFlyModeStartAdditive;                          // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemFlyModeLoopAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemFlyModeLoopAdditive_Params
{
public:
	struct FPoseLink                             ItemFlyModeLoopAdditive;                           // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJogStartAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemJogStartAdditive_Params
{
public:
	struct FPoseLink                             InPoseJogStartAdditive;                            // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemJogStartAdditive;                              // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJogStopAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemJogStopAdditive_Params
{
public:
	struct FPoseLink                             InPoseJogStopAdditive;                             // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemJogStopAdditive;                               // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJogPrePivotAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemJogPrePivotAdditive_Params
{
public:
	struct FPoseLink                             InPosePrePivotAdditive;                            // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemJogPrePivotAdditive;                           // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemJogPostPivotAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemJogPostPivotAdditive_Params
{
public:
	struct FPoseLink                             InPosePostPivotAdditive;                           // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemJogPostPivotAdditive;                          // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyMovement
struct UGalileo_LobsterLayerAnimBP_C_ItemLowerBodyMovement_Params
{
public:
	struct FPoseLink                             InPoseLowerBodyMovement;                           // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemLowerBodyMovement;                             // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyLeanAdditive
struct UGalileo_LobsterLayerAnimBP_C_ItemLowerBodyLeanAdditive_Params
{
public:
	struct FPoseLink                             InPoseLowerBodyLeanAdditive;                       // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemLowerBodyLeanAdditive;                         // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyJogStart
struct UGalileo_LobsterLayerAnimBP_C_ItemLowerBodyJogStart_Params
{
public:
	struct FPoseLink                             InPoseLowerBodyJogStart;                           // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemLowerBodyJogStart;                             // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyJogStop
struct UGalileo_LobsterLayerAnimBP_C_ItemLowerBodyJogStop_Params
{
public:
	struct FPoseLink                             InPoseLowerBodyJogStop;                            // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemLowerBodyJogStop;                              // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyJogPrePivot
struct UGalileo_LobsterLayerAnimBP_C_ItemLowerBodyJogPrePivot_Params
{
public:
	struct FPoseLink                             InPoseLowerBodyJogPrePivot;                        // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemLowerBodyJogPrePivot;                          // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemLowerBodyJogPostPivot
struct UGalileo_LobsterLayerAnimBP_C_ItemLowerBodyJogPostPivot_Params
{
public:
	struct FPoseLink                             InPoseLowerBodyJogPostPivot;                       // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemLowerBodyJogPostPivot;                         // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemRelaxedEntry
struct UGalileo_LobsterLayerAnimBP_C_ItemRelaxedEntry_Params
{
public:
	struct FPoseLink                             InPoseRelaxedEntry;                                // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                             ItemRelaxedEntry;                                  // 0x10(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSwimJumpStart
struct UGalileo_LobsterLayerAnimBP_C_ItemSwimJumpStart_Params
{
public:
	struct FPoseLink                             ItemSwimJumpStart;                                 // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSwimJumpStartLoop
struct UGalileo_LobsterLayerAnimBP_C_ItemSwimJumpStartLoop_Params
{
public:
	struct FPoseLink                             ItemSwimJumpStartLoop;                             // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSwimJumpFallLoop
struct UGalileo_LobsterLayerAnimBP_C_ItemSwimJumpFallLoop_Params
{
public:
	struct FPoseLink                             ItemSwimJumpFallLoop;                              // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSwimJumpSurfaceLoop
struct UGalileo_LobsterLayerAnimBP_C_ItemSwimJumpSurfaceLoop_Params
{
public:
	struct FPoseLink                             ItemSwimJumpSurfaceLoop;                           // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ItemSwimJumpSurfaceEnd
struct UGalileo_LobsterLayerAnimBP_C_ItemSwimJumpSurfaceEnd_Params
{
public:
	struct FPoseLink                             ItemSwimJumpSurfaceEnd;                            // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x10 (0x10 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.AnimGraph
struct UGalileo_LobsterLayerAnimBP_C_AnimGraph_Params
{
public:
	struct FPoseLink                             AnimGraph;                                         // 0x0(0x10)(Parm, OutParm, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function Galileo_LobsterLayerAnimBP.Galileo_LobsterLayerAnimBP_C.ExecuteUbergraph_Galileo_LobsterLayerAnimBP
struct UGalileo_LobsterLayerAnimBP_C_ExecuteUbergraph_Galileo_LobsterLayerAnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


