#pragma once

// Dumped by Twin1dev || Dumper-8

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.Construct
struct UPlayerSurveyPanel_C_Construct_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.BndEvt__PlayerSurveyPanelContents_K2Node_ComponentBoundEvent_0_OnSurveyEnded__DelegateSignature
struct UPlayerSurveyPanel_C_BndEvt__PlayerSurveyPanelContents_K2Node_ComponentBoundEvent_0_OnSurveyEnded__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.IntroDone
struct UPlayerSurveyPanel_C_IntroDone_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.OutroDone
struct UPlayerSurveyPanel_C_OutroDone_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.HandleSurveyChanged
struct UPlayerSurveyPanel_C_HandleSurveyChanged_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.BP_OnActivated
struct UPlayerSurveyPanel_C_BP_OnActivated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.StartIntro
struct UPlayerSurveyPanel_C_StartIntro_Params
{
public:
};

// 0x48 (0x48 - 0x0)
// Function PlayerSurveyPanel.PlayerSurveyPanel_C.ExecuteUbergraph_PlayerSurveyPanel
struct UPlayerSurveyPanel_C_ExecuteUbergraph_PlayerSurveyPanel_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x4(0x10)(ZeroConstructor, NoDestructor)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_1;            // 0x14(0x10)(ZeroConstructor, NoDestructor)
	bool                                         Temp_bool_Variable;                                // 0x24(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4344[0x3];                                     // Fixing Size After Last Property  [ Dumper-8 ]
	float                                        Temp_float_Variable;                               // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Temp_float_Variable_1;                             // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue;                // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue_1;              // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsMobilePlatform_ReturnValue;             // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4345[0x3];                                     // Fixing Size After Last Property  [ Dumper-8 ]
	float                                        K2Node_Select_Default;                             // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
