#pragma once

// Dumped by Twin1dev || Dumper-8

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function TournamentLiveGames.TournamentLiveGames_C.BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
struct UTournamentLiveGames_C_BndEvt__BackButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function TournamentLiveGames.TournamentLiveGames_C.Init
struct UTournamentLiveGames_C_Init_Params
{
public:
	class FString                                TournamentId;                                      // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                EventId;                                           // 0x10(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// 0x170 (0x170 - 0x0)
// Function TournamentLiveGames.TournamentLiveGames_C.EventColorize
struct UTournamentLiveGames_C_EventColorize_Params
{
public:
	struct FFortTournamentDisplayInfo            TournamentDisplayInfo;                             // 0x0(0x170)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// 0x0 (0x0 - 0x0)
// Function TournamentLiveGames.TournamentLiveGames_C.NotifyNoLiveGames
struct UTournamentLiveGames_C_NotifyNoLiveGames_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function TournamentLiveGames.TournamentLiveGames_C.NotifyLoadingMoreGames
struct UTournamentLiveGames_C_NotifyLoadingMoreGames_Params
{
public:
	bool                                         bIsLoading;                                        // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function TournamentLiveGames.TournamentLiveGames_C.HandleViewLiveGames
struct UTournamentLiveGames_C_HandleViewLiveGames_Params
{
public:
};

// 0x1B1 (0x1B1 - 0x0)
// Function TournamentLiveGames.TournamentLiveGames_C.ExecuteUbergraph_TournamentLiveGames
struct UTournamentLiveGames_C_ExecuteUbergraph_TournamentLiveGames_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1670[0x4];                                     // Fixing Size After Last Property  [ Dumper-8 ]
	class FString                                K2Node_CustomEvent_TournamentId;                   // 0x8(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                K2Node_CustomEvent_EventId;                        // 0x18(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FFortTournamentDisplayInfo            K2Node_CustomEvent_TournamentDisplayInfo;          // 0x28(0x170)()
	struct FLinearColor                          K2Node_MakeStruct_LinearColor;                     // 0x198(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x1A8(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_Event_bIsLoading;                           // 0x1B0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function TournamentLiveGames.TournamentLiveGames_C.CallEventLiveGamesBack__DelegateSignature
struct UTournamentLiveGames_C_CallEventLiveGamesBack__DelegateSignature_Params
{
public:
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
