#pragma once

// Dumped by Twin1dev || Dumper-8

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function UIEmitterElement.UIEmitterElement_C.EndofLife
struct UUIEmitterElement_C_EndofLife_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UIEmitterElement.UIEmitterElement_C.EventDestroy
struct UUIEmitterElement_C_EventDestroy_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UIEmitterElement.UIEmitterElement_C.StartAnim
struct UUIEmitterElement_C_StartAnim_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UIEmitterElement.UIEmitterElement_C.Construct
struct UUIEmitterElement_C_Construct_Params
{
public:
};

// 0x60 (0x60 - 0x0)
// Function UIEmitterElement.UIEmitterElement_C.ExecuteUbergraph_UIEmitterElement
struct UUIEmitterElement_C_ExecuteUbergraph_UIEmitterElement_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6412[0x4];                                     // Fixing Size After Last Property  [ Dumper-8 ]
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue;                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x10(0x10)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue_1;              // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_1;            // 0x28(0x10)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue_2;              // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue_3;              // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue_4;              // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimation_ReturnValue_5;              // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function UIEmitterElement.UIEmitterElement_C.EmitterDeath__DelegateSignature
struct UUIEmitterElement_C_EmitterDeath__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function UIEmitterElement.UIEmitterElement_C.EmitterBirth__DelegateSignature
struct UUIEmitterElement_C_EmitterBirth__DelegateSignature_Params
{
public:
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
